{"title":"Folder Lock v7.0.3 - (en)","uid":6822872,"size":8123221,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:006023b170f97a51defb33b4f68e1007dd425ebf&amp;dn=Folder+Lock+v7.0.3+-+%28en%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nikita200","files":-1,"time":1321462489,"description":"Folder Lock is a full suite solution for all your data security needs. It lets you keep your personal files protected in a variety of ways, in both PC and portable drives and offers optional backup of protected files to an online storage. Folder Lock comes with a perfect combination of seven (7) security tools, letting you encrypt your important files using 256-bit on-the-fly encryption; back them up in real-time to an online storage, and store them to any portable device. The program also lets you lock files, folders and drives; save your personal information in Wallets; shred files and clean your Windows History. Folder Lock comes with locking, encryption, shredding, stealth mode, hack attempt monitoring, portability, plug &amp; play support, history cleaning, and more than 20 privacy features all tailored to special needs for people wanting privacy and security. And now with additional security settings unheard before, including application level password security, stealth mode, hack security and auto protection.\n\n\nWith Folder Lock 7, you can now not only encrypt your data, but also make backups of that data to your exclusive online storage account. The subscription service, when used in conjunction with Folder Lock 7 Encryption feature, offers the greater benefits of a simultaneous, automatic and real-time encryption and backup, providing both secure backup &amp; recovery redundancy and the fastest data protection without the high cost. Your backups are stored online in a remote location, a cloud fully secured via government-grade encryption in a physically secured location.\n\nYour encrypted storages 'Lockers' are now truly dynamic, portable, faster to create, occupy lesser space when created and grow automatically when you add more files. You can now also open your Lockers from network locations and servers and can allow several users to store their data in them at the same time by setting Windows privileges on the mounted drive. You can also open multiple Lockers at the same time to transfer files between them. Furthermore, you can convert your Lockers to encrypted executable files using the 'Protect USB/CD' feature and can keep them in portable drives and access your data without requiring admin privileges and installation on other PC. Folder Lock 7 is better, faster, more feature-rich, user-friendly, and has a better and bigger user interface.\n\nFeatures and Benefits:\n- Encrypt Files. Encrypt your personal files using 256-bit on-the-fly encryption technology totally dynamic and fool-proof. \n- Backup Online. Backup all your encrypted files automatically to an online storage and easily restore it back. \n- Protect USB / CD. Convert your encrypted storages into executables and take your portable drives anywhere.\n- Lock Files. Protect important files from unwanted access by blocking visibility or accessto files, folders and drives. \n- Make Wallets. Store sensitive information in encrypted form. A safe haven for private info like Credit Cards and Bank Accounts. \n- Shred Files. Shred and permanently delete restorable files, folders and drives and even empty hard drive space. \n- Stealth Mode. Run Application in complete Stealth. Don't let anyone know you ever installed Folder Lock on your PC. \n- Hack Security. Don't let hackers use dictionary attacks. Monitor, control and perform actions on incorrect password attempts. \n- Password Security. Restrict access to various parts of the application with use of admin level master password.\n- Auto Protection. Set inactivity based security policy in order to secure everything when you're away from your PC.\n- Folder Lock works under all flavors of 32-bit and 64-bit versions of Windows 7/Vista/XP and later.\n\nChanges in Folder Lock 7.0.3 (November, 16th 2011):\n- enhanced application interface overhaul which keeps ease of use as paramount to user experience including minor obstructive glitches, fixes with inter-application compatibility.\n\n","torrent":{"xt":"urn:btih:006023b170f97a51defb33b4f68e1007dd425ebf","amp;dn":"Folder+Lock+v7.0.3+-+%28en%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"006023b170f97a51defb33b4f68e1007dd425ebf","infoHashBuffer":{"type":"Buffer","data":[0,96,35,177,112,249,122,81,222,251,51,180,246,142,16,7,221,66,94,191]},"announce":[],"urlList":[]}}