{"title":"Joshua Greene - The Terrible... Truth About Morality TTS","uid":7680778,"size":148842672,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:00b0e27782ef7a631331aaeb58290f11ba03c71b&amp;dn=Joshua+Greene+-+The+Terrible...+Truth+About+Morality+TTS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Partidge","files":2,"time":1348815318,"description":"Abstract\n\n&quot;In this essay I argue that ordinary moral thought and language is, while very natural, highly counterproductive and that as a result we would be wise to change the way we think and talk about moral matters. First, I argue on metaphysical grounds against moral realism, the view according to which there are first order moral truths. Second, I draw on principles of moral psychology, cognitive science, and evolutionary theory to explain why moral realism appears to be true even though it is not. I then argue, based on the picture of moral psychology developed herein, that realist moral language and thought promotes misunderstanding and exacerbates conflict. I consider a number of standard views concerning the practical implications of moral anti-realism and reject them. I then sketch and defend a set of alternative revisionist proposals for improving moral discourse, chief among them the elimination of realist moral language, especially deontological language, and the promotion of an anti-realist utilitarian framework for discussing moral issues of public concern. I emphasize the importance of revising our moral practices, suggesting that our entrenched modes of moral thought may be responsible for our failure to solve a number of global social problems.&quot;\n\nCreated using the text to speech voice neospeech Bridget. Enjoy reading one of the best works on metaethics I have ever read :)","torrent":{"xt":"urn:btih:00b0e27782ef7a631331aaeb58290f11ba03c71b","amp;dn":"Joshua+Greene+-+The+Terrible...+Truth+About+Morality+TTS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00b0e27782ef7a631331aaeb58290f11ba03c71b","infoHashBuffer":{"type":"Buffer","data":[0,176,226,119,130,239,122,99,19,49,170,235,88,41,15,17,186,3,199,27]},"announce":[],"urlList":[]}}