{"title":"Bodil Martensson - Rebeccas blod - 2009 - DAISY","uid":6806776,"size":302620846,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:022e28fb57368dea3784c5fc021b452acb41897e&amp;dn=Bodil+Martensson+-+Rebeccas+blod+-+2009+-+DAISY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":null,"files":-1,"time":1320891341,"description":"David Lehman hade redan innan isen smalt i whiskyn den kvallen bestamt sig - nu fick det vara slut pa fornedringen! Trakasserierna maste fa en ande, han stod inte ut langre. Han skulle ga till Vikens hamn, till stallet han tidigare sett ut. Beslutet att ta sitt elandiga liv var sedan lange oundvikligt.\n\nJohnny Mattson hade handlat de fornodenheter han ansag sig behova. Han ar just en sadan typ som utan att tveka skulle njuta av att driva nagon som David over kanten. Johnny brukar skjuta prick pa smadjur... for skojs skull.\n\nRebecca Ernfridsson har lange engagerat sig hart i kampen mot kvinnomisshandel. Tillsammans med vaninnan Viola Malmborg driver hon i Viken skyddsboendet &quot;KvinnoÃ‚Â¿borgen&quot;. En kringbyggd skanegard pa vagen ner mot hamnen.\n\nDavid visste inte mycket om verksamheten, och kande inte Rebecca. Han brydde sig heller inte ett dugg om att &quot;Kvinnoborgen&quot; var ovanligt dunkelt upplyst denna kvall. Det var ljuset som skramde honom - stralkastarna fran en svart pickup som plotsligt svangde upp pa infarten. David sokte instinktivt skydd i buskagen intill, fornedrad over sin egen radsla.\n\nForaren slackte stralkastarna men lamnade inte pickupen, vantade i bilen med motorn igang. Vantade pa vad...?\n\nInnan midnatt detta dygn svar David pa att han aldrig skall behova se Rebeccas blod flyta - igen! \n\n\nUpplasare: Dodo Parikas","torrent":{"xt":"urn:btih:022e28fb57368dea3784c5fc021b452acb41897e","amp;dn":"Bodil+Martensson+-+Rebeccas+blod+-+2009+-+DAISY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"022e28fb57368dea3784c5fc021b452acb41897e","infoHashBuffer":{"type":"Buffer","data":[2,46,40,251,87,54,141,234,55,132,197,252,2,27,69,42,203,65,137,126]},"announce":[],"urlList":[]}}