{"title":"Chakra Linux 2012.09","uid":7656302,"size":1666187264,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:04b7605fa68e14793ebc0a1ba390794010bed62e&amp;dn=Chakra+Linux+2012.09&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"JRepin","files":-1,"time":1348166651,"description":"Chakra is a free, user-friendly and extremely powerful GNU/Linux operating system based on the award winning KDE Software Compilation.\n\nOur goal with Chakra is to provide an operating system for desktops that is easy to use, but still has all the functionality, clarity, power and speediness of a KISS operating system. In the long term, we want to build an operating system that meets most requirements desktop users have today, like easy installation of software, graphical system administration, configuring power management on mobile devices or sharing an internet connection. To be better able to fulfill this goal, we strongly rely on users who report bugs, send in feature requests and ideas for improvements, and of course participate in development.\n\nAlthough this might sound like a distro for Linux newbies, these are not our only target audience, Chakra is made also for techy people and competent GNU/Linux users with a passion for KDE, KISS and such stuff, who don't fear to get their hands dirty but want to set up a usable desktop system quickly and easily.\n\nAfter the release of Claire-2012.08 well over a thousand packages were updated, including a new sound stack, updated poppler/openjpeg and OpenAl group, KDE-4.9.1, latest Calligra and LibreOffice. Because of all these changes, and to get back to having a release schedule that follows closely to the schedule KDE is using, Claire-2012.09 is following the first Claire ISO rather quickly. It also gives us a chance to fix some issues found in that first release. Chakra is making the switch to PulseAudio as default with this release.\n\nMore info: &lt;a href=&quot;\nhttp://chakra-linux.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://chakra-linux.org/&lt;/a&gt; &lt;a href=&quot;\nhttp://chakra-linux.org/news/index.php?/archives/75-Second-Claire-ISO-2012.09-released.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://chakra-linux.org/news/index.php?/archives/75-Second-Claire-ISO-2012.09-released.html&lt;/a&gt;","torrent":{"xt":"urn:btih:04b7605fa68e14793ebc0a1ba390794010bed62e","amp;dn":"Chakra+Linux+2012.09","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04b7605fa68e14793ebc0a1ba390794010bed62e","infoHashBuffer":{"type":"Buffer","data":[4,183,96,95,166,142,20,121,62,188,10,27,163,144,121,64,16,190,214,46]},"announce":[],"urlList":[]}}