{"title":"POtHS - Wars and Rumors of Wars - 12 - Secret Wars of the CIA","uid":7624140,"size":5257173302,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:056341f9f19f1b725a7ebe30fb83a60cd553c557&amp;dn=POtHS+-+Wars+and+Rumors+of+Wars+-+12+-+Secret+Wars+of+the+CIA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"POtHS11","files":-1,"time":1347394268,"description":"\n\nPOtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - Wars &amp; Rumors of Wars - 12 - Secret Wars of the CIA\n\n\n\n\n\nPOtHS - Wars and Rumors of Wars - 12 - Secret Wars of the CIA\n\n\n\nPOtHS Comments on This one: These are sick Bastards running these FAKE WARS.\n\n\nDescription:\nSecret Wars of the CIA - Lecture by John Stockwell:\nJohn Stockwell, former CIA Station Chief in Angola in 1976, working for then Director of the CIA, George Bush.  He spent 13 years in the agency.  He gives a short history of CIA covert operations.  He is a very compelling speaker and the highest level CIA officer to testify to the Congress about his actions.  He estimates that over 6 million people have died in CIA covert actions, and this was in the late 1980's.\n\nIn 1989, John Stockwell talked about the inner workings of the CIA. Topics included CIA destabilizing governments in Angola and other countries and setting up drug cartels as part of covert operations in certain countries. After his presentation he responded to audience members' questions.  \n\n\nUS Foreign Policy Secret Wars of the CIA:\nThe history of the terrorism conducted by the CIA, since the end of the World War II when countries in Asia and Latin America, were trying to make changes to improve their economical and political situation, the Unite States of North America realized that it was not good for their status as new super power; and began a new campaign, with only one rule, Anything Goes. This is the story of the terrorism of the CIA.\n\n\nMKULTRA CIA Mind Control Research Documentary:\nThere have been numerous experiments performed on human test subjects in the United States that have been considered unethical, and were often performed illegally, without the knowledge, consent, or informed consent of the test subjects.\n\n","torrent":{"xt":"urn:btih:056341f9f19f1b725a7ebe30fb83a60cd553c557","amp;dn":"POtHS+-+Wars+and+Rumors+of+Wars+-+12+-+Secret+Wars+of+the+CIA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"056341f9f19f1b725a7ebe30fb83a60cd553c557","infoHashBuffer":{"type":"Buffer","data":[5,99,65,249,241,159,27,114,90,126,190,48,251,131,166,12,213,83,197,87]},"announce":[],"urlList":[]}}