{"title":"The Middle Temple Murder by J. S. Fletcher [republicV]","uid":7762852,"size":1306495,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:05837dd36da5047b08174912c80bb566a4554bbd&amp;dn=The+Middle+Temple+Murder+by+J.+S.+Fletcher+%5BrepublicV%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"republicV","files":5,"time":1351282163,"description":"Joseph Smith Fletcher (7 February 1863 - 30 January 1935) was a British journalist and writer. He wrote more than 230 books on a wide variety of subjects, both fiction and non-fiction. He was one of the leading writers of detective fiction in the &quot;Golden Age&quot;.\nFletcher was born in Halifax, West Yorkshire, the son of a clergyman. He was educated at Silcoates School in Wakefield. After some study of law, he became a journalist. His first books published were poetry. He then moved on to write numerous works of both historical fiction and history, many dealing with Yorkshire, which led to his selection as a fellow of the Royal Historical Society. In 1914 he wrote his first detective novel and went on to write over a hundred, many featuring the private investigator Ronald Camberwell.\nHe was married to the Irish writer Rosamond Langbridge, with whom he had one son.\nFrom Wikipedia\n\nExcerpt:\nSpargo lived in Bloomsbury on the west side of Russell Square. Every night and every morning he walked to and from the Watchman office by the same route-Southampton Row Kingsway the Strand Fleet Street. He came to know several faces especially amongst the police; he formed the habit of exchanging greetings with various officers whom he encountered at regular points as he went slowly homewards smoking his pipe.","torrent":{"xt":"urn:btih:05837dd36da5047b08174912c80bb566a4554bbd","amp;dn":"The+Middle+Temple+Murder+by+J.+S.+Fletcher+%5BrepublicV%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05837dd36da5047b08174912c80bb566a4554bbd","infoHashBuffer":{"type":"Buffer","data":[5,131,125,211,109,165,4,123,8,23,73,18,200,11,181,102,164,85,75,189]},"announce":[],"urlList":[]}}