{"title":"Back to the Future 2(1989)DVDRip.AC3(ENG)-DROCK","uid":7617118,"size":735670272,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:063c74d9b633ce7a507bd75539d3f059d3098c4d&amp;dn=Back+to+the+Future+2%281989%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1347231589,"description":"So I went looking through all of my torrents today. I read some of the nice and dip shit comments some of you left. So to all of seeders and people that download my torrents, thank you very much. To the people that don't like my uploads, I don't know haters going to hate right? (This movie was skipping so I got a new dvd and ripped it again, works.)\n\nThings have barely settled from the excitement and resolve of the original Back to the Future, when in pops that crazy inventor Dr. Emmett Brown (Christopher Lloyd) with news that in order to prevent a series of events that could ruin the McFly name for posterity, Marty McFly (Michael J. Fox ) and his girlfriend are whisked into the future to the year 2015, where Marty must tangle with a teen rogue named Griff, who's obviously the descendant of Biff, the first Future film's bully. Marty foils Griff and his group when he jumps on an air-foil skateboard that flies him through town at rakish speeds with the loser bullies beaten again. Marty gets a money-making brainstorm before hopping in the time-traveling DeLorean, and he purchases a sports almanac. He figures that back in 1985 he'll be able to place sure-fire bets using the published sports scores of the games that are yet to happen. Unfortunately for Marty, Dr. Brown disapproves of his betting scheme -- he feels too much messing with time is very dangerous -- and he tosses the almanac. A hidden Biff overhears the discussion about the almanac, sees it get tossed out, and grabs it. Thus begins a time-traveling swirl to make the head spin. Biff swipes the DeLorean, heads back to 1955, and with the help of the unerring almanac, bets his way to power. The now-altered &quot;Biff world&quot; has turned into a nightmarish scene with Biff the mogul, residing in a Vegas-styled pleasure palace and running everything. It's all our hero Marty can do to pull the pieces together this time, as he must jump between three generations of intertwined time travel. The end of Back to the Future, Part 2 introduces its sequel as the zany professor has already time-dashed away to the Wild West of the late 1800s and invites Marty into a new adventure.\n\nRipped with Autogk\n\nLength: 1 Hour 48 Minutes\n\nFile Type: AVI\n\nFrame Width: 612\n\nFrame Height: 320\n\nFrame Rate: 25fps\n\nAudio\n\nBit Rate: 128kbps","torrent":{"xt":"urn:btih:063c74d9b633ce7a507bd75539d3f059d3098c4d","amp;dn":"Back+to+the+Future+2%281989%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"063c74d9b633ce7a507bd75539d3f059d3098c4d","infoHashBuffer":{"type":"Buffer","data":[6,60,116,217,182,51,206,122,80,123,215,85,57,211,240,89,211,9,140,77]},"announce":[],"urlList":[]}}