{"title":"Black Sabbath and Philosophy - Mastering Reality[.xtend.]","uid":7801397,"size":3811109,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:06cc6cde8bb18dca4c6894057969b6b9aaa446b1&amp;dn=Black+Sabbath+and+Philosophy+-+Mastering+Reality%5B.xtend.%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":".xtend.","files":-1,"time":1352294360,"description":"William Irwin, &quot;Black Sabbath and Philosophy: Mastering Reality&quot;\n2012 | ISBN-10: 1118397592 | PDF, EPUB | 224 pages | 4 MB\n\nA philosophical look at heavy metal's dark masters of reality, Black Sabbath\n\nBlack Sabbath is one of the world's most influential and enduring rock bands. Dubbed &quot;the Beatles of heavy metal&quot; by Rolling Stone, they helped to define a genre with classic songs like &quot;Paranoid&quot;, &quot;Iron Man&quot;, and &quot;War Pigs&quot;, songs whose lyrics reveal hidden depth and philosophical insight. Their songs confront existential despair, social instability, political corruption, the horrors of war, and the nature of evil. This book explores the wide range of profound ideas in the band's music and lyrics to help you understand Black Sabbath as never before.\nDiscusses and debates essential Black Sabbath topics and themes, such as the problem of evil, &quot;War Pigs&quot; and the nature of just war theory, whether or not Sabbath is still Sabbath without Ozzy, and whether &quot;evil is in the ear of the beholder&quot;\nGives you new perspectives on Black Sabbath's music and lyrics\nProvides a deeper appreciation and understanding of Ozzy Osbourne, Tony Iommi, Geezer Butler, Bill Ward, and Ronnie James Dio\nBrings some of history's heaviest thinkers to bear on the band's music, from Aristotle and Nietzsche to Schopenhauer and Marx\n\nSo . . . can you help me, occupy my brain? Yes! Start reading Black Sabbath and Philosophy. ","torrent":{"xt":"urn:btih:06cc6cde8bb18dca4c6894057969b6b9aaa446b1","amp;dn":"Black+Sabbath+and+Philosophy+-+Mastering+Reality%5B.xtend.%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06cc6cde8bb18dca4c6894057969b6b9aaa446b1","infoHashBuffer":{"type":"Buffer","data":[6,204,108,222,139,177,141,202,76,104,148,5,121,105,182,185,170,164,70,177]},"announce":[],"urlList":[]}}