{"title":"FireLords HD v1.0.2 Final By bobiras2009","uid":7656770,"size":14334411,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:07fc6d130b41c29ce6a0f4c34c4c96a8c9ab36fb&amp;dn=FireLords+HD+v1.0.2+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bobiras2009","files":-1,"time":1348178804,"description":"Follow my uploads here:                   &lt;a href=&quot;\nhttps://forum.suprbay.org/member.php?action=profile&amp;uid=311481&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/member.php?action=profile&amp;uid=311481&lt;/a&gt;    \n\nYou can make requests here:                    &lt;a href=&quot;\nhttps://forum.suprbay.org/forumdisplay.php?fid=4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/forumdisplay.php?fid=4&lt;/a&gt;\n                 \n\n                                By bobiras2009\t\t\n\n\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\nFireLords is fast arcade game with literally explosive gameplay. If you like Bomberman, Dynablaster or similar games you should definitely try FireLords!\n\nINSTRUCTIONS-READ FIRST! :-)\n\n    Tilt your device to move the hero, touch anywhere on screen to place a bomb.\n    Alternatively turn TILT control off on main menu screen and use on-screen joystick. Touch on right half of the screen to move the hero and on the left half of the screen to place the bomb.\n\nFeatures:\n\n    Smart enemies - with variable behaviour and intelligence\n    Four episode packs - enjoy beautiful HD graphics and unique gameplay factors in each episode\n    More than 40 levels - including 5 secret ones. Will you be able to find them all?\n    Gameplay innovations - bonuses (speed, bombs, range, shield, ...), black fog, explosive barrels, destroyable ground\n    Days of fun - play the levels again to get another unique experience and earn more stars to unlock new episodes, find secret levels\n    Precise control - whether you prefer using your accelerometer/g-sensor for TILT control or on-screen joystick (d-pad), we have worked hard to implement the best possible response\n    Limited-time introductory offer - buy our game now for just 50% price!\n\nTIPS:\n\n    See gameplay video how to control the on-screen joystick best. Because it's hard for players to memorize where lies the center where they put their finger, it is best to just drag into direction you want the hero to move and when you want to change the direction or stop, raise your finger of the screen. Then drag again in the new desired direction.\n    You can disable TILT control on main menu screen (middle button) and switch between left/right halves of the screen (right button) if you prefer to place the bombs with right hand and move the hero with left hand.\n    Want to gain more stars from the levels? Try to destroy all the boxes (you might find entrance to secret level as well ;)) and try to earn more score by combos - destroy at least 2 boxes at once or kill at least 2 enemies at once.\n\nWhat's in this version : (Updated : Sep 18, 2012)\n\n    We have redrawn TILT button and made it more clear which control is active (TILT or on-screen joystick). Hopefully no more confused players using both accelerometer and on-screen touch at once :)\n    Game font replaced by much nicer version (thanks for tip AndroidPolice.com! :))\n    FireLords HD for mobiles and tablets released.\n\nRequired Android O/S : 2.0.1+\n\n\n                                By bobiras2009\t\t\n","torrent":{"xt":"urn:btih:07fc6d130b41c29ce6a0f4c34c4c96a8c9ab36fb","amp;dn":"FireLords+HD+v1.0.2+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07fc6d130b41c29ce6a0f4c34c4c96a8c9ab36fb","infoHashBuffer":{"type":"Buffer","data":[7,252,109,19,11,65,194,156,230,160,244,195,76,76,150,168,201,171,54,251]},"announce":[],"urlList":[]}}