{"title":"Way Beyond Monochrome, 2ndEd {BBS}","uid":7787811,"size":53722259,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:08aa74e9d425044c0d70133beccff3e182aaf90b&amp;dn=Way+Beyond+Monochrome%2C+2ndEd+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bigbluesea","files":-1,"time":1351904135,"description":"Photo Techniques Magazine stated: &quot;All our readers need to know about this very useful book.&quot; Indeed, there is no other compendium that is as in-depth as this for the beauty and magic of fine-art black-and-white photography. With 560 pages and over 1,000 illustrations, Way Beyond Monochrome starts with conceptual lessons of composition and takes you through image capture, exposure, controlling tonality, variable-contrast paper, archival printing, mounting, framing and presentation with simple concepts to an advanced level. This new edition has been completely revised and heavily expanded, adding over 250 pages to the original edition with new chapters on print mounting, spotting, framing, digital negatives, utilizing digital technologies for alternative processes, and fabulous do-it-yourself projects. Overall, the authors have created a thoroughly researched, technologically sound yet aesthetically pleasing, inspirational bible for monochrome photography.\n\nNew to this edition:\n\n    * almost double the content\n\n    * a new section discussing the path from visualization to print, illustrating the interaction between eye and brain, explaining the rules of composition and when to break them to produce photographs with impact\n\n    * a new section on presentation including hands-on mounting, matting, spotting, and framing\n\n    * image capture has a more in-depth focus, now covering pinhole photography and digital capture\n\n    * now includes making and printing with digital negatives\n\n    * a new section discussing the pros and cons of typical image-taking and image-making equipment\n\n    * plus new do-it-yourself projects, including many darkroom tools and an electronic shutter tester\n\n    * a useful collection of templates, to copy, cut-out and take with you in your camera bag or use in the darkroom\n\n    * an appendix with all the recipes to make your own darkroom chemicals from scratch\n\n    * all illustrations improved and updated\n\n    * improved index with 1,400 references\n\n\n# Hardcover: 560 pages\n# Publisher: Focal Press; 2 edition (September 24, 2010)\n# Language: English\n# ISBN-10: 0240816250\n# ISBN-13: 978-0240816258","torrent":{"xt":"urn:btih:08aa74e9d425044c0d70133beccff3e182aaf90b","amp;dn":"Way+Beyond+Monochrome%2C+2ndEd+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08aa74e9d425044c0d70133beccff3e182aaf90b","infoHashBuffer":{"type":"Buffer","data":[8,170,116,233,212,37,4,76,13,112,19,59,236,207,243,225,130,170,249,11]},"announce":[],"urlList":[]}}