{"title":"POtHS 2 - Bible Study - Part 94 - New Age Emerging Church One Wo","uid":7620523,"size":6939837283,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:08b30fd97214fc08b186437e5d7333844982a6db&amp;dn=POtHS+2+-+Bible+Study+-+Part+94+-+New+Age+Emerging+Church+One+Wo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"POtHS11","files":93,"time":1347314305,"description":"\n\nPOtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - Bible Study - 94 - New Age Emerging Church One World Religion Vol 6 - Alien End Times Decpetion\n\n\nPOtHS Comment: Excellent\n\nDescription:\n\nThe UFO Phenomenon - The Next Great Challenge for the Church by Scott Johnson:\nEvolutionists believe that life must have evolved elsewhere in their massive (and old) universe, and that Christians are arrogant to presume that Earth is the only place in the entire universe that contains life. The interest in the search for extraterrestrial life is huge-mainly fueled by the enormous popularity of science fiction ('District 9' being the latest example) and its depiction of advanced alien life on other planets. Exopolitics is the growing movement that believes humans should publicly open dialogue with extraterrestrials. Gaven C. wrote to Gary Bates: &quot;...just been watching the European Exopolitics 2009 in Spain on-line, Dr. Steven Greer (Of 'The Disclosure Project') is channeling aliens and encouraging everyone else to do so, the worrying thing is that they're answering, and he briefs the president on such issues. I just get the feeling that there is a paradigm shift happening right now in our culture, real fast, and it's taking the church by surprise, how this all ties in with end time prophesy I'm still processing...It certainly strikes me that if Christians aren't really founded firm on the Word with a creation world view then they will be hoodwinked by the E.T.'s, that these entities are here to &quot;help us up to the next rung of our &quot;evolutionary development&quot;, even claiming to be our creators. Will this be the great falling away?\n\n&quot;Behind the scenes, high-ranking Air Force officers are soberly concerned about UFOs. But through official secrecy and ridicule, many citizens are led to believe the unknown flying objects are nonsense.&quot; Admiral Roscoe Henry Hillenkoetter, First director of the CIA.\n\n\nParallel Dimensions  Power of Blood - Rev Jim Wilhemsen:\nParallel Dimensions A 21st Century Gospel.  From the author of &quot;Beyond Science-Fiction&quot;, Rev. Jim Wilhelmsen about Parallel Dimensions, Time, Space, Eternity, the Power of Blood, the Garden of Eden, the Tower of Babel, Stargates, genetic engineering, UFOs, Aliens, Fallen Angels, Angels, God's Kingdom and the Bible.\n\n","torrent":{"xt":"urn:btih:08b30fd97214fc08b186437e5d7333844982a6db","amp;dn":"POtHS+2+-+Bible+Study+-+Part+94+-+New+Age+Emerging+Church+One+Wo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08b30fd97214fc08b186437e5d7333844982a6db","infoHashBuffer":{"type":"Buffer","data":[8,179,15,217,114,20,252,8,177,134,67,126,93,115,51,132,73,130,166,219]},"announce":[],"urlList":[]}}