{"title":"Medal of Honor Warfighter - How to get past crash [car chase]","uid":7757527,"size":1386,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:099dbf7828e63826d7b39e28f901d6f707da7b93&amp;dn=Medal+of+Honor+Warfighter+-+How+to+get+past+crash+%5Bcar+chase%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"darkgodbm","files":1,"time":1351143036,"description":"Just look at the torrent description, no need to download anything!!!\n\nHere's how it went:\n\n\nAfter looking through other torrents here, I was aware the crash could happen with me. To clarify, I'm using the Limited Edition (UNLOCK-p2p release) with the recently uploaded update - FLT available here, which is 375.85mb. But I don't think it is necessary.\n\nI did get the crash on the first time. Didn't even get to show me the hospital scene starting, just heard Preacher's voice and then it f'ed up. NOW, while going at the end of the car chase again, I started to ALT-TAB in hopes of not necessarily having to WATCH that video. I know that it sometimes pauses a video if you do it, BUT, this first time, as I pressed the keys and it went back to desktop, I had my mouse over the game's icon in the taskbar, and guess what? The entire video was displayed throught that small thumbnail Windows 7 does when you minimize a player, and when I saw the black screen with Preacher's name on it (indicative of &quot;mission starting&quot;) I just went back to it. WOOHOO!\n\nImportant observation: I also had FRAPS running along, but I don't think it could have had any influence at all (you'll notice the yellow FPS numbers on the upper left corner of the thumbnail too).\n\n\n\nHere's a printscreen, just to make  it 100% clear: \n\n\n(sorry I missed it in the other torrent)\n\n\nEnjoy!","torrent":{"xt":"urn:btih:099dbf7828e63826d7b39e28f901d6f707da7b93","amp;dn":"Medal+of+Honor+Warfighter+-+How+to+get+past+crash+%5Bcar+chase%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"099dbf7828e63826d7b39e28f901d6f707da7b93","infoHashBuffer":{"type":"Buffer","data":[9,157,191,120,40,230,56,38,215,179,158,40,249,1,214,247,7,218,123,147]},"announce":[],"urlList":[]}}