{"title":"The Tripods(bbc)","uid":6806987,"size":1002956731,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:09dc596e2af2e657db6594461c4e232576bbd205&amp;dn=The+Tripods%28bbc%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"scheister","files":1,"time":1320903383,"description":"video codec: 3gp\nresolution: 144x176\nvideo bit rate: 256 kbs\naudio bit rate: 64 kbs\n15 fps\nthese videos were formatted for play on most cellphones capable of playing back or recording video. the quality of the videos are not bad considering your watching them on a max resolution of 240x320. these episodes are 26 minutes long avg, the perfect thing to watch at lunch break while eating some food and smoking a bowl, enjoy!\n\n\nThe story of The Tripods is a variation on post-apocalyptic literature. Humanity has been conquered and enslaved by &quot;the tripods&quot;, unseen alien entities (later identified as &quot;Masters&quot;) who travel about in gigantic three-legged walking machines. Human society is largely pastoral, with few habitations larger than villages, and what little industry exists is conducted under the watchful presence of the tripods. Lifestyle is reminiscent of the Middle Ages, but artifacts from later ages are still used, giving individuals and homes an anachronistic appearance.\n\nHumans are controlled from the age of 14 by implants called &quot;caps&quot;, which suppress curiosity and creativity and leave the recipient placid and docile, incapable of dissent. The caps cause them to worship the tripods. Some people, whose minds are broken (instead of successfully being controlled) under the pressure of the cap's hypnotic power become vagrants, who wander the countryside.","torrent":{"xt":"urn:btih:09dc596e2af2e657db6594461c4e232576bbd205","amp;dn":"The+Tripods%28bbc%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09dc596e2af2e657db6594461c4e232576bbd205","infoHashBuffer":{"type":"Buffer","data":[9,220,89,110,42,242,230,87,219,101,148,70,28,78,35,37,118,187,210,5]},"announce":[],"urlList":[]}}