{"title":"POtHS - Holy Treasures - 27 - Archaeology  Digging for Truth","uid":7629267,"size":4433324907,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:09fbc91ac12c6824e6c0759a47036123bb5e046a&amp;dn=POtHS+-+Holy+Treasures+-+27+-+Archaeology++Digging+for+Truth&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"POtHS11","files":76,"time":1347495006,"description":"\n\nPOtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - Holy Treasures - 27 - Archaeology  Digging for Truth\n\nPOtHS Comment: Your chances of your Christian[/color]\nDescription:\n\nArchaeology - Digging for the Truth of the Bible:\nCan the Old Testament be trusted for its historical account and does archeology provide evidence for its accuracy. What does the evidence say? Dr. Patton has personally investigated the claims and presents the evidence in a way that will allow you to draw your own conclusions.\n\n\nBanned Archeological Proof Bible is Fact:\nThe Discovery of...\n- Noah's Ark\n- Sodom and Gomorrah\n- Mount Sinai\n- The Red Sea Crossing\n- The Ark of the Covenant\n\nBy the real Indiana Jones, Ron Wyatt\n\nSeriously, this should be mainstream stuff, but as always, when it comes to the truth there is a complete media black-out.\n\n*****************************Warning*******************************\nOriginal Uploader's comments: As I always tell my family &amp; friends- I would never present information I felt was false. Nor do I expect you to believe something based simply on me telling it to you. Point is, ALWAYS do your own research, and verify if what is presented is in fact true.\n\nWhich leaves the Question...\n\nIn a time of Major Earthquakes, Tornado Swarms, Tsunamis, HAARP, Chem trails, Nuclear Radiation, GMOs, Wars, Economic Slavery, Consolidated World Power, Planet X, etc...\n\nIsn't it time to read the Bible?\nPraise Jesus our Savior\n---------------------------------------------------------\n\n\nArchaeological evidence for the Bible:\nRonn Wyatt has made many discoveries, proving the Bible to be true. view for yourself, and you decide. As God's treasures are revealed thru Noah's Ark, Sodom &amp; Gomorrah, the Dead Sea Crossing, Mt. Sinai, and the Ark of the Covenant.  I hope you enjoy this as much as I.\n---------------------------------------------------------\n\n\nThe Ark of the covenant found - now revealed the blood of Christ on the mercy seat:  \nRon Wyatt has made many discoveries pertaining to he Bible. All things will be revealed in their time. God takes no pleasure in what He must do to those who do not believe in Him. All of mankind was created by God, and He wishes none should parish. And sin will never rise a second time. As sure as these Scriptures are true. So will the Ark of the Covenant be revealed in it's time. None will be without excuse, when He comes back for His people.\n---------------------------------------------------------\n\nGiant Skeletons:\nWow... learn the archeological Truth of the Nephilim as was presented in the Bible but hidden from the public.\n\n\nNO! God really did create this world in six (6) literal 24-hour days. Reference: Psalms 51\n\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nThese Torrents are currently on a Free Leech --  High Speed Server\n\n","torrent":{"xt":"urn:btih:09fbc91ac12c6824e6c0759a47036123bb5e046a","amp;dn":"POtHS+-+Holy+Treasures+-+27+-+Archaeology++Digging+for+Truth","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09fbc91ac12c6824e6c0759a47036123bb5e046a","infoHashBuffer":{"type":"Buffer","data":[9,251,201,26,193,44,104,36,230,192,117,154,71,3,97,35,187,94,4,106]},"announce":[],"urlList":[]}}