{"title":"FBI File Roy Cohn","uid":7803674,"size":141221411,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0af3b76be88ca675159e1dc86e469f91c1a6700f&amp;dn=FBI+File+Roy+Cohn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"CovertHistory","files":23,"time":1352345085,"description":"Brought to you by Covert History        &lt;a href=&quot;\nhttp://CovertHistory.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://CovertHistory.com&lt;/a&gt;\n\nRoy Marcus Cohn was born in New York City on February 20, 1927 to Albert Cohn a New York State judge. After attending the Columbia Law School, Cohn passed the New York State Bar exam at the age of twenty-one. He became an Assistant U.S. Attorney for the Southern district of New York state. He played a significant role in the prosecution of Julius and Ethel Rosenberg in 1951. Cohn's cross examination of Ethel Rosenberg's brother is seen as the central event in that trial, which lead to the Rosenbergs' conviction and execution. In 1952 Senator Joseph McCarthy made Roy Cohn the chief counsel to the Government Committee on Operations of the Senate. Cohn became famous for his aggressive style during the McCarthy-Army hearings. After McCarthy was censured in 1954, Cohn went into private practice. Over the next thirty years his clients included John Gotti, Donald Trump, Tony Salerno, and the Catholic Archdiocese of New York. Cohn advised presidents Richard Nixon and Ronald Reagan. Under charges of unethical and unprofessional conduct, Cohn was disbarred by the New York State Bar in 1986. Cohn died one month later on August 2, 1986. Files contain approximately 1,150 discernable memos. File date from 1952 to 1985. Included in the files are memos, newspaper clippings, teletypes, reports, and affidavits. Amiong the material found in the files are: Memorandums written by former FBI Assistant Director L.B. Nichols on his contact with Cohn. Roy Cohn's comments on cases such as the Lattimore and Morton Sobell cases. Cohn's belief that supporters of the Rosenbergs tapped his phone and bugged his office. Cohn's conflicts with Senator Joseph McCarthy. Cohn being upset over not being invited to the Christmas 1952 New York FBI bureau party. A 1973 investigation into whether a 100 foot yacht named &quot;Defiance&quot; and possibly owned by Roy Cohn was sunk to gain insurance money.","torrent":{"xt":"urn:btih:0af3b76be88ca675159e1dc86e469f91c1a6700f","amp;dn":"FBI+File+Roy+Cohn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0af3b76be88ca675159e1dc86e469f91c1a6700f","infoHashBuffer":{"type":"Buffer","data":[10,243,183,107,232,140,166,117,21,158,29,200,110,70,159,145,193,166,112,15]},"announce":[],"urlList":[]}}