{"title":"Up with Chris Hayes 9-8-12.mp4","uid":7616400,"size":341816853,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0b127f242bbbc905c337c133c2d0e280463456ce&amp;dn=Up+with+Chris+Hayes+9-8-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"liberal42","files":-1,"time":1347212165,"description":"Up with Chris Hayes; Saturday, September 8, 2012.\n\nOn Sept. 8th's show, Chris and his guests examined how President Obama walked the fine line between hope and reality in his convention speech. They reviewed the evolution of the Democratic Party's platform from 2004 to 2012, and discussed the Democrats' embrace of the culture wars. Plus, later they delved into the political significance of Michelle Obama's description of herself as &quot;mom-in-chief&quot; in her convention speech, and the contested political terrain of motherhood.\n\nJoining Chris were:\n\nVictoria DeFrancesco Soto (MSNBC contributor, communications director for Latino Decisions and visiting scholar at the University of Texas-Austin). \n\nRep. Jerrold Nadler (D-NY), (represents the 8th congressional district of New York). He is currently serving his 10th term in Congress.\n\nJohn McWhorter (Professor of Linguistics at Columbia University, contributing editor at the New Republic and Daily News columnist).\n\nJoe Weisenthal (deputy editor at Business Insider.)  \n\nJared Bernstein (MSNBC contributor, senior fellow at the Center for Budget &amp; Policy Priorities, and former Chief Economist &amp; Economic Policy Advisor to Vice President Joe Biden (2009-2011)) joined via satellite to discussed Obama's speech and the auto bailout.\n\nNancy Keenan (President of NARAL Pro-Choice America) joined and replaced Joe Weisenthal on the panel as they talked about how Democrats feel they can win certain culture wars.\n\nStan Greenberg (democratic pollster, co-author of &quot;It's the Middle Class Stupid!&quot; and co-founder of the organization Democracy Corps with James Carville) joined via satellite and discussed culture wars.\n\nKristin Rowe-Finkbeiner (executive director and CEO of MomsRising) replaced \nVictoria DeFrancesco Soto on the panel.\n\nJessica Valenti (founder of Feministing.com and author of &quot;Why Have Kids?: A New Mom Explores the Truth About Parenting and Happiness&quot;) joined via satellite and the new panel discussed motherhood.) This segment skipped over 'Now We Know'.","torrent":{"xt":"urn:btih:0b127f242bbbc905c337c133c2d0e280463456ce","amp;dn":"Up+with+Chris+Hayes+9-8-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b127f242bbbc905c337c133c2d0e280463456ce","infoHashBuffer":{"type":"Buffer","data":[11,18,127,36,43,187,201,5,195,55,193,51,194,208,226,128,70,52,86,206]},"announce":[],"urlList":[]}}