{"title":"POtHS - Super Natural Realms - UFOs Angels Spirits Witches and D","uid":7643639,"size":4796666546,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0b16ef9c20c0a6ab762ea25dcd861d8aec373f83&amp;dn=POtHS+-+Super+Natural+Realms+-+UFOs+Angels+Spirits+Witches+and+D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":-1,"time":1347844125,"description":"\n\nPOtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - Super Natural Realms - UFOs Angels Spirits Witches and Demons Vol 20 - Above Top Secret\n\n\n\nPOtHS says: Yahweh the Creator needs NO SPACESHIP or Mechanical device to do what He does. There are 2 types of inter-dimensional travelers. Yahweh, Jesus, The Holy Spirit obviously and the unfallen (HEAVENLY) angels that require nothing mechanical to dimension travel, however, The Fallen Angels seem to have lost some of their power and need artificial means to manipulate the different dimensions. EVERYTHING coming in a spaceship is of Satan not The Holy Yahweh. I am told that there are 11 different dimensions needed for The Creator to do his thing. Passing from one Dimension to the other is a mere thought for the Holy Ones. What that means is, they can move around the Universe as fast as they can think about it. This is what Faith is about. Believing something with all your Heart and Soul without having a shred of Four Dimensional evidence. (Evidence as we know of within this reality) There is another form of Evidence out there that secular man cannot understand or measure. It comes from outside this cursed dimension that us Pilgrims are stranded on or in. The real world, the eternal HOLY Spirit World, the world along side the Father, Son and Holy Spirit is The Real Reality that I seek. THERE IS NO WAY FOR ME TO ATTAIN THAT!!! I am a Journeyman Sinner and my salvation is only possible through My Repentance of Sin AND the Grace, the Mercy and The Spilled Blood of our Lord and Savior, Jesus Christ. PEACE TO ALL. Time is Short brethren, save as many as you can. The time of &quot;NO SECOND CHANCE&quot; draws near for ALL EARTH DWELLERS.  \n\nDescription:\n\nDeep Underground Military Bases by the late Phil Schneider:\n(Nov 1995)  This is the last known video of Phil Schneider. He was murdered two months later to suppress his free speech. This is some serious stuff, and if people can't mature themselves and come to terms with the new world order we'll all be dead in 30 years.  Phil talks about DUMBs, FEMA Camps, Aliens/Nephilim, UFO's, Alien Technologies, the New World Order &amp; More.\n\n\nThe Hollow Earth &amp; Its Inhabitants by Jim Wilhelmsen:\nFrom the author of &quot;Beyond Science-Fiction&quot;, Rev. Jim Wilhelmsen on Hollow Earth and its Inhabitants, according to the scriptures in the Bible as well as history, myth and Archeology.\n\nIs there a real Hollow Earth?\nWhat does science say and what does the bible tell us.\nIs hell a real physical place?\nWhat do the scriptures say about the origins of Giants before and after the flood?\nWhat has recent science discovered about pre-flood conditions and giantism?\nWhy Giant Fossil remains, bones and mummies are not viewed in public museums?\n &lt;a href=&quot;\nhttp://www.echoesofenoch.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.echoesofenoch.com/&lt;/a&gt;\n\n\n\n                                           \n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n","torrent":{"xt":"urn:btih:0b16ef9c20c0a6ab762ea25dcd861d8aec373f83","amp;dn":"POtHS+-+Super+Natural+Realms+-+UFOs+Angels+Spirits+Witches+and+D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b16ef9c20c0a6ab762ea25dcd861d8aec373f83","infoHashBuffer":{"type":"Buffer","data":[11,22,239,156,32,192,166,171,118,46,162,93,205,134,29,138,236,55,63,131]},"announce":[],"urlList":[]}}