{"title":"Exconvictos 1x07 HDTV Spanish by tony","uid":6808245,"size":366507226,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0d0b193c4b6a668c729c8303ea929ad3d6c68f8a&amp;dn=Exconvictos+1x07+HDTV+Spanish+by+tony&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"carambolas","files":3,"time":1320946336,"description":"Si quieres mas series, peliculas, juegos, etc... tanto por descarga directa como por torrent. visitanos:\n\n\nDe Matt Olmstead y Nick Santora, productores de la exitosa Prison Break, llega Breakout Kings, una nueva serie de acciÃƒÂ³n que muestra la sociedad poco convencional que se establece entre dos U.S. Marshals y un grupo de convictos, que trabajan juntos para capturar a peligrosos fugitivos. DespuÃƒÂ©s de 72 horas, las posibilidades de encontrar a un prisionero que se ha escapado caen a menos de un cinco por ciento. Sabiendo que hay pocas cosas mÃƒÂ¡s peligrosas que un convicto a la fuga, y cansados de los mÃƒÂ©todos de las fuerzas de la ley, dos veteranos oficiales de los U.S. Marshals deciden rechazar los protocolos de actuaciÃƒÂ³n y usar ex-fugitivos para capturar a los que se han dado a la fuga.\n\nPara poder capturar presos fugados, una divisiÃƒÂ³n de los U.S. Marshals pacta con un grupo de presos que se han fugado en el pasado. Si aceptan ayudar, sus condenas se reducirÃƒÂ¡n y las cumplirÃƒÂ¡n en prisiones de mÃƒÂ­nima seguridad. Si por el contrario se aprovechan de la situaciÃƒÂ³n para intentar huir, volverÃƒÂ¡n a la prisiÃƒÂ³n de mÃƒÂ¡xima seguridad donde se encuentran y se duplicarÃƒÂ¡n sus condenas.","torrent":{"xt":"urn:btih:0d0b193c4b6a668c729c8303ea929ad3d6c68f8a","amp;dn":"Exconvictos+1x07+HDTV+Spanish+by+tony","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d0b193c4b6a668c729c8303ea929ad3d6c68f8a","infoHashBuffer":{"type":"Buffer","data":[13,11,25,60,75,106,102,140,114,156,131,3,234,146,154,211,214,198,143,138]},"announce":[],"urlList":[]}}