{"title":"I2P 0.9.3","uid":7792640,"size":12809089,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0d4eae46534f9945496547c740cd6f0f38df2b3c&amp;dn=I2P+0.9.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"wearehidden","files":1,"time":1352060842,"description":"I2P 0.9.3   \n\n\nI2P is an anonymizing network, offering a simple layer that identity-sensitive applications can use to securely communicate. All data is wrapped with several layers of encryption, and the network is both distributed and dynamic, with no trusted parties.\n\nMany applications are available that interface with I2P, including mail, peer-peer, IRC chat, and others.\n\nThe I2P project was formed in 2003 to support the efforts of those trying to build a more free society by offering them an uncensorable, anonymous, and secure communication system. I2P is a development effort producing a low latency, fully distributed, autonomous, scalable, anonymous, resilient, and secure network. The goal is to operate successfully in hostile environments - even when an organization with substantial financial or political resources attacks it. All aspects of the network are open source and available without cost, as this should both assure the people using it that the software does what it claims, as well as enable others to contribute and improve upon it to defeat aggressive attempts to stifle free speech.\n\n &lt;a href=&quot;\nhttp://www.i2p2.de&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.i2p2.de&lt;/a&gt;","torrent":{"xt":"urn:btih:0d4eae46534f9945496547c740cd6f0f38df2b3c","amp;dn":"I2P+0.9.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d4eae46534f9945496547c740cd6f0f38df2b3c","infoHashBuffer":{"type":"Buffer","data":[13,78,174,70,83,79,153,69,73,101,71,199,64,205,111,15,56,223,43,60]},"announce":[],"urlList":[]}}