{"title":"MyLanViewer","uid":7637799,"size":2743330,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0e43e980f769eed755af7441c206ebf19b475552&amp;dn=MyLanViewer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Vijay.T.A","files":1,"time":1347696669,"description":"MyLanViewer Network/IP Scanner is a powerful Netbios and LAN/Network IP address scanner for Windows, whois and traceroute tool, remote shutdown and Wake On LAN (WOL) manager, wireless network scanner and monitor. This application will help you find all IP addresses, MAC addresses and shared folders of computers on your wired or wireless (Wi-Fi) network. The program scans network and displays your network computers in an easy to read, buddy-list style window that provides the computer name, IP address, MAC address, NIC vendor, OS version, logged users, shared folders and other technical details for each computer. MyLanViewer Network/IP Scanner supports remote shutdown, wake-on-lan, lock workstation, log off, sleep, hibernate, reboot and power off. It is able to monitor IP address and show notifications when the states of some computers change. MyLanViewer Network/IP Scanner can also view and access shared folders, terminate user sessions, disable shared folders, show netstat information and detect rogue DHCP servers. The software can monitor all devices (even hidden) on your subnet, and show notifications when the new devices will be found (for example, to know who is connected to your WiFi router or wireless network). The program easy to install and use, and has a user-friendly and beautiful interface.\n\n\n\n\n\n\n::::Seed &amp; Comment after Downlod :::","torrent":{"xt":"urn:btih:0e43e980f769eed755af7441c206ebf19b475552","amp;dn":"MyLanViewer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e43e980f769eed755af7441c206ebf19b475552","infoHashBuffer":{"type":"Buffer","data":[14,67,233,128,247,105,238,215,85,175,116,65,194,6,235,241,155,71,85,82]},"announce":[],"urlList":[]}}