{"title":"United Welfare State of America.pdf","uid":7746581,"size":12408407,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:0e73e834f96ea6f1ada75f98fd6edb6d985d82a6&amp;dn=United+Welfare+State+of+America.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":-1,"time":1350782812,"description":"A story from CNBC. This really bothers me. It bothers me. It tugs at my heart. It bothers me I can't tell you how much. &quot;Handouts...&quot; This headline alone: &quot;Government Handouts,&quot; welfare, whatever you want to call it, &quot;Make Up One-Third of US Wages.&quot; One-third! Of course we're really not talking &quot;wages,&quot; but I understand the use of the word in this story and in the headline. One-third of us don't earn anything. One-third of us live totally on handouts. One-third of our great country lives on handouts -- and even this story, at the end, says it really isn't that bad. It could be worse. It could be like Europe. \n\n&quot;Government payouts -- including Social Security, Medicare and unemployment insurance -- make up more than a third of total wages and salaries of the U.S. population, a record figure that will only increase if action isn't taken before the majority of Baby Boomers enter retirement.&quot; Now, we had that chart, we put it up on the website last week, and we showed the three biggest entitlements in this country. We all know Social Security and Medicare and Medicaid, but unemployment compensation? The payment of unemployment benefits is almost as high as Social Security in this country. Folks, we are not going to survive as a nation, not the way we've been founded, with this kind of sloth and laziness and feeding at the public trough. ","torrent":{"xt":"urn:btih:0e73e834f96ea6f1ada75f98fd6edb6d985d82a6","amp;dn":"United+Welfare+State+of+America.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e73e834f96ea6f1ada75f98fd6edb6d985d82a6","infoHashBuffer":{"type":"Buffer","data":[14,115,232,52,249,110,166,241,173,167,95,152,253,110,219,109,152,93,130,166]},"announce":[],"urlList":[]}}