{"title":"POtHS - Victory Over Sin and Evil Vol 9","uid":7711780,"size":4601570986,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0e812a1f883c1b4ce2225ef75d47682e9af4afa5&amp;dn=POtHS+-+Victory+Over+Sin+and+Evil+Vol+9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":-1,"time":1349824318,"description":"POtHS - Creation 50\n\nSUPPRESSED - New Evidence of Early Man\n\n\nFrom the EMMY AWARD WINNING Producers of &quot;The Mystery of the Sphinx&quot; and the Producers of &quot;The Mysterious Origins of Man&quot; comes a new ground breaking film about &quot;New Evidence of Early Man: SUPPRESSED.&quot; What happens when scientific evidence conflicts with theory? In the early sixties, discoveries were made in Central Mexico, which were the handiwork of early man. Exquisitely carved animal bones and advanced spear points caused much excitement, including a Life Magazine article, until the dates came in. 5 mutually exclusive geological tests revealed they were over 250,000 years old. In spite of the geochronology, archaeologists insisted the dates were too ridiculously old. This world-class archaeological region became off-limits for official research, a &quot;professional forbidden zone.&quot;\n\nThis is the story of the shocking events that occurred, told first-hand by many of the actual participants. It reveals how one field of science can conflict with another and how new discoveries must battle evidence vs. belief, exposing what some have called &quot;the dark side of archaeology.&quot;\n------------------------------------------------------------\n\nChristianity Today Denies Adam - Dr Purdom Responds on Real Science Friday: &lt;a href=&quot;\nhttp://RealScienceFriday.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://RealScienceFriday.com&lt;/a&gt; Ç€ 20120629 Answers in Genesis Molecular Geneticist \n \nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n\n           \n     \n:thankyou:    :thankyou:     Thank You JESUS  \n\n\n \n","torrent":{"xt":"urn:btih:0e812a1f883c1b4ce2225ef75d47682e9af4afa5","amp;dn":"POtHS+-+Victory+Over+Sin+and+Evil+Vol+9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e812a1f883c1b4ce2225ef75d47682e9af4afa5","infoHashBuffer":{"type":"Buffer","data":[14,129,42,31,136,60,27,76,226,34,94,247,93,71,104,46,154,244,175,165]},"announce":[],"urlList":[]}}