{"title":"BuenAgente 2x08 DVB Spanish by tony","uid":6817994,"size":495979876,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0f797c7124f960fb12887fb7518de722ec84e8ac&amp;dn=BuenAgente+2x08+DVB+Spanish+by+tony&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"carambolas","files":3,"time":1321293613,"description":"Si quieres mas series, peliculas, juegos, etc... tanto por descarga directa como por torrent. visitanos:\n\n\nBuen Agente es una serie de televisiÃƒÂ³n producida por Globomedia para la cadena nacional privada laSexta. Se trata de una comedia de situaciÃƒÂ³n .\n\nSebas (Antonio Molero), un policÃƒÂ­a local, felizmente casado con Lola (Malena Alterio) y con dos hijos, ve cÃƒÂ³mo su vida se desmorona el dÃƒÂ­a del vigÃƒÂ©simo aniversario de su boda, cuando su mujer le confiesa que quiere separarse. Pero Sebas no es hombre que se rinda, asÃƒÂ­ que, dispuesto a recuperar a su familia, se instala en la puerta de enfrente de su ex mujer compartiendo piso con Olivia (Carmen Ruiz) y Ana (Patricia Montero), dos chicas treintaÃƒÂ±eras, solteras y mileuristas.\n\nEn estas circunstancias, Sebas buscarÃƒÂ¡ el apoyo de Agus (Arturo Valls), un psicÃƒÂ³logo que es su mejor amigo. Instalado en la puerta de enfrente de su antiguo hogar, Sebas seguirÃƒÂ¡ teniendo como vecinos a Teo (RaÃƒÂºl FernÃƒÂ¡ndez), su cuÃƒÂ±ado, y a Casilda (Itziar Lazkano), su suegra. Teo, el hermano de Lola, es un caradura simpÃƒÂ¡tico y aficionado a la marihuana que vive mantenido por su madre.\n\nEn la cuarta puerta del descansillo viven Pascual (Juan Antonio Lumbreras), un fanfarrÃƒÂ³n polÃƒÂ­ticamente incorrecto y dueÃƒÂ±o del bar donde se reÃƒÂºnen todos, y Charo (MarÃƒÂ­a Isasi), su mujer y amiga cotilla de Lola. Ambos son los padrinos de los dos hijos adolescentes de Sebas: Nata (Andrea Ros) y Alex (Nacho Montes).","torrent":{"xt":"urn:btih:0f797c7124f960fb12887fb7518de722ec84e8ac","amp;dn":"BuenAgente+2x08+DVB+Spanish+by+tony","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f797c7124f960fb12887fb7518de722ec84e8ac","infoHashBuffer":{"type":"Buffer","data":[15,121,124,113,36,249,96,251,18,136,127,183,81,141,231,34,236,132,232,172]},"announce":[],"urlList":[]}}