{"title":"Halo 1 (Campaign only!!) &amp; 2 (Windows Crack)","uid":7653589,"size":4799937168,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1058c3678a96dc556a01a42e8ee7da5487303958&amp;dn=Halo+1+%28Campaign+only%21%21%29+%26amp%3B+2+%28Windows+Crack%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"n17n3uq","files":12,"time":1348093749,"description":"Halo is a multi-billion dollar science fiction video game franchise created by Bungie and now managed by 343 Industries and owned by Microsoft Studios. The series centers on an interstellar war between humanity and a theocratic alliance of aliens known as the Covenant. The Covenant are led by their religious leaders, The Prophets, and worship an ancient civilization known as the Forerunners, who perished in combat with the parasitic Flood. Many of the games center on the experiences of Master Chief John-117, a cybernetically enhanced human super-soldier, and his artificial intelligence (AI) companion, Cortana. The term &quot;Halo&quot; refers to the Halo rings: large, habitable structures that were created by the Forerunners to destroy the Flood. They are similar to the Orbitals in Iain M Banks' Culture novels, and author Larry Niven's Ringworld concept.[1][2]\n\nThe games in the series have been praised as being among the best first-person shooters on a video game console, and are considered the Xbox's &quot;killer app&quot;.[3] This has led to the term &quot;Halo killer&quot; being used to describe console games that aspire, or are considered, to be better than Halo.[4] Fueled by the success of Halo: Combat Evolved, and immense marketing campaigns from publisher Microsoft, its sequels went on to break various sales records. Halo 3 sold more than US$170 million worth of copies in the first twenty-four hours of release, breaking the record set by Halo 2 three years prior.[5][6] Halo: Reach, in turn, broke the record set by Halo 3, selling US$200 million worth of copies on its first day of release.[7] The games have sold over 43 million copies worldwide, and all Halo merchandise has grossed over $3 billion.[8]\n\n","torrent":{"xt":"urn:btih:1058c3678a96dc556a01a42e8ee7da5487303958","amp;dn":"Halo+1+%28Campaign+only%21%21%29+%26amp%3B+2+%28Windows+Crack%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1058c3678a96dc556a01a42e8ee7da5487303958","infoHashBuffer":{"type":"Buffer","data":[16,88,195,103,138,150,220,85,106,1,164,46,142,231,218,84,135,48,57,88]},"announce":[],"urlList":[]}}