{"title":"Spacewalker by Jerry L. Ross - spanikopita","uid":7788333,"size":9726199,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:105f604cadee82a467db35a43436113e001b5114&amp;dn=Spacewalker+by+Jerry+L.+Ross+-+spanikopita&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"spanikopita","files":2,"time":1351955220,"description":"Jerry L. Ross\n300 pages\nPublisher: Purdue University Press (January 31, 2013)\nLanguage: English\nISBN-10: 1557536317\nISBN-13: 978-1557536310\n\nFrom the age of ten, looking up at the stars, Jerry Ross knew that he wanted to journey into space. This autobiography tells the story of how he came not only to achieve that goal, but to become the most-launched astronaut in history, as well as a NASA veteran whose career spanned the entire US Space Shuttle program. From his childhood in rural Indiana, through education at Purdue University, and a career in the US Air Force, Ross charted a path to NASA after overcoming many setbacks - from failing to qualify for Air Force pilot training because of &quot;bad&quot; eyesight, to an initial failure to be selected into the astronaut program. The majority of the book is an insider's account of the US Space Shuttle program, including the unforgettable experience of launch, the delights of weightless living, and the challenges of constructing the International Space Station. Ross is a uniquely qualified narrator.\nDuring seven spaceflights, he spent 1,393 hours in space, including 58 hours and 18 minutes on nine space walks. Life on the ground is also described, including the devastating experiences of the Challenger and Columbia disasters.\n\nFor readers who have followed the space program from Mercury through the International Space Station and wonder what comes next, this book provides fascination; for young people interested in space exploration and reaching for their dreams, whatever they might be, this book provides inspiration. Full of stories of spaceflight that few humans have ever experienced, told with humor and honesty, Spacewalker presents a unique perspective on the hard work, determination, and faith necessary to travel beyond this world.\n\nKey Points:\n\n- An insider's account of the US Space Shuttle program, from before its first launch through the final landing, and the building of the International Space Station.\n\n- A firsthand account of life in space from the first human to fly seven missions.\n\n- An inspirational story of a personal journey from rural Indiana to outer space, powered by a deep Christian faith.\n\n---\n\nMOBI, PDF","torrent":{"xt":"urn:btih:105f604cadee82a467db35a43436113e001b5114","amp;dn":"Spacewalker+by+Jerry+L.+Ross+-+spanikopita","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"105f604cadee82a467db35a43436113e001b5114","infoHashBuffer":{"type":"Buffer","data":[16,95,96,76,173,238,130,164,103,219,53,164,52,54,17,62,0,27,81,20]},"announce":[],"urlList":[]}}