{"title":"Society SM-------SSM - Sep 28, 2012 - Sheena Ryder","uid":7692967,"size":1013518898,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:107bdfc44f0abe65b1e9c480b2f36e5a9c44d474&amp;dn=Society+SM%5C-------SSM+-+Sep+28%2C+2012+-+Sheena+Ryder&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1349285285,"description":"Society SM\n \nSSM - Sep 28, 2012 - Sheena Ryder\n \nMp4 + Pics\n \nOgre's new plaything this week is Sheena Ryder and he wastes absolutely no time &quot;showing her the ropes&quot;. He drags her in hooded and bound before he collars her from the ceiling and begins to grope her. Her protests are futile, although appreciated and Ogre goes about exploring his new pet with extreme accuracy. She wails when her nipples are clamped and weighted and the flogger strikes her chest. And she wonders just what type of predicament she has found herself in. Fortunately for us, and possibly unfortunately for Sheena, the wait time is short as she is cuffed with hands overhead, spreader bar in place and a dong shoved deep inside her. The caning that follows surely stings and things are only just heating up...TENS pads on the thighs have Sheena tossing her head back in anguish as the juice flows through her body. And Ogre keeps the intensity pumping as he presses the wand against her clit propelling Sheena into an orgasmic gyration. From there, she's bent ass up, roped tightly to the bench. A little more electrical play is on tap...this time with her anus. Then after being hooked, she gets to know the floggers even better as they warm her hide...All summed up nicely when Ogre beats her red rhythmically with the canes...Finally, Sheena finds herself spread wide, begging for abatement as Ogre lubes her cunt. Slowing down is the last thing on his mind however as he viciously pummels her pussy one last time\n \n\n8000 uploads and counting, if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :) \n\nCheers :-) ","torrent":{"xt":"urn:btih:107bdfc44f0abe65b1e9c480b2f36e5a9c44d474","amp;dn":"Society+SM%5C-------SSM+-+Sep+28%2C+2012+-+Sheena+Ryder","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"107bdfc44f0abe65b1e9c480b2f36e5a9c44d474","infoHashBuffer":{"type":"Buffer","data":[16,123,223,196,79,10,190,101,177,233,196,128,178,243,110,90,156,68,212,116]},"announce":[],"urlList":[]}}