{"title":"POtHS - SIN-ister Secrets - 87 - PsyWars Vol 6 - Secret History ","uid":7632856,"size":4016887487,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:114a12818b6917de3c0fa60d0138039bfc869671&amp;dn=POtHS+-+SIN-ister+Secrets+-+87+-+PsyWars+Vol+6+-+Secret+History+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"POtHS11","files":-1,"time":1347576722,"description":"POtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - SIN-ister Secrets - 87 - PsyWars Vol 6 - Secret History of Mind Control\n\n\nPOtHS Comment: They are programming USa to be mindless idiots. Just look around at the Grocery Store.\n\n\nDescription:\n\nThe Brain : A Secret History - Mind Control, Series 1 Ç€ Episode 1:\nMichael Mosley tries to further his understanding of the human mind by tracing the history of mankind's efforts to examine and manipulate the brain. He learns about the high-risk psychological experiments that would not be approved by a modern ethics committee, and explores the world of neuroscience, acting as a guinea pig to see what he can learn about himself and the freedom behind the decisions people make\n\n\nWilliam Cooper - Mind Control &lt;a href=&quot;\nhttp://www.hourofthetime.com/wordpresstest/?page_id=7576&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hourofthetime.com/wordpresstest/?page_id=7576&lt;/a&gt;\n\n\nDigital TV  HAARP  GWEN  Silent Sound and Mind Control Technologies:\nDr. Scott Johnson discusses detailed information pertaining to various psyops being performed on the world's populace.  By providing an in-depth analysis and commentary on the devices and their applications performed on society, he illustrates very disturbing evidence, test results and implementations of such devices done around the world within society to help everyone better understand their current environment and prepare for more of what's to come in the future.  \n\nClick link for Full PDF to this study\n\nThe age of deception is here and thanks to digital technology is now even easier to fool people in mass numbers. A photograph, a video, and a any sound can be digitally manipulated to show something that is not really there. This leads us to the topic of why( in part) the US will be switching all broadcasts from analog to digital.\n\nThis teaching overviews a secret Pentagon psychotronics technology known as Silent Sound Spread Spectrum (SSSS) that has been fully operational since the early 1990s. The physical, emotional, and psychological effects of this technology were so severe that 200,000 Iraqi troops surrended en masse without firing even a single shot against US led coalition forces.wrenching experience.\n\n\nWilliam Cooper - Mind Control:\n\n\n\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nThese Torrents are currently on a Free Leech --  High Speed Server\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n","torrent":{"xt":"urn:btih:114a12818b6917de3c0fa60d0138039bfc869671","amp;dn":"POtHS+-+SIN-ister+Secrets+-+87+-+PsyWars+Vol+6+-+Secret+History+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"114a12818b6917de3c0fa60d0138039bfc869671","infoHashBuffer":{"type":"Buffer","data":[17,74,18,129,139,105,23,222,60,15,166,13,1,56,3,155,252,134,150,113]},"announce":[],"urlList":[]}}