{"title":"POtHS - Creation - 45 - Evolution Contagion - The Foundation For","uid":7635839,"size":4499327211,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:14ffc53ed4c1ed86eaa1c59d2e31ca9cbce0aea5&amp;dn=POtHS+-+Creation+-+45+-+Evolution+Contagion+-+The+Foundation+For&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"POtHS11","files":-1,"time":1347641400,"description":"\n\n\nPOtHS - Creation 45 - Evolution Contagion - The Foundation For Communism\n\n\n\n\nDescription\n\n\nEvolution, The Foundation For Communism presented by Dr Hovind at The Prophecy Club:\nKent Hovind discusses the link between evolutionary theorem and communist theorem. The two carry a symbiotic relationship, yet evolution is taught as exclusive fact in the US and much of the world today.  Hovind explains why the claims hold no ground but are promoted from tyrannical Nazi's seeking to divide and conquer.\n\n\nFrom Darwin to Hitler by Dr Richard Weikart:\nDiscovery Institute is pleased to announce the publication of the provocative intellectual history, &quot;From Darwin to Hitler, Evolutionary Ethics, Eugenics and Racism in Germany&quot; (Palgrave MacMillan), by Richard Weikart.  Does Darwinism devalue human life? Did Hitler get some of his ideology from Darwin? You decide!\n\n\nAmericas Christian Heritage by Dr G Thomas:\nWhat's a thinking Christian to do ... about today's &quot;Oppositions of science, falsely so called&quot; (1Tim 6:20)? Christians should always stick to the word, as their source of ultimate authority for questions about the origins or anything else. Still, many are swayed by the authoritative-sounding preaching of today's evo-evangelists .. and so compromise on the word of God, thinking they can make peace between these two warring ideas. \n\nFabricated History by Charles Lawson:\nCharles Lawson 07/29/12 (SS) Genesis 5:1-2 Archeological Finds Which Confirm the Bible Are Ignored by Today's History Books -- To What End?\n\n\nHumanism - A Fools Religion;\nAlan Batten said in a 1984 paper in the Journal of the Royal Astronomical Society of Canada, &quot;My impression is that many of the biologists who write about evolution for the ordinary public are committed in their minds to the belief that the question 'Why?' has no answer.... [They believe] evolution is purposeless, and life and Man have arisen only by chance. ... this is a legitimate belief for a person to hold, but that it is required by the scientific evidence is highly questionable. To hold it as such is as much an act of faith as to maintain the opposite.&quot;\n\nBatten encourages evolutionists to stop arguing scientific evidence with creationists, saying, &quot;I believe we shall achieve much more by frankly admitting the limitations of scientific research and concede that even creationists are raising legitimate questions.&quot;\nAlan H. Batten &lt;a href=&quot;\nhttp://www.iau.org/administration/membership/individual/1618/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.iau.org/administration/membership/individual/1618/&lt;/a&gt;\n\n\nDeception in High Gear - Preparation for Alien UFO:\nThis 4 part presentation includes the following topics as discussed by Dr. Scott Johnson.\n\n- Vatican Preparing 1.1 Billion Followers For Alien Deception\n- Director Of The Institute Of Applied Astronomy Is Convinced Extraterrestrial: Life Exists . . . . And Will Be In Contact Soon\n- UFOlogy: the world's fastest-growing 'scientific' religion?\n- Farrakhan's Nation of Islam's link to UFOs\n\n \n     \n:thankyou:    :thankyou:     Thank You JESUS  \n\n\n \n","torrent":{"xt":"urn:btih:14ffc53ed4c1ed86eaa1c59d2e31ca9cbce0aea5","amp;dn":"POtHS+-+Creation+-+45+-+Evolution+Contagion+-+The+Foundation+For","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14ffc53ed4c1ed86eaa1c59d2e31ca9cbce0aea5","infoHashBuffer":{"type":"Buffer","data":[20,255,197,62,212,193,237,134,234,161,197,157,46,49,202,156,188,224,174,165]},"announce":[],"urlList":[]}}