{"title":"Oingo Boingo - Just Another Day [promo].VOB","uid":7783694,"size":254640132,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:16e25071c3dd9f758e56badba68e2a4cd57d907a&amp;dn=Oingo+Boingo+-+Just+Another+Day+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"SgtRlee","files":-1,"time":1351838944,"description":"Oingo Boingo - Just Another Day [promo].VOB\n\n\nHQ very rare promo music video from a promo DVD. &quot;Just Another Day&quot; is a song from Dead Man's Party, the fourth album by Oingo Boingo, released in 1985. It showcases a different musical style than the band's previous releases, becoming more pop-orientated and with higher levels of production. \n\nThe title track was used in the film Back to School, wherein the band performs the song live at a party. It was also used in the Chuck television series in &quot;Chuck Versus the Couch Lock&quot;. The album also includes the song Weird Science which was written especially for the John Hughes film of the same name and later the television series on the USA network. Another track, No One Lives Forever, was used in the 1986 Cannon Group production of The Texas Chainsaw Massacre 2 and Casper: A Spirited Beginning, a direct-to-video release from 20th Century Fox and Saban Entertainment in 1997. It is also used as the theme for the October 29, 2010 episode of Rachael Ray. \n\nThe song Stay was used as the theme song for the Brazilian telenovel Top Model, which increased the popularity of the band in the country. \n\nThe album cover art is a homage to the Mexican festival Day of the Dead. \n\nOingo Boingo was an American new wave band. They are best known for their influence on other musicians, their soundtrack contributions and their high energy Halloween concerts. The band was founded in 1972 as a performance art group called The Mystic Knights of the Oingo Boingo, and from 1976 it was led by songwriter/vocalist Danny Elfman, who has since achieved substantial renown as a composer for film and television. \n\nThe group's format changed twice. In 1979, it changed from a semi-theatrical music and comedy troupe into a ska-influenced New Wave octet and shortened their name to Oingo Boingo. In 1994, the band reshuffled its lineup, adopted an alternative rock sound and rechristened themselves Boingo. The band retired after a farewell concert on Halloween 1995, having reverted to the name Oingo Boingo for the concert. \n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Dead_Man%27s_Party_(album)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Dead_Man%27s_Party_(album)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/DAfFhaaEh&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/DAfFhaaEh&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 8000kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 224kbps\n   Duration: 00:04:04\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.6.4\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:16e25071c3dd9f758e56badba68e2a4cd57d907a","amp;dn":"Oingo+Boingo+-+Just+Another+Day+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16e25071c3dd9f758e56badba68e2a4cd57d907a","infoHashBuffer":{"type":"Buffer","data":[22,226,80,113,195,221,159,117,142,86,186,219,166,142,42,76,213,125,144,122]},"announce":[],"urlList":[]}}