{"title":"A Clockwork Orange(1971)DVDRip.AC3(ENG)-DROCK","uid":7617602,"size":726098248,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1b1a7b6d998eedb095113e916aa352ec732b9a12&amp;dn=A+Clockwork+Orange%281971%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1347244535,"description":"Stanley Kubrick dissects the nature of violence in this darkly ironic, near-future satire, adapted from Anthony Burgess's novel, complete with &quot;Nadsat&quot; slang. Classical music-loving proto-punk Alex (Malcolm McDowell) and his &quot;Droogs&quot; spend their nights getting high at the Korova Milkbar before embarking on &quot;a little of the old ultraviolence,&quot; such as terrorizing a writer, Mr. Alexander (Patrick Magee), and gang raping his wife (who later dies as a result). After Alex is jailed for bludgeoning the Cat Lady (Miriam Karlin) to death with one of her phallic sculptures, Alex submits to the Ludovico behavior modification technique to earn his freedom; he's conditioned to abhor violence through watching gory movies, and even his adored Beethoven is turned against him. Returned to the world defenseless, Alex becomes the victim of his prior victims, with Mr. Alexander using Beethoven's Ninth to inflict the greatest pain of all. When society sees what the state has done to Alex, however, the politically expedient move is made. Casting a coldly pessimistic view on the then-future of the late '70s-early '80s, Kubrick and production designer John Barry created a world of high-tech cultural decay, mixing old details like bowler hats with bizarrely alienating &quot;new&quot; environments like the Milkbar. Alex's violence is horrific, yet it is an aesthetically calculated fact of his existence; his charisma makes the icily clinical Ludovico treatment seem more negatively abusive than positively therapeutic. Alex may be a sadist, but the state's autocratic control is another violent act, rather than a solution. Released in late 1971 (within weeks of Sam Peckinpah's brutally violent Straw Dogs), the film sparked considerable controversy in the U.S. with its X-rated violence; after copycat crimes in England, Kubrick withdrew the film from British distribution until after his death. Opinion was divided on the meaning of Kubrick's detached view of this shocking future, but, whether the discord drew the curious or Kubrick's scathing diagnosis spoke to the chaotic cultural moment, A Clockwork Orange became a hit. On the heels of New York Film Critics Circle awards as Best Film, Best Director, and Best Screenplay, Kubrick received Oscar nominations in all three categories.\n\nRipped with Autogk\n\nLength: 2 Hours 16 Minutes\n\nFile Type: AVI\n\nFrame Width: 608\n\nFrame Height: 368\n\nFrame Rate: 25fps\n\nAudio\n\nBit Rate: 111kbps","torrent":{"xt":"urn:btih:1b1a7b6d998eedb095113e916aa352ec732b9a12","amp;dn":"A+Clockwork+Orange%281971%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b1a7b6d998eedb095113e916aa352ec732b9a12","infoHashBuffer":{"type":"Buffer","data":[27,26,123,109,153,142,237,176,149,17,62,145,106,163,82,236,115,43,154,18]},"announce":[],"urlList":[]}}