{"title":"Laura Ingraham Show Podcast, September 24th-25th, 2012","uid":7673156,"size":75512074,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:1b4c003d645ba25e03798cdb1b8898cc7693c082&amp;dn=Laura+Ingraham+Show+Podcast%2C+September+24th-25th%2C+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"freedomczar","files":2,"time":1348628789,"description":"These are sad times, friends. While it has been a long time coming, it is official now, we are a different country from what the founders intended, and everything that makes this country exceptional is no longer there. The supreme court ruling showed yet again that 100% of the Democrats on the court were united in their decision. The problem was with the Republicans. Only 80% of the Republican justices were united. The other 20% (John Roberts) sided with the democrats. It always seems that there is always this one Republican Justice, Senator, or Congressman who is willing to &quot;cross the isle,&quot; and thus enabling democrats to pass their liberal agenda. However, you never ever see the democrats coming to our side. Make no mistake about this: Moderate Republicans are there to give liberals everything they want, but at a moderate rate. While democrats want full blown liberalism now, moderate republicans are providing that for them, but at a slower pace.\n\nI do not know how the country can come back from this, but we have no choice but to keep trying and be involved in the Republican primaries. We absolutely must defeat these liberal Republicans. How many times have we been told that president Bush is a conservative, and conservatives fell for it. Look at what the guy was doing in terms of spending, legislation, and environmental regulations. He was just as liberal as liberals can get. And now, this, his appointed Chief Justice sides with the liberals on the most crucial issue of our lives. This was the final blow to our Republic. The liberals had won on every front except socialized medicine, and now they have that, too. At this point we are dependents of the state and no longer citizens in a free society.\n\n\n\nBack by no popular demand.Laura Ingraham show from September 24th and 25th.\n\nDownload, seed, and spread the word. Never let a good podcast go to waste.\n\n\n\nListen to more free Podcasts at these sites:\n\nMark Levin: http://www dot marklevinshow dot com/sectional.asp?id=32930\n\nMichael Savage: http://conservativereview.us/\t\n\nGlenn Beck podcast: http://thepiratebay.se/user/hayesy316 \nGlenn Beck has been streaming his show for free on his website, as well. But the stream is not commercial free.\t\n\nDennis Prager: http://thepiratebay.se/user/CAPTAIN7SS/\n\n\n\n!!!!REMEMBER TO VOTE CONSERVATIVE IN THE PRIMARIES AND REPUBLICAN IN THE GENERAL ELECTION!!!!\t\t","torrent":{"xt":"urn:btih:1b4c003d645ba25e03798cdb1b8898cc7693c082","amp;dn":"Laura+Ingraham+Show+Podcast%2C+September+24th-25th%2C+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b4c003d645ba25e03798cdb1b8898cc7693c082","infoHashBuffer":{"type":"Buffer","data":[27,76,0,61,100,91,162,94,3,121,140,219,27,136,152,204,118,147,192,130]},"announce":[],"urlList":[]}}