{"title":"POtHS - SIN-ister Secrets - 90 - Obama, Dreams From My Real Fath","uid":7646100,"size":3509554955,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1d46d49a0c5421afbbd596ff5213fbd7ee02d4d4&amp;dn=POtHS+-+SIN-ister+Secrets+-+90+-+Obama%2C+Dreams+From+My+Real+Fath&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":-1,"time":1347907998,"description":"\nPOtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - SIN-ister Secrets - 90 - 90 - Obama, Dreams From My Real Father - 2012\n\n\nPOtHS Comment:\n\n\nDescription:\n\nDreams From My Real Father 2012 - Obama  Frank Marshall Davis  Communism:\nAt age 18, Barack Obama admittedly arrived at Occidental College a committed revolutionary Marxist. What was the source of Obama's foundation in Marxism? Throughout his 2008 Presidential campaign and term in office, questions have been raised regarding Barack Obama's family background, economic philosophy, and fundamental political ideology. Dreams from My Real Father is the alternative Barack Obama &quot;autobiography,&quot; offering a divergent theory of what may have shaped our 44th President's life and politics.\n\nIn Dreams from My Real Father, Barack Obama is portrayed by a voiceover actor who chronicles Barack Obama's life journey in socialism, from birth through his election to the Presidency. The film begins by presenting the case that Barack Obama's real father was Frank Marshall Davis, a Communist Party USA propagandist who likely shaped Obama's world view during his formative years. Barack Obama sold himself to America as the multi-cultural ideal, a man who stood above politics. Was the goat herding Kenyan father only a fairy tale to obscure a Marxist agenda, irreconcilable with American values?\n\n\n\nI, Pet Goat II Symbology For Enlightenment:\nThis folder contains a story about the fire at the heart of suffering made by Heliofant. Bringing together dancers, musicians, visual artists and 3d animators, the film takes a critical look at the events of the past decade that have shaped our world. Completely semerged in satanic rituals featuring many present events and presidents plastered in symbology.\n\n\n\n\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nThese Torrents are currently on a Free Leech --  High Speed Server\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\nRAPtURE (My transportation outta here).\n\nThe Blessed Hope.  If you believe in The Rapture you better believe The Above Statement and that the Sacrificed Blood of Jesus, on the Cross paid for your sins and there is NOTHING Else you can do to gain Salvation, The GRACE of Christ did it ALL. Now you just have to believe that with all your Heart, Mind and Soul or Maybe Get Left Behind. All PAST, Present and Future Sins are Forgiven with Jesus. (I wouldn't PUSH That Future sin statement to much!!!)\n\nIn a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed...\n\n\n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n","torrent":{"xt":"urn:btih:1d46d49a0c5421afbbd596ff5213fbd7ee02d4d4","amp;dn":"POtHS+-+SIN-ister+Secrets+-+90+-+Obama%2C+Dreams+From+My+Real+Fath","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d46d49a0c5421afbbd596ff5213fbd7ee02d4d4","infoHashBuffer":{"type":"Buffer","data":[29,70,212,154,12,84,33,175,187,213,150,255,82,19,251,215,238,2,212,212]},"announce":[],"urlList":[]}}