{"title":"Puncture(2011)BluRip.ACC(ENG)-DROCK","uid":7654199,"size":736165259,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1d95eb243924acf151f35614e1d54f00daa7f653&amp;dn=Puncture%282011%29BluRip.ACC%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"drock232","files":-1,"time":1348110032,"description":"I did some research on ripping blu-rays and all that. I ripped it to my hdd with Slysoft then encoded with Vidcodr. Let me know if you guy's like the quality. I am going to start ripping blu-ray movies instead of dvds. (Now on to the description.) Also I need your help to seed my torrent's I only have a 5.0mb connection until October 2012. Then I will be upgrading to a 105/20mbs connection speed, where I will be seeding 24/7. So all I'm asking is for you people to help out and not just take. (Oh and I did not touch any of the aspect ratio settings or anything like that. You may need a codec pack to play MP4's. More then likely you won't, but just saying before some incompetent moron says it doesn't play.)\n\nAn attorney fighting a corrupt system is battling his own demons as he tries to do right by others in this drama based on a true story. Vicky (Vinessa Shaw) is a nurse at a hospital in Houston whose life takes an unexpected turn when she accidentally jabs herself with a used syringe. The needle had been used on a patient who was HIV-positive, and Vicky contracts AIDS. Jeffrey Danfort (Marshall Bell) is a close friend of Vicky's who designs medical equipment, and he's inspired to invent a syringe with a safety point that would prevent such mistakes. However, as Jeffrey tries to sell his new invention to pharmaceutical manufacturers, he discovers how much they're governed by corruption and insider dealings. Jeffrey decides to take on the dishonest firms with a lawsuit, and he secures the services of Weiss &amp; Danziger, a small law office eager for any kind of business. But while Paul Danziger (Mark Kassen) needs the work to support his wife and children, Mike Weiss (Chris Evans) is more concerned with supporting his cocaine habit, which is spiraling out of control. Even though Mike sees the case as a chance to prove himself, his hunger for drugs is a constant obstacle. Puncture received its world premiere at the 2011 Tribeca Film Festival. \n\nRipped with Anydvd &amp; Vidcoder\n\nLength: 1 Hour 40 Minutes\n\nFile Type: MP4\n\nFrame Width: 1920\n\nFrame Height: 800\n\nFrame Rate: 29fps\n\nAudio\n\nBit Rate: 159kbps\n","torrent":{"xt":"urn:btih:1d95eb243924acf151f35614e1d54f00daa7f653","amp;dn":"Puncture%282011%29BluRip.ACC%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d95eb243924acf151f35614e1d54f00daa7f653","infoHashBuffer":{"type":"Buffer","data":[29,149,235,36,57,36,172,241,81,243,86,20,225,213,79,0,218,167,246,83]},"announce":[],"urlList":[]}}