{"title":"The Ed Show 9-14-12.mp4","uid":7637834,"size":182184908,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1dbf6e68404fb4a69a94465795b03d768fd47059&amp;dn=The+Ed+Show+9-14-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1347698123,"description":"The Ed Show; September 14, 2012. Guest host Ezra Klein.\n\nThe four victims of the assault on the U.S. consulate in Benghazi, Libya, are home and were, honored by President Obama and his national security team at Andrews Air Force Base.\n\nEzra showed you extended highlights from today's moving ceremony.\n\nMeantime, a Romney advisor says that kind of tragedy won't happen under a President Romney because his administration will have &quot;resolve.&quot; \nWhat does &quot;resolve&quot; mean?  Guest host Ezra Klein asked Rajiv Chandrasekaran (Associate Editor at the Washington Post.)\n\nThen, the Tax Policy Center said Romney's tax plan is &quot;not mathematically possible.&quot;  Bruce Bartlett (former  Deputy Assistant Secretary for Economic policy under George H.W. Bush, on why the Romney numbers just don't add up.)\n\nYou may not know what the sequester is, but it's threatening to cut the budgets of programs ranging from the FBI to the EPA.  Bob Greenstein *the Center for Budget and Policy Priorities), joined Ezra to explain.\n\nMitt Romney might be a successful businessman, but his latest ad blitz is making us wonder if he needs a basic economics lesson.\n\nA judge struck down Wisconsin Governor Scott Walker's law that effectively ended collective bargaining rights for most public workers as unconstitutional.","torrent":{"xt":"urn:btih:1dbf6e68404fb4a69a94465795b03d768fd47059","amp;dn":"The+Ed+Show+9-14-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1dbf6e68404fb4a69a94465795b03d768fd47059","infoHashBuffer":{"type":"Buffer","data":[29,191,110,104,64,79,180,166,154,148,70,87,149,176,61,118,143,212,112,89]},"announce":[],"urlList":[]}}