{"title":"Handrite Note Pro v1.76 Final By bobiras2009","uid":7646712,"size":958524,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:1f53be3d816aecd7ac0a35559e799615bf3a1e21&amp;dn=Handrite+Note+Pro+v1.76+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1347925440,"description":"Follow my uploads here:                             &lt;a href=&quot;\nhttps://forum.suprbay.org/member.php?action=profile&amp;uid=311481&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/member.php?action=profile&amp;uid=311481&lt;/a&gt;    \n\nYou can make requests here:                              &lt;a href=&quot;\nhttps://forum.suprbay.org/forumdisplay.php?fid=4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/forumdisplay.php?fid=4&lt;/a&gt;\n                 \n\n                                By bobiras2009\t\t\n\n\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\nt's the write idea. Handrite alows you to write with your finger right on your screen. Each time you lift your finger, the character or symbol you wrote appears in the notebook interface. It replicates exactly what you add to the screen. Give up the apper habit and keep, send, or post your notes.\n\nYou're in an important meeting or lecture when suddenly you realize--you forgot your pen or notebook! Or you're at a party and need to take down a phone number or an e-mail address. Don't trust your memory or try to scribble on a dry-cleaning receipt; Handrite is the solution you need.\n\nThe Write Move\nRather than trying to frantically type notes on your device keyboard, Handrite Note allows you to write with your finger right on your Android's screen. Each time you lift your finger, the character or symbol you wrote appears in the notebook interface. When you finish a word, just hit the space bar icon at the bottom of the screen. Hit Return if you want to move down to the next line. If you make a mistake, there's a simple backspace button to delete as many characters as you need to. You can also cut and paste with ease.\nHandrite Note doesn't try to &quot;read&quot; your handwriting. Rather, it replicates exactly what you trace on the screen, as with a drawing program. This avoids the pain of having to &quot;train&quot; the app to read your writing, and the inevitable mistakes that occur. It also means you can sketch symbols, numbers, pictures, mathematical equations--whatever you write is instantly recorded digitally for later reference. And notes are saved automatically.\n\nRight at Hand\nYou know how it goes: you write something down on a slip of paper or pad, then misplace it or don't have it when you need it. Now you can have your notes with you at all times, whether you're on the beach or in the boardroom. The app's time stamp and labeling system allows you categorize, sort, and find your notes quickly and easily.\n\nYou can also export your notes with a few taps on the screen. Whether you want to save it to your SD card, send it to yourself or someone else in e-mail, tweet it, post it to Facebook, or another sharing method, a note doesn't have to remain tethered to your Android device. Export in either JPEG or PNG format.\nFunction and Form\nUnlike many notepad applications, Handrite Note allows you to write in style. Create and save different types of &quot;pens,&quot; adjusting line thickness and color to fit your needs. Then swap them in and out when needed. You can also choose from 14 different styles of &quot;paper,&quot; including beautiful solid hues, notebook lines, and even graph paper. The size of your text and spacing are also adjustable, so you can customize them for easy readability. Make the right choice with Handrite Note for Android.\n\n\nWhat's in this version : (Updated : Sep 17, 2012)\n\n    Bug fixes\n\nRequired Android O/S : 1.6+\n\n\n                                By bobiras2009\t\t","torrent":{"xt":"urn:btih:1f53be3d816aecd7ac0a35559e799615bf3a1e21","amp;dn":"Handrite+Note+Pro+v1.76+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f53be3d816aecd7ac0a35559e799615bf3a1e21","infoHashBuffer":{"type":"Buffer","data":[31,83,190,61,129,106,236,215,172,10,53,85,158,121,150,21,191,58,30,33]},"announce":[],"urlList":[]}}