{"title":"Mad.Asses.All.Anal.Edition.DiSC1.XXX.DVDRip.XviD-VBT","uid":7805718,"size":2194515968,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:200935e6ba6f7a9f02d2e1438bb1b6f5913e32cf&amp;dn=Mad.Asses.All.Anal.Edition.DiSC1.XXX.DVDRip.XviD-VBT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":7,"uploader":"R0thschild","files":3,"time":1352390990,"description":"Gallery: \n &lt;a href=&quot;\nhttp://imagedomino.com/?g=291212&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imagedomino.com/?g=291212&lt;/a&gt;\n\nButt-crazed director and all-around stud Mike Adriano returns to the backfield with 'Mad Asses: All Anal Edition,' a two-disc extravaganza of nonstop booty tease and close-up buggery in his inimitable style. Mad Asses: All Anal Edition porn Mike's most notorious pornographic passions are on display: ass-to-mouth cocksucking, deep-throat gagging, powerful butt fucking, gaping sphincters, rectal speculums and more graphic delights, all shot with his distinctive POV+ angles that put you right in the action. Mad Asses: All Anal Edition DVD video This time Mike's got a mad collection of righteous asses to work on. Frisky slut Jada Stevens flaunts her soft, juicy bum while walking on a treadmill and slobbers all over the director's big boner before taking it deep inside her accommodating colon. Bratty blonde Kimmy Olsen uses her mouth and her thick ass to pleasure Mike's tool. He greases up her tushy and rams his pole up her jiggling rump until he sprays her buttocks with jizz. Curvaceous bombshell Melina Mason squeezes out of her skintight dress to reveal her plump knockers and enormous, round buttocks. Melina's elastic bunghole gets banged and she downs a mouthful of hot sperm. Venezuelan beauty Rose Monroe is a short, bomb-ass Latina with an adorable smile. Mike buries his face between Rose's gigantic butt cheeks, then oils up her shiny culo for a ferocious reaming. Lastly, sultry blonde AJ Applegate enjoys an epic backdoor boning. And there's a bonus threesome with huge-assed Kelly Divine and Latina sweetheart Monica Santhiago. &quot;Mad Asses: All Anal Edition&quot; is simply packed with ass that will not quit!","torrent":{"xt":"urn:btih:200935e6ba6f7a9f02d2e1438bb1b6f5913e32cf","amp;dn":"Mad.Asses.All.Anal.Edition.DiSC1.XXX.DVDRip.XviD-VBT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"200935e6ba6f7a9f02d2e1438bb1b6f5913e32cf","infoHashBuffer":{"type":"Buffer","data":[32,9,53,230,186,111,122,159,2,210,225,67,139,177,182,245,145,62,50,207]},"announce":[],"urlList":[]}}