{"title":"Sweet Smell of Success","uid":7783029,"size":13838107117,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:20c149462b33672a5022f3082a79c94a923fc0f5&amp;dn=Sweet+Smell+of+Success&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Waikiki2008","files":-1,"time":1351819710,"description":"J.J. Hunsecker, the most powerful newspaper columnist in New York, is determined to prevent his sister from marrying Steve Dallas, a jazz musician. He therefore covertly employs Sidney Falco, a sleazy and unscrupulous press agent, to break up the affair by any means possible. \n\n       \n\n\n\nDisc Features\n \n   * Exclusive new digital restoration from the original 35 mm camera negative (with uncompressed monaural soundtrack on the Blu-ray edition)\n    * New audio commentary featuring film scholar James Naremore\n    * Mackendrick: The Man Who Walked Away, a 1986 documentary featuring interviews with director Alexander Mackendrick, actor Burt Lancaster, producer James Hill, and others\n    * James Wong Howe: Cinematographer, a 1973 documentary about the Oscar-winning director of photography, featuring lighting tutorials with Howe\n    * New video interview with film critic and historian Neal Gabler (Winchell: Gossip, Power and the Culture of Celebrity) about legendary columnist Walter Winchell, inspiration for the character J. J. Hunsecker\n    * New video interview with filmmaker James Mangold about Mackendrick, his instructor and mentor\n","torrent":{"xt":"urn:btih:20c149462b33672a5022f3082a79c94a923fc0f5","amp;dn":"Sweet+Smell+of+Success","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20c149462b33672a5022f3082a79c94a923fc0f5","infoHashBuffer":{"type":"Buffer","data":[32,193,73,70,43,51,103,42,80,34,243,8,42,121,201,74,146,63,192,245]},"announce":[],"urlList":[]}}