{"title":"The.Le.Wood.Anal.Hazing.Crew.XviD-PORNOLATiON","uid":7647064,"size":1468098560,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:20ca56250322a9c6f014489da68e63130c09a66c&amp;dn=The.Le.Wood.Anal.Hazing.Crew.XviD-PORNOLATiON&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"chkm8te","files":2,"time":1347933849,"description":"The Le Wood Anal Hazing Crew XviD - PORNOLATiON\n\nStarring: Ashlynn Leigh, Leilani Leeane, Francesca Le, Lily Labeau, Chastity Lynn\n\nDescription: Lovely Latina Francesca Le and well-hung porn stud Mark Wood - aka LeWood Productions - are a powerhouse team whose vignette-based movies are brutally hard-core. LeWood specializes in a kind of nasty, rough anal play that's not for amateurs! In &quot;The Le Wood Anal Hazing Crew,&quot; their butt-pounding extravaganza for the Buttman Choice line of ass-flavored niche videos, Mark and Francesca portray a pair of predatory swingers who get off by testing four gorgeous girls in the ways of rectal submission . First, adorable, soft Ashlynn Leigh is a new cheerleader on the LeWood squad who must undergo a brutal initiation of ass expansion and relentless sodomy, culminating in a creamy cum swap. Next, Chastity Lynn is a bratty blonde the LeWood couple have hired to watch their home. Instead, the lazy slut lounges around, smoking and drinking. Mark and Francesca teach Chastity some discipline in an intense session of face fucking and anal domination. Lovely blonde actress Lily LaBeau is a diva-esque understudy who tries to pressure the directors into giving her the main role. Instead, they slap Lily's tender ass cheeks and choke her with Mark's big boner. Lily has to perform ass-to-mouth penance to get her status back ... and winds up with a well-fucked anus and a mouthful of jism. Lastly, homeowners Mark and Francesca discover stunning ebony beauty Leilani Leeane using their pool without permission. The trespassing neighbor gets the full, ferocious LeWood treatment, culminating with a cum-splattered face! &quot;The Le Wood Anal Hazing Crew&quot; is judge, jury and sexecutioner!\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=7h19075ml3fgqolg92vr.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=7h19075ml3fgqolg92vr.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=rnb3oj1mabtytnc91h17.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=rnb3oj1mabtytnc91h17.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=7h1h60fotcmlvrfto8xq.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=7h1h60fotcmlvrfto8xq.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:20ca56250322a9c6f014489da68e63130c09a66c","amp;dn":"The.Le.Wood.Anal.Hazing.Crew.XviD-PORNOLATiON","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20ca56250322a9c6f014489da68e63130c09a66c","infoHashBuffer":{"type":"Buffer","data":[32,202,86,37,3,34,169,198,240,20,72,157,166,142,99,19,12,9,166,108]},"announce":[],"urlList":[]}}