{"title":"HOTEL TRANSYLVANIA xvid cam GLOBE","uid":7714782,"size":1061573516,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:20e8462f201a83352463ff30c51157276dec4cc1&amp;dn=HOTEL+TRANSYLVANIA+xvid+cam+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1349900147,"description":"* XVID CAM  * 01H25M59S    * + 1500 Bitrate    * Worked with the Dub plugins\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n\n* Plot :\n \nDracula (voiced by Adam Sandler) is the owner and creator of Hotel Transylvania, a five-star resort where the world's monsters can be safe from human civilization. Dracula invites some of the most famous monsters like Frankenstein's Monster (Kevin James) and his wife Eunice (Fran Drescher), Murray the Mummy (Cee Lo Green), Wayne and Wanda Werewolf (Steve Buscemi and Molly Shannon), Griffin the Invisible Man (David Spade), Bigfoot, The Blob, and other monsters to celebrate the 118th birthday of his daughter Mavis (voiced by Selena Gomez). However, Mavis prefers to explore the outside world with her father's permission, but the village he directs her to is actually an elaborate deception to convince her of the threat of humans enough to coax her back.\n \nHowever, this charade inadvertently attracts the attention of an ordinary young traveler named Jonathan (voiced by Andy Samberg) who was exploring the surrounding forest and he follows the staff to the hotel. Once Jonathan enters the hotel, Dracula frantically attempts to hide him from the patrons such as disguising him as a Flesh Golem named Johhny-stein with the later hasty cover story of being a relative of one of Frank's body parts. Eventually, Jonathan is discovered by Mavis and company, forcing Dracula to claim he is going to arrange Mavis' birthday party with a young perspective. In doing so, Jonathan manages to liven up the staid activities at the hotel, charming everyone, especially Mavis. Eventually, even Dracula begins to like the human, taking him into his confidence about his family's traumatic past after the vampire notices the young man knows something about them in a respectful manner.\n\n\n\n\n* enjoy ...\n\n\n\n\n\n* GLOBE FILES 2012\n","torrent":{"xt":"urn:btih:20e8462f201a83352463ff30c51157276dec4cc1","amp;dn":"HOTEL+TRANSYLVANIA+xvid+cam+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20e8462f201a83352463ff30c51157276dec4cc1","infoHashBuffer":{"type":"Buffer","data":[32,232,70,47,32,26,131,53,36,99,255,48,197,17,87,39,109,236,76,193]},"announce":[],"urlList":[]}}