{"title":"Lucid Rounds v0.83.13475.81462 Final By bobiras2009","uid":7650830,"size":213175,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:211a6033bb3446b8fa4d3419c648f945fd25d5a5&amp;dn=Lucid+Rounds+v0.83.13475.81462+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1348017211,"description":"Follow my uploads here:                                   &lt;a href=&quot;\nhttps://forum.suprbay.org/member.php?action=profile&amp;uid=311481&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/member.php?action=profile&amp;uid=311481&lt;/a&gt;    \n\nYou can make requests here:                                    &lt;a href=&quot;\nhttps://forum.suprbay.org/forumdisplay.php?fid=4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/forumdisplay.php?fid=4&lt;/a&gt;\n                 \n\n                                By bobiras2009\t\t\n\n\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\nRequirements: Android 2.1+\nOverview: Lucid Rounds is an icon replacement pack for Android. It comes with over 415 icons, 290 dark and 125 white.\n\nLucid Rounds is an icon replacement pack for Android. It comes with over 415 icons, 290 dark and 125 white. The pack will be updated according to requests the same or a day after. However you need to send me the email you purchased the pack with -- for confirmation. PLEASE READ BEFORE BUYING!\n\nFor the people that purchased this icon pack, the white version is free of charge! It's included in this update. There are 270 Classic Black Lucid Rounds and 125 White Lucid Rounds, feel free to send requests at any time!\n\nIf you could give me a rating, that'd be great! I appreciate each rating. If you have problems, let me know, don't just give me a bad rating, it won't solve anything.\n\nPLEASE READ BEFORE BUYING!\n\n- THIS IS NOT A THEME\n- IT WILL STAY AS AN ICON PACK! IT WILL NOT BE MADE INTO A THEME!\n- IT WILL NOT AUTOMATICALLY REPLACE YOUR ICONS\n- YOU HAVE TO REPLACE THE ICONS MANUALLY\n- YOU NEED TO HAVE AN APP THAT LET'S YOU CHANGE YOUR STOCK ICONS\n- I WILL NOT ACCEPT REQUESTS IF YOU DIDN'T BUY IT\n- ALL YOU GET IS A ZIP FILE\n- THE 'APK' SERVES AS AN EASY WAY TO PAY FOR THE ICONS\n\nTo change the icons you can use Desktop Visualizer or any launcher like Go Launcher, Nova Launcher, ADW Launcher, Launcher Pro, etc.\n\n\nIf the market says your device is incompatible, that most probably means because my app doesn't recognize the ROM or Android version you're running. Compatible Android versions are from Froyo to ICS. Jelly Bean is not yet compatible, but will be soon.\n\nIf you don't want to wait, you can buy my icon packs over paypal on my site. If you purchase it, you'll get an automatic download of the ZIP File, NOT the APK because it would be quite pointless.\n\nIf you think $0.99 is a lot of money for this much icons so you gotta steal it from me, well then you're just really sad. &lt;- Don't get offended by that, if you don't steal it, you shouldn't get offended. Just saying.\n\n\n\n                                By bobiras2009\t\t\n","torrent":{"xt":"urn:btih:211a6033bb3446b8fa4d3419c648f945fd25d5a5","amp;dn":"Lucid+Rounds+v0.83.13475.81462+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"211a6033bb3446b8fa4d3419c648f945fd25d5a5","infoHashBuffer":{"type":"Buffer","data":[33,26,96,51,187,52,70,184,250,77,52,25,198,72,249,69,253,37,213,165]},"announce":[],"urlList":[]}}