{"title":"FDHypno_FHRA - Jennifer I","uid":6797703,"size":862828417,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:218a8b954c1dcaa0f3f2446a9f6a92f02b33abb9&amp;dn=FDHypno_FHRA+-+Jennifer+I&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":6,"uploader":"Narok_Gull","files":1,"time":1320520093,"description":"Well, I don't know if this is complete or not and I guess that it's Jennifer I. Video quality is not so good but it was the only one I could find in Internet and so I post it for your enjoyment.\n\nBesides, most guys out there find that Jennifer is the hottest of FHRA hypnotists. So, she brainwashes you and try to implant in your mind some fake memories of her babysitting and imprinting you. She uses mainly her eyes , voice, boobs and word play to trick you into submission to her.\n\nThis one somehow reminds me of a Nikki Fatale mp3, featuring Shiri (the hypnowitch), where Shiri also implant fake memories for that sake. The ones willing to try it must look for Nikki's &quot;Submission to Hypnosis 1 and 2&quot;. Very good stuff imho.\n\n&quot;GOD save Nikki!&quot; You are the best!\n\nNote: I believe that credits must be given where credits are due and good work should be rewarded. So, if you really liked the content, consider supporting the producers and buy an original so they can continue to produce their stuff. Some have a very good quality and are quite affordable. It's a way to show our gratitude. Take it as a try before buy. ","torrent":{"xt":"urn:btih:218a8b954c1dcaa0f3f2446a9f6a92f02b33abb9","amp;dn":"FDHypno_FHRA+-+Jennifer+I","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"218a8b954c1dcaa0f3f2446a9f6a92f02b33abb9","infoHashBuffer":{"type":"Buffer","data":[33,138,139,149,76,29,202,160,243,242,68,106,159,106,146,240,43,51,171,185]},"announce":[],"urlList":[]}}