{"title":"The Ed Show 11-5-12.mp4","uid":7798553,"size":228007910,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:25daaee8837795e9ebe400136b6435afa70de276&amp;dn=The+Ed+Show+11-5-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1352218593,"description":"The Ed Show; Monday, November 5, 2012.\n\nHours before the election and its going down to the wire. Jay-Z and The Boss help President Barack Obama try to lock up Ohio. But the fight isn't over.\n\nEd welcomed State Sen. Nina Turner (D-OH) and former  Gov. Charlie Crist (R-FL) to discuss their states' man-made voting disasters.\n\nThe gender gap is widening for Republicans. Joan Walsh (Salon's Editor at Large, and author of &quot;What's The Matter With White People? Why We Long For A Golden Age That Never Was&quot;), and Terry O'Neill (President of The National Organization for Women), previewed election day's Republican casualties in the war on women.\n\nThen, The Ed Show looked at the electoral map. Democratic pollster Fred Yang joined Ed to discuss what to look for as the results come in.\n\nThe closing arguments have been made. Some final thoughts from our mega, ultra, all-star panel of Richard Wolffe (MSNBC Political Analyst), Eugene Robinson (MSNBC Analyst and Associate Editor and Pulitzer Prize winning Columnist for the Washington Post), and Howard Fineman (NBC News Political Analyst and Editorial Director of the Huffington Post Media Group).\n\nAnd in Tuesday's election, we can continue on the path of progress with President Obama or we can take a hard right turn back to the polices we know don't work.\n\nEd had commentary on what's at stake for the middle class. If you can vote in America's election please do.","torrent":{"xt":"urn:btih:25daaee8837795e9ebe400136b6435afa70de276","amp;dn":"The+Ed+Show+11-5-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25daaee8837795e9ebe400136b6435afa70de276","infoHashBuffer":{"type":"Buffer","data":[37,218,174,232,131,119,149,233,235,228,0,19,107,100,53,175,167,13,226,118]},"announce":[],"urlList":[]}}