{"title":"Weather Display v 10.37R Build 42","uid":7726954,"size":27993989,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:268c36655e378566d4a6bb8b7d4394587b8bb5e1&amp;dn=Weather+Display+v+10.37R+Build+42&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"wallpwallpapers","files":-1,"time":1350238051,"description":"Weather Display is the software to get the most from your weather station. Not only does it support a huge range of stations from all the major manufacturers but it's also stacked with features and options. These include real time, auto scale and graph history graphing, FTP of the weather data to your web page, pager and email notifications of extreme conditions, web download, Metar/ Synop emails, averages/extreme/climate/NOAA reports, web cam upload, grouped file uploads, FTP downloads, decoded metar download's, APRS output (internet and direct com port as well) ,WAP, direct web cam capture, animated web cam images, weatherdials, weather voice, weather answer phone, use of Dallas 1 wire sensors (such as lightning counter, solar sensor, barometer sensor and extra temperature/humidity sensors with any weather station), use a Labjack to add extra temperature or humidity sensor to your existing weather station (USB)... and lots more!\n\n\nTop Features:\n\n* See What's Ahead\nExtensive daily &amp; hourly forecasts help you plan for today and the week ahead.\n\n* Real Time Updates\nThe fluid interface refreshes itself in real time as new weather information is available.\n\n* Several Weather Sources\nConnect to NWS weather stations, real time WeatherBug weather stations or weather stations from the WeatherBug Backyard network.\n\n* Timely Alert Notifications\nStay on top of weather, hydrologic and climate alerts as issued by the National Weather Service.\n\n* Weather Maps Galore\nBrowse through hundreds of maps or add your own from your favorite Internet sources.\n\n* Highly Customizable Interface\nTake advantage of the many interface settings to personalize Weather Watcher Live.\n\nInstall:\n\n- run application\n- use keygen","torrent":{"xt":"urn:btih:268c36655e378566d4a6bb8b7d4394587b8bb5e1","amp;dn":"Weather+Display+v+10.37R+Build+42","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"268c36655e378566d4a6bb8b7d4394587b8bb5e1","infoHashBuffer":{"type":"Buffer","data":[38,140,54,101,94,55,133,102,212,166,187,139,125,67,148,88,123,139,181,225]},"announce":[],"urlList":[]}}