{"title":"Orgasms - Ivy, George XXX","uid":7765038,"size":591705330,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:269cec3e737c99dc381766024a4a0be5195ace18&amp;dn=Orgasms+-+Ivy%2C+George+XXX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1351349263,"description":"SCREENSHOTS:\n &lt;a href=&quot;\nhttp://fapking.in/IMAGE1/share-BF2D_508BD7A4.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://fapking.in/IMAGE1/share-BF2D_508BD7A4.html&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://fapking.in/IMAGE3/share-54C5_508BD7C7.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://fapking.in/IMAGE3/share-54C5_508BD7C7.html&lt;/a&gt;\n\n\nIvy is more than 20 years younger than George. His maturity and experience excites her! She loves being taken by a man who knows what he is doing, especially if he wants to see her shudder in orgasmic delight!\nGeorge gets very excited when he works for us, not only does he love our sensual and natural style, but he also shares our love of women. He is a true gentleman when he makes love, a very unselfish lover who takes great joy in seeing a girl quiver in pleasure. He gets so excited that he comes multiple times during a scene! The girls love this too, they know they excite him and it's quite the thrill to bring that out in someone!\nGeorge takes his sweet time with the gorgeous young Ivy, he undresses her and kisses her all over, then opens her legs to taste her delicious pussy, which swells and moistens with every suck and lick. George can't resist nuzzling at Ivy's bum hole, his primal urges take over and he enjoys savouring Ivy's tight ass to her delight!\nHis rock hard, thick cock penetrates her and she gleefully shivers as it stretches her, as she feels him enter deeper inside her. She is so warm and tight that George comes before she can, but he's not finished, like a considerate lover he continues to pleasure her until she is exhausted, and satisfied. He too had his fill, ejaculating twice and enjoying every passing second of intimacy with the incredible young lady.","torrent":{"xt":"urn:btih:269cec3e737c99dc381766024a4a0be5195ace18","amp;dn":"Orgasms+-+Ivy%2C+George+XXX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"269cec3e737c99dc381766024a4a0be5195ace18","infoHashBuffer":{"type":"Buffer","data":[38,156,236,62,115,124,153,220,56,23,102,2,74,74,11,229,25,90,206,24]},"announce":[],"urlList":[]}}