{"title":"Call Of Duty - Black Ops with dev mode","uid":6798756,"size":8421457362,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:26d52397e270abf04b08326a96222dfe719bcc17&amp;dn=Call+Of+Duty+-+Black+Ops+with+dev+mode&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"davo43","files":354,"time":1320578698,"description":"\nCall of Duty: Black Ops / Activision\n\nRELEASE DATE : 09-11-2010              PROTECTION : Steam + CEG\nGAME TYPE    : Shooter                 DISKS      : None\n\n\nThe biggest first-person action series of all time and the\nfollow-up to last year's blockbuster Call of Duty: Modern\nWarfare 2 returns with Call of Duty: Black Ops.\n\nCall of Duty: Black Ops will take you behind enemy lines as a\nmember of an elite special forces unit engaging in covert\nwarfare, classified operations, and explosive conflicts across\nthe globe. With access to exclusive weaponry and equipment,\nyour actions will tip the balance during the most dangerous\ntime period mankind has ever known.\n\nCinematic Single Player Campaign: An epic campaign and story\nthat takes you to a variety of locations and conflicts all\nover the world where you will play as an elite Black Ops\nsoldier in deniable operations where if you are caught,\ncaptured or killed, your country will disavow all knowledge of\nyour existence.\n\nSignature Multiplayer: Call of Duty's signature multiplayer\ngameplay returns with new perks and killstreaks, deeper levels\nof character and weapon customization, and all new modes\nincluding:\n\nWager Matches: One in the Chamber, Gun Game, Sticks and\nStones, Sharpshooter\n\nTheater Mode: View, record, and edit your favorite moments\nfrom multiplayer, and share with your friends\n\nCombat Training: Test your skill solo or Co-Op with friends\nagainst AI enemy players\n\nZombies!: Fan favorite Zombie mode is back providing endless\nhours of Zombie-slaying entertainment, solo or Co-Op\n\nThis has dev mde press ~ to open console to play zombie's five type devmap zombies_pentagon then same thing but theater \n\n1.unrar to where ever u want ti\n2.start blackops\n3.play","torrent":{"xt":"urn:btih:26d52397e270abf04b08326a96222dfe719bcc17","amp;dn":"Call+Of+Duty+-+Black+Ops+with+dev+mode","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26d52397e270abf04b08326a96222dfe719bcc17","infoHashBuffer":{"type":"Buffer","data":[38,213,35,151,226,112,171,240,75,8,50,106,150,34,45,254,113,155,204,23]},"announce":[],"urlList":[]}}