{"title":"The Vampyr A Soap Opera (BBC TV) [1992]","uid":6802690,"size":659909881,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2936339c7b5ecd285c1fa93652cf4ed21697e80f&amp;dn=The+Vampyr+A+Soap+Opera+%28BBC+TV%29+%5B1992%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":6,"uploader":"ThorntonWilde","files":-1,"time":1320751071,"description":" &lt;a href=&quot;http://bayimg.com/CaKLkAAdn&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/CaKLkAAdn&lt;/a&gt;\n\nThe Vampyr: A Soap Opera (BBC TV) [1992] \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0105724/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0105724/&lt;/a&gt;\n\nThe Vampyr: A Soap Opera (1992) (TV)\n\nThis is a full screen VHS transfer downloaded from Cinemageddon.org; the quality is not very good.  This does not appear to be available on DVD, but it is an entertaining and unusual adaptation of a classic story.\n\n1 hr 36 min\n\nDirected by \nNigel Finch    \n  \nWriters\nHeinrich Marschner   (opera 1827)\nWilhelm August Wohlbruck   (opera libretto 1827)\nCharles Hart   (words 1992)\n\nAdapted from \nLord Byron   story &quot;The Vampyr&quot; \nJohn Polidori   story \n\nDer Vampyr (The Vampire) is a Romantic opera in two acts by Heinrich Marschner. The German libretto by Wilhelm August WohlbrÃƒÂ¼ck (Marschner's brother-in-law) is based on the play Der Vampir oder die Totenbraut (1821) by Heinrich Ludwig Ritter, which itself was based on the short novel The Vampyre (1819) by John Polidori. The first performance took place on 29 March 1828 in Leipzig, where it was a hit.\n\nThe opera is still occasionally performed, and, in 1992, an updated adaptation, entitled The Vampyr: A Soap Opera, with new lyrics by Charles Hart, starring Omar Ebrahim and produced by Janet Street-Porter, was serialised on BBC television.\n\nThe Vampyr: A Soap Opera is a miniseries based on Heinrich Marschner's opera Der Vampyr. It first aired on BBC 2 on December 2, 1992. The new English libretto was written by Charles Hart, based on a story by Janet Street-Porter and Nigel Finch, which was based on the original libretto by Wilhelm August WohlbrÃƒÂ¼ck, which was based on John Polidori's short story &quot;The Vampyre.&quot; It was conducted by David Parry and directed by Nigel Finch.\n\nAlthough the libretto of The Vampyr is based on that of Der Vampyr, there have been numerous changes because of the modernization of the plot and the constraints of the miniseries form. Almost every choral number has been cut. The characters' relationships have been changed: for example, Berkeley becomes Ginny's lover rather than her father, and Emma is no longer engaged to George. Alex's aria is relocated from the second act to the first act, after he finds Ripley's body, and George sings Alex's part in the first half of the Act II finale. The drinking quintet, in which Suse Blunt scolds her husband and his friends for drinking, becomes a friendly scene between co-workers at a car wash.\n\n Omar Ebrahim ...  Ripley, the Vampyr [yummy]\n Willemijn Van Gent ...  Ginny \n Roberto Salvatori ...  Berkeley \n Colenton Freeman ...  George \n Roy Gregory ...  Police Inspector \n Fiona O'Neill ...  Miranda \n Philip Salmon ...  Alex \n Winston ...  High Priestess of Satan \n Richard Van Allan ...  Davenant \n Charles Hart ...  Dornan \n Salli-Ann Shepherdson ...  Emma (as Sally-Ann Shepherdson)\n\nAcolytes\n China Gordon Moya Griffiths  Hayley Kaye Leigh Mathey Miranda  PÃƒÂ­a \n\nSatanists\n Richard Ashley  Hema Chavda  Pamela Craine  Michael Eton  Yvonne French  Anna Golden  Clive Hopkins  Bernard Jamieson  Gillian Jesson  Audrey Kirby  Vanita Nichols  Cliffe Obaseki  Helen Sheals  Guy Standeven  Lionel Stevens  Janet Varley \n\n\n\nSynchronised Swimmers\n Mark Jarvis  Clare Pember  Alan Wolleston  Jayne Wolleston \n \n\nTwins\n Angela Hart  Liz Cook \n\n Sarah Jane Wright ...  Susie \n Richard Suart ...  Blunt \n Sjaak Van der Bent ...  Car Wash Attendant \n Maurice Clarke ...  Car Wash Attendant \n Tarcissius Januel ...  Car Wash Attendant \n Richard Caldicot ...  Vicar \n Robert Stephens ...  Narrator \n\n\nDer Vampyr (The Vampire) is a Romantic opera in two acts by Heinrich Marschner. The German libretto by Wilhelm August WohlbrÃƒÂ¼ck is based on the play Der Vampir oder die Totenbraut (1821) by Heinrich Ludwig Ritter, which itself was based on the short novel The Vampyre (1819) by John Polidori. The first performance took place on 29 March 1828 in Leipzig. The opera is still occasionally performed, and, in 1992, an updated adaptation, entitled The Vampyr, a Soap Opera, with new lyrics by Charles Hart, starring Omar Ebrahim and produced by Janet Street-Porter, was serialised on BBC television.\n\nBAFTA Awards \n \n1993  Nominated BAFTA TV Award Best Design Jim Grant \n \nI could not find a list online of the song titles, but these are from the OST on Amazon UK:\n\n1. Overture  \n2. Hail Satan - Chorus  \n3. Blood, My Life Is in Their Blood - Omar Ebrahim  \n4. Summer Night Smile Down on Me - Fiona O'Neill  \n5. Where Is Davenant? - Omar Ebrahim, Fiona O'Neill, , Richard Van Allan, Chorus  \n6. Now You Look Like the Kind of Guy - Omar Ebrahim, ,  \n7. Right, It's Time I Had Some Answers - Omar Ebrahim,  \n8. Want to Know Why I Was Watching You? - Omar Ebrahim,  \n9. Morning, With You in a Tick - Richard Suart, Susie Wright, Chorus  \n10. Cold Light of Death - Chorus  \n11. Come on, I Haven't Got All Morning - Fiona O'Neill,  \n12. Maker of Every Good - Omar Ebrahim, Fiona O'Neill, , Chorus,  \n\n","torrent":{"xt":"urn:btih:2936339c7b5ecd285c1fa93652cf4ed21697e80f","amp;dn":"The+Vampyr+A+Soap+Opera+%28BBC+TV%29+%5B1992%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2936339c7b5ecd285c1fa93652cf4ed21697e80f","infoHashBuffer":{"type":"Buffer","data":[41,54,51,156,123,94,205,40,92,31,169,54,82,207,78,210,22,151,232,15]},"announce":[],"urlList":[]}}