{"title":"Twister(1996)DVDRip.AC3(ENG)-DROCK","uid":6798512,"size":734012552,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:298d3fcdac12954e078019c7d1a8eae745575078&amp;dn=Twister%281996%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"drock232","files":-1,"time":1320563279,"description":"Bill Paxton, Helen Hunt and Carey Elwes may be billed as the stars of Twister, but the film\\\\\\'s real attractions are the cyclones themselves. Best experienced in a theater, the nail-biting, blow-the-audience-out-of-their-seats computer generated graphics, cutting edge sound and other special effects are designed to take viewers straight into the roaring funnel of a gigantic tornado. In order to focus on special effects and action, the story is simple and the characters are drawn in broad strokes with little depth. Jo Harding (Hunt) became a storm chaser (a meteorologist who photographs and scientifically studies tornadoes in the field) after a large twister sucked her hapless daddy into oblivion when she was a girl. Bill (Paxton) was a storm chaser too, but left to become a successful weatherman. His change of profession ruined his marriage to Jo. Before separating, the Hardings invented DOROTHY, a gizmo designed to release thousands of tiny sensors when a tornado passes over it. The Hardings hope the information transmitted by the sensors will provide insight into the nature of the whirling windstorms. Backed by a large corporation, the villainous Dr. Jonas Miller (Elwes) has created a similar machine. Neither gadget has been field tested and both groups of storm chasers are anxious to find tornadoes. At the peak of the worst twister season in decades, Bill shows up at Jo\\\\\\'s truck with his prissy fiancee Melissa (Jami Gertz) so Jo can sign divorce papers. Suddenly a twister is spotted. With little hesitation, Bill rejoins the mad rush to reach it in time to activate DOROTHY. Jonas and his team are right behind them. Throughout the day the storms become worse and the rivalrous race becomes more intense. As they continue facing incredible dangers together Jo and Bill find renewed love while poor Melissa finds only an intense desire to get away from these storm-obsessed lunatics.\n\nRipped with Handbrake.\n\nLength: 1 Hour 53 Minutes\n\nFile Type: MP4\n\nFrame Width: 624\n\nFrame Height: 352\n\nFrame Rate: 29fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:298d3fcdac12954e078019c7d1a8eae745575078","amp;dn":"Twister%281996%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"298d3fcdac12954e078019c7d1a8eae745575078","infoHashBuffer":{"type":"Buffer","data":[41,141,63,205,172,18,149,78,7,128,25,199,209,168,234,231,69,87,80,120]},"announce":[],"urlList":[]}}