{"title":"Up with Chris Hayes 10-7-12.mp4","uid":7709162,"size":363254082,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:29f37f10df4ceea3afb2008acc0a80c7163a47a5&amp;dn=Up+with+Chris+Hayes+10-7-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":-1,"time":1349763062,"description":"Up with Chris Hayes; Sunday, October 7, 2012.\n\nOn Sunday's Up w/ Chris Hayes, Chris and his guests examined the praise political leaders shower on &quot;small business&quot; as the engine of economic growth, and they investigated what really qualifies as a &quot;small business.&quot; Also: According to a recent NBC/Wall Street Journal Poll, the most important issue for voters in this election is the economy. The second most important? Social issues, which were glaringly absent from Wednesday's presidential debate. The candidates failed to address gun control, climate change, immigration and women's rights, among other topics. They discussed the topics that were left out of the debate. And: During the Republican primaries, Romney shifted right on immigration, advocating policies he claimed would cause &quot;illegal aliens&quot; to &quot;self-deport.&quot; Now he has tacked to the center in order to appeal to undecided, independent voters. Amid all this, The New York Times has announced that it will continue to use the terms &quot;illegal immigrants&quot; and &quot;illegal immigration.&quot;\n\nJoining Chris were:\n\nDemocratic Rep. Peter Welch (holds Vermont's only House seat and serves as chief deputy whip in the Democratic caucus), Chris Rabb,(adjunct professor for the Fox School of Business at Temple University and author of &quot;Invisible Capital: How Unseen Forces Shape Entrepreneurial Opportunity&quot;), Ro Khanna (former deputy assistant secretary at the Department of Commerce and author of &quot;Entrepreneurial Nation: Why Manufacturing is Still Key to America's Future&quot;), and  JJ Ramberg (@jjramberg), host of MSNBC's &quot;Your Business&quot; and co-author of &quot;It's Your Business: 183 Essential Tips that Will Transform Your Small Business.&quot; discussed small business.\n\n[Peter Welch stayed in his seat]. Lizz Winstead (comedian and co-creator of &quot;The Daily Show&quot;, John McWhorter (professor of linguistics and American studies at Columbia University, contributing editor at the &quot;New Republic&quot; and &quot;Daily News&quot; columnist&quot;), Rebecca Traister (contributor to to the New York Times Magazine and Salon.com. Author of &quot;Big Girls Don't Cry: The Election that Changed Everything for American Women&quot;) discussed issues omitted in the debate.\n\nJose Antonio Vargas (Pulitzer prize-winning journalist and founder of the Define American campaign) replaced Peter Welch on the panel, Brooke Gladstone (co-host and managing editor of WNYC's &quot;On the Media&quot;) replaced Lizz Weinstead on the panel, [John McWhorter stayed],and Maria Hinojosa (rotating anchor for PBS' &quot;Need to Know,&quot; executive producer for &quot;America by the Numbers with Maria Hinajosa,&quot; anchor and executive producer of NPR's &quot;Latino USA,&quot; winner of 2012 John Chancellor award for Excellence in Journalism) discussed the term 'illegal immigrant'.\n\nThe latest panel stayed for 'You Should Know'.","torrent":{"xt":"urn:btih:29f37f10df4ceea3afb2008acc0a80c7163a47a5","amp;dn":"Up+with+Chris+Hayes+10-7-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29f37f10df4ceea3afb2008acc0a80c7163a47a5","infoHashBuffer":{"type":"Buffer","data":[41,243,127,16,223,76,238,163,175,178,0,138,204,10,128,199,22,58,71,165]},"announce":[],"urlList":[]}}