{"title":"FIFA.13.INTERNAL.CRACK.ONLY-RELOADED","uid":7704696,"size":30074368,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2a15bc76160f7a6470413aadeb3ebbac78b931bb&amp;dn=FIFA.13.INTERNAL.CRACK.ONLY-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Gh0stNet","files":2,"time":1349653168,"description":"\n                           FIFA 13 *INTERNAL* (c) EA\n \n           10/2012 :..... RELEASE.DATE .. PROTECTION .......: Secu/Crap/EA\n                 1 :.......... DISC(S) .. GAME.TYPE ........: Sports\n \n\n\n Note: This release is meant for our sites, its ops and users, and those who\n   request it. We've labeled it internal because the DRM is bypassed using a\n   loader. The game works, but it's not how we would usually release a crack.\n   A more proper way of cracking it exists, but would take extra time. The\n   rules we follow also do not allow for loaders of this kind to be released,\n   and it seems unlikely that new rules will come.\n \n \n   FIFA 13 captures all the drama and unpredictability of real-world\n   soccer, and is driven by five game-changing innovations which\n   revolutionize artificial intelligence, dribbling, ball control and\n   physical play. It is the largest and deepest feature set in the history\n   of the franchise. These innovations create a true battle for possession\n   across the entire pitch, deliver freedom and creativity in attack, and\n   capture all the drama and unpredictability of the real-world game.\n \n   FEATURES\n   Attacking Intelligence - Players have the ability to analyse space, work\n   harder and smarter to break down the defense, and think two plays ahead.\n   Plus, players make runs that pull defenders out of position and open\n   passing channels for teammates.\n \n   Complete Dribbling - Face your opponent and use precise dribble touches\n   combined with true 360-degree mobility with the ball. Be more creative\n   and dangerous in 1v1 opportunities.\n \n   1st Touch Control - A new system transforms the way players control the\n   ball, eliminating near-perfect touch for every player, and creating more\n   opportunities for defenders to capitalise on errant balls and poor\n   touches to win back possession.\n\n  1. Unrar.\n   2. Burn or mount the image.\n   3. Install the game.\n   4. Copy the cracked files from the Crack directory on the disc to the\n      &lt;install&gt;Game directory, overwriting the existing exe.\n   5. Before you start the game, use your firewall to block all exe files in\n      the game's install directory from going online. Use the game setup\n      before starting as well. It can be found in the following directory:\n      &lt;install&gt;Gamefifasetup\n   6. Play the game. While in game, avoid all of the online options. If you\n      have Origin installed, it may start it up. If that happens, ignore the\n      prompt, play offline, and don't login.\n   7. Enjoy!","torrent":{"xt":"urn:btih:2a15bc76160f7a6470413aadeb3ebbac78b931bb","amp;dn":"FIFA.13.INTERNAL.CRACK.ONLY-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a15bc76160f7a6470413aadeb3ebbac78b931bb","infoHashBuffer":{"type":"Buffer","data":[42,21,188,118,22,15,122,100,112,65,58,173,235,62,187,172,120,185,49,187]},"announce":[],"urlList":[]}}