{"title":"ntr 2013 v1.0.3","uid":7692730,"size":657920,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2a89f340f565016c7cde66cd6963fe6a100f0539&amp;dn=ntr+2013+v1.0.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"truemaster","files":1,"time":1349280540,"description":"Norton ntr v 1.0.3 for Norton:is.av.360 2013 the creator of this ntr says that this is for all Norton products I have test it only on Norton is 2013 because that is the Norton product I use on my pc\n\n\n            instructions \n\nif Norton is install but has expired first try to run this ntr as admin in safe mode if that is not do the trick then uninstall Norton run this ntr as admin and select purge Norton. install Norton again reboot windows in safe mode and run ntr as admin. if your Norton is nearly to expire and you have use previus the ntr then turn Norton tampter protection off and use ntr in this scenario you don't need to run ntr in safe mode. if you never use an ntr before then yes in this scenario you need to run ntr in safe mode\n\nremember you only must run ntr in safe mode for the very first time from there and on you can use it from normal mode always after turn Norton tampter protection off. this ntr can give you only 60 days so don't ask stupid questions plese release an ntr for more days 2 I don't create this program 3read what are you selecting after run this ntr its noob friendly","torrent":{"xt":"urn:btih:2a89f340f565016c7cde66cd6963fe6a100f0539","amp;dn":"ntr+2013+v1.0.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a89f340f565016c7cde66cd6963fe6a100f0539","infoHashBuffer":{"type":"Buffer","data":[42,137,243,64,245,101,1,108,124,222,102,205,105,99,254,106,16,15,5,57]},"announce":[],"urlList":[]}}