{"title":"LAWLESS Xvid Cam - GLOBE","uid":7639295,"size":1518539754,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2aca9a6c36a51e7f32872892c966320e9ee9515d&amp;dn=LAWLESS+Xvid+Cam+-+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1347735187,"description":"* XVID CAM  * 01H49M13S    * + 1500 Bitrate    * Worked with the Dub plugins\n\n\n* FILE INFO :\n\n\n- Because the low audio on the original file , the \n  AUDIO WAS IMPROVED IN 250 percent .\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n\n* Plot :\n\nDuring the Prohibition era, the Bondurant brothers -- Forrest (Tom Hardy), Howard (Jason Clarke) and Jack (Shia LaBeouf) -- run a successful liquor bootlegging business in Franklin County, Virginia, with the help of their friend, Cricket Pate (Dane DeHaan), using their bar as a front for their illegal activities.\n\nOne day, Jack witnesses mobster Floyd Banner (Gary Oldman) eliminating a competitor and they exchange looks before Jack returns to the bar, where Forrest hires Maggie Beauford (Jessica Chastain), a dancer from Chicago, to be their new waitress. Shortly afterwards, the bar is visited by brutal Special Detective Charlie Rakes (Guy Pearce), on behalf of Commonwealth's Attorney Mason Wardell. Rakes informs Forrest that he wants a cut of all profit made by Franklin's bootleggers, but Forrest refuses and threatens to kill Rakes if he returns. Forrest later meets with the other bootleggers and convinces them to stand up to Rakes as well, though they eventually give in to Rakes' violent intimidation tactics.\n\nMeanwhile, Jack meets Bertha Minnix (Mia Wasikowska), daughter of the local preacher. He attends the church drunk and makes a fool of himself, causing Bertha's father to forbid her from seeing him, which only makes her more interested in Jack, with whom she flirts. Jack later finds Rakes raiding Cricket's house in search of his distilation equipment. When they don't find it, Rakes brutally beats Jack when he tries to intervene. Forrest hears of this and tells Jack that he needs to learn how to fight for himself.\n\nForrest and Howard arrange to meet with potential clients from Chicago, but Howard misses his appointment to get drunk with a friend, and Forrest ends up beating the two men with Cricket's help when they harrass Maggie. Later, after Cricket leaves, the men return, slash Forrest's throat, and rape Maggie.\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n\n* GLOBE FILES 2012","torrent":{"xt":"urn:btih:2aca9a6c36a51e7f32872892c966320e9ee9515d","amp;dn":"LAWLESS+Xvid+Cam+-+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2aca9a6c36a51e7f32872892c966320e9ee9515d","infoHashBuffer":{"type":"Buffer","data":[42,202,154,108,54,165,30,127,50,135,40,146,201,102,50,14,158,233,81,93]},"announce":[],"urlList":[]}}