{"title":"Criminal Minds Seizoen 1 DVD 1 (multi audio subs) TBS","uid":6798754,"size":4622420882,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2bbd256f4e5ea87ff5c09c43261aa955c39f1162&amp;dn=Criminal+Minds+Seizoen+1+DVD+1+%28multi+audio+subs%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Betty-Boop","files":-1,"time":1320578643,"description":"Criminal Minds Seizoen 1 DVD 1\n \t\n\n SERIE\n\nFBI-agenten Jason Gideon (Mandy Patinkin) en Aaron &quot;Hotch&quot; Hotchner staan aan het hoofd van een Behavioral Analysis Unit van de FBI in Quantico, een team &quot;profilers&quot; dat gespecialiseerd is in het analyseren van de gedachtengang van criminelen. Teamgenoot Dr Spencer Reid (Matthew Gray Gubler) compenseert zijn gebrek aan sociale vaardigheden met een hoog IQ en uitstekend denkwerk. Derek Morgan (Shemar Moore) is een specialist in obsessionele misdaden en Elle Greenway (Lola Glaudini) heeft zich toegelegd op het onderzoek van seksuele misdrijven. Jennifer &quot;JJ&quot; Jareau (A.J. Cook) is de woordvoerster van het team terwijl Penelope Garcia (Kirsten Vangsness) altijd aan haar computers klaar zit om allerhande informatie op te snorren.\n\n1.1. Extreme Aggressor (pilot)\nEen jonge vrouw wordt door een seriemoordenaar ontvoerd. FBI-agent Gideon wordt opgeroepen om de moordenaar op te sporen voordat er een nieuw slachtoffer valt.\n\n1.2. Compulsion\nGideon en zijn team worden opgeroepen om een gevaarlijke pyromaan te neutraliseren die een universiteitscampus in Arizona teistert.\n\n1.3. Won't Get Fooled Again\nEen rustige wijk in Florida valt ten prooi aan een bomterrorist. Gideon ziet geen andere oplossing dan de hulp in te roepen van ÃƒÂ©ÃƒÂ©n van zijn aartsvijanden, een expert ter zake...\n\n1.4. Plain Sight\nEen verkrachter terroriseert welgestelde dames en kleeft hun oogleden open vooraleer hen te doden. Onze elite-eenheid vliegt naar San Diego om de lokale politie te helpen deze verkrachter te strikken.\n\n\n\nEnglish\n\nStoryline\n\nBased in Quantico, Virginia, the Behavioral Analysis Unit (BAU) is a subsection of the FBI. Called in by local police departments to assist in solving crimes of a serial and/or extremely violent nature where the perpetrator is unknown (referred to by the Unit as the unknown subject or unsub for short), the BAU use the controversial scientific art of profiling to track and apprehend the unsub. Profiling entails coming up with basic characteristics of the unsub and the victims (referred to as the victimology), using evidence from the case and matching that information to historic precedents and psychological analyses as a means to solve the case. Because of the nature of the work conducted by the BAU - the work being time consuming and psychologically demanding - its members are fiercely loyal to the Unit and to its other members. Also because of the work's overall demanding nature, not many members of the BAU have been able to maintain a happy or stable family life.\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0452046/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0452046/&lt;/a&gt;\n*****************************************************************************************\n\nSpotinfo\n\nSource : Retail\n\nFormaat : DVD5\n\nMenu : Retail\n\nAudio : Engels French Spanish DD5.1\n \nOndertiteling : English, French, Spanish, Dutch,Swedish, Norwegian, Danish, Icelandic\nCover : Multi DVD cover in deel 1\n\n@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\n\nKom ook eens kijken :\n     &lt;a href=&quot;\nhttp://black-sam.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://black-sam.org&lt;/a&gt;\n\n[img]http://img708.imageshack.us/img708/589/blacksam3.jpg[/img]\nEnjoy\n\n\n@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\t\n\n","torrent":{"xt":"urn:btih:2bbd256f4e5ea87ff5c09c43261aa955c39f1162","amp;dn":"Criminal+Minds+Seizoen+1+DVD+1+%28multi+audio+subs%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bbd256f4e5ea87ff5c09c43261aa955c39f1162","infoHashBuffer":{"type":"Buffer","data":[43,189,37,111,78,94,168,127,245,192,156,67,38,26,169,85,195,159,17,98]},"announce":[],"urlList":[]}}