{"title":"Paradise or Oblivion Disc B Subs MKV","uid":7715418,"size":2114107604,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2c11de03351e3461a058bab42407283caf09e98e&amp;dn=Paradise+or+Oblivion+Disc+B+Subs+MKV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1349917342,"description":"\n\nDisc B Subs Contain - Disk B Subtiles - English | Hungarian | Italian | Lithuanian | Macedonian | Mongolian | Norwegian | Persian Farsi | Portuguese | Romanian | Russian | Slovenian | Spanish | Swedish | Turkish\n\n\n\nParadise or Oblivion is a free online documentary created by The Venus Project. Original music by Carly Paradis \n\n(www.carlyparadis.com) from her album &quot;They Have Been Watching&quot;.\n\nThis documentary details the root causes of the systemic value disorders and detrimental symptoms caused by our current \n\nestablished system. This video presentation advocates a new socio-economic system, which is updated to present-day \n\nknowledge, featuring the life-long work of Social Engineer, Futurist, Inventor and Industrial Designer Jacque Fresco, which \n\nhe calls a Resource-Based Economy.\n\nThe film details the need to outgrow the dated and inefficient methods of politics, law, business, or any other \n\n&quot;establishment&quot; notions of human affairs, and use the methods of science, combined with high technology, to provide for the \n\nneeds of all the world's people. It is not based on the opinions of the political and financial elite or on illusionary \n\nso-called democracies, but on maintaining a dynamic equilibrium with the planet that could ultimately provide abundance for \n\nall people.\n\nParadise or Oblivion, by The Venus Project, introduces the viewer to a more appropriate value system that would be required \n\nto enable this caring and holistic approach to benefit human civilization. This alternative surpasses the need for a \n\nmonetary-based, controlled, and scarcity-oriented environment, which we find ourselves in today.\n\n*This is NOT the &quot;major motion picture&quot; that The Venus Project is working towards but rather is a 48 minute documentary to \n\nintroduce the aims and proposals to new people.","torrent":{"xt":"urn:btih:2c11de03351e3461a058bab42407283caf09e98e","amp;dn":"Paradise+or+Oblivion+Disc+B+Subs+MKV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c11de03351e3461a058bab42407283caf09e98e","infoHashBuffer":{"type":"Buffer","data":[44,17,222,3,53,30,52,97,160,88,186,180,36,7,40,60,175,9,233,142]},"announce":[],"urlList":[]}}