{"title":"FSX - FS2004 - First Class Simulations - Discover Europe","uid":6810713,"size":90802164,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2c37a37423635f57b23d5f355ebc62404eb54fcf&amp;dn=FSX+-+FS2004+-+First+Class+Simulations+-+Discover+Europe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"badmed","files":-1,"time":1321028363,"description":"Fully included in the package is a detailed rendition of the Piper Pacer which First Class Simulations state has been carefully crafted by a team of professional enthusiasts to be the ideal accompaniment to the journey. Offering both manoeuvrability and benign handling characteristics the Pacer is a stable platform that is particularly well suited to the role of a sightseeing aircraft.\n\nThe package invites us to take an Alpine adventure , to put our piloting skills to the test over the Pyrenees. Following the tour affords the opportunity to visit Paris, Rome, Madrid, Venice, Prague, Warsaw, Vienna, and a whole host of countries and cities that reflect the multicultural tapestry of the continent. With a range of flights for both novice and seasoned aviators the developers hope that there is something for everyone, from challenging approaches to a leisurely Mediterranean descent into the playground resorts of the rich and famous.\n\nThe adventure is supported by lavish extras including a tourists guide to all the destinations visited, detailed pilots notes, a comprehensive briefing and a tutorial for the included Piper aircraft. Available for FS2004 and FSX.\n\nUploading some older torrents that are not available on TPB\n\nRequesting Orbx Anacortes","torrent":{"xt":"urn:btih:2c37a37423635f57b23d5f355ebc62404eb54fcf","amp;dn":"FSX+-+FS2004+-+First+Class+Simulations+-+Discover+Europe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c37a37423635f57b23d5f355ebc62404eb54fcf","infoHashBuffer":{"type":"Buffer","data":[44,55,163,116,35,99,95,87,178,61,95,53,94,188,98,64,78,181,79,207]},"announce":[],"urlList":[]}}