{"title":"The Ed Show 10-25-12.mp4","uid":7766236,"size":195078222,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2d31d2a38c328ef44c9b7d53a6733bfa060ce271&amp;dn=The+Ed+Show+10-25-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1351382875,"description":"The Ed Show; October 25, 2012.\n\n    Mitt Romney literally ran away from questions about his support of Richard Mourdock, the U.S. Senate candidate in Indiana who says rape victims should be forced to carry her rapist's baby to term &quot;as God intended. Ed welcomed Sen. Barbara Boxer (D-CA) on Romney's failure to lead.\n\n    Then, Republicans accepted Richard Mourdock's non-apology for his comments about rape, but will voters? Republican Strategist Ron Christie and Keli Goff (author of &quot;The GQ Candidate&quot; and Political Correspondent for TheRoot.com), joined Ed for that debate.\n\n    Gen. Colin Powell didn't mince words when it comes to his thoughts on Mitt Romney. Michael Tomasky (Special Correspondent at The Daily Beast), commented on why Powell endorsed President Obama.\n\n    Tea Party activists at True The Vote are planning to harass minority voters across the country on Election Day.  And new reporting suggests they are targeting Latinos.  Ed had reaction and analysis from Rep. Elijah Cummings (D-MD).\n\n    Another CEO threatened employees with cuts to benefits if President Obama wins a second term. Ed had the details.\n\n    And in the Big Finish, they looked at the extent of Bain Capital's outsourcing, and what it means for American workers if Mitt Romney is in charge. Ed commented on this!\n","torrent":{"xt":"urn:btih:2d31d2a38c328ef44c9b7d53a6733bfa060ce271","amp;dn":"The+Ed+Show+10-25-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d31d2a38c328ef44c9b7d53a6733bfa060ce271","infoHashBuffer":{"type":"Buffer","data":[45,49,210,163,140,50,142,244,76,155,125,83,166,115,59,250,6,12,226,113]},"announce":[],"urlList":[]}}