{"title":"Windows XP Professional 32-bit en-US - Black Edition v2011.11.10","uid":6806864,"size":692612638,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3097e8b09b5e933c91915e1b3432bb5d9886bea1&amp;dn=Windows+XP+Professional+32-bit+en-US+-+Black+Edition+v2011.11.10&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LuxLOL","files":1,"time":1320896612,"description":"WinXP_32-bit_BE v2011.11.10 - Virus Scan Screenshot: http://picfront.de/d/8pnB\n\n                                \\./\n                               (o o)\n---------------------------oOOo-(_)-oOOo--------------------------\n Windows XP Professional 32-bit en-US - Black Edition v2011.11.10\n------------------------------------------------------------------\n        For bug reports and questions go to http://www.zone54.com\n==================================================================\n\n\n[#] INFOS (READ THIS).\n------------------------------------------------------------------\n\n(o) General Infos:\n\n* Unattended Installation with Prompt repair option.\n* Valid WGA CD-Key already inserted and no Windows XP Activation needed and a WGA crack will be also installed.\n* Includes all official and some unofficial Windows XP Service Pack 3 Updates till 8.11.2011.\n* Over 200 MB integrated drivers for SATA/ACHI, LAN, WLAN and Monitors.\n* A lot of Windows XP settings have been already set and will be also set for new created Windows XP accounts.\n* Booting and Running a little bit faster then normal, because some worthless Windows XP files and Programs are removed and all Windows XP Updates have been slipstreamed.\n* After the Windows XP Installation you can choose if the Preconfigured Windows XP Settings and the Extra Programs should be implemented to, if nothing has been chosen in 60 seconds then the option Yes will be automatically selected.\n\n(o) Important Infos:\n\n* This Windows XP is not for Upgrading you must make a clean installation on a formatted Hard disk drive or Partition.\n* It is possible to add Extra Programs and Custom Settings by editing the files in the directory &quot;(source)\\OEM\\RunOnce&quot; and the file &quot;WINNT.SIF&quot; in the directory &quot;(source)\\I386&quot;. To do this you need to use a ISO Editor and all files should be opened with a text editor like Notepad.\n* If you are installation this Windows XP on multiple Computers and want the installation process to run full automatically. Then use an ISO Editor program and replace the file &quot;WINNT.SIF&quot; in the &quot;(source)\\OEM&quot; folder with the one that is in the &quot;(source)\\I386&quot; folder. If you now Boot from the Disc then your main Hard disk drive will be formatted and a new partition will be create and Windows XP will be automatically installed on this partition. Note that replacing the &quot;WINNT.SIF&quot; file will disable the Recovery Console and Repair Option that noramly can be run from the Disc.\n* If the Windows XP installation hangs or you get a Blue Screen error during the Windows XP installation then this is probably because due to a SATA driver problem. To fix this problem you should do the steps under &quot;Infos on how to Remove the included Drivers and include your own Drivers&quot;. If you get a Blue Screen error then you can use also a workaround for this by going into your BIOS and turn off the option SATA/ACHI or change the SATA mode to IDE. This should normally fix the Blue Screen error, But with this workaround you will loss +/- 15% of your Hard disk speed.\n\n(o) Infos for Newbies:\n\n* Minimum Computer Requirements ia a &quot;600 MHz Processor&quot; with a &quot;256 MB RAM&quot; and &quot;4 GB Hard disk drive&quot; and a &quot;Super VGA (800x600) Video Adapter&quot;.\n* If you miss some standard Windows XP programs then open the Favorites folder of Windows XP and you will find alternative links to better programs. Some standard Windows XP programs are removed because they outdated for example the free Microsoft Outlook Express that has been replaced years ago with the free Windows Live Mail program by Microsoft.\n* If you want to change the Windows XP CD-Key after Windows XP was installed then use the Tool &quot;Keyfinder (Key Changer) v1.51.exe&quot; that you can find on the Burned Optical Disc and in the ISO file. You can also change the Windows XP Owner and Company with this Tool also.\n* If you get a malware warning about the files &quot;Keyfinder (Key Changer) v1.51.exe&quot; and &quot;Windows Genuine Advantage Crack for v1.9.0042.0.exe&quot;, this is normal because almost all Anti-Virus Programs are detecting Key Changers and Cracks as malware.\n* If you have a question or a problem then visit the Website &quot;www.zone54.com&quot;, but first make sure that you can't find the solution for your problem in 10 minutes over a Web Search Engine or over the forum search engine at &quot;www.msfn.org&quot;.\n\n\n[#] INTEGRATED APPLICATIONS AND MORE.\n------------------------------------------------------------------\n\n(o) Extras:\n\n* 7 new Windows XP Themes: (ChaNinja Style RC5 v1.0), (Luna Element Black v5.1 + CSS), (Windows 7 Colors v1.0), (Disney - It's a Magical World v1.0), (BlackMesa v1.1), (NeoGeniX LS v1.0), (Royale Remixed v1.47).\n* 3 new visualizations for Windows Media Player 11: (Energy bliss), (Rhythm Waves) and (Pic Viz II).\n* A lot of new Web Links added in the Windows XP Favorites folder.\n* Windows XP Key Changer (Keyfinder v1.51) and a text file with working WGA Keys.\n\n(o) Patches:\n\n* TCP/IP Patch: Allows you to have 16777214 (Max) Half-Open TCP Connections instead of 10.\n* Uxtheme Patch: Allows you to use un-signed Custom visual styles.\n* SFC Patch: Allows you to disable and enable Windows File Protection with a registry key.\n* RAID-5 Patch: This will enable Software RAID-5 Support.\n\n(o) Tweaks:\n\n* Suppressing Microsoft Update nagging to install Windows Genuine Advantage Notifications v1.9.40.0 (KB905474).\n* Suppressing Microsoft Update nagging to install Windows Malicious Software Removal Tool v4.2.5600 (KB890830).\n\n(o) Driver Packs:\n\n* MassStorage v11.09 - Supported Device list at: http://driverpacks.net/driverpacks/windows/xp/x86/mass-storage/11.09\n* LAN v11.09 - Supported Device list at: http://driverpacks.net/driverpacks/windows/xp/x86/lan/11.09\n* WLAN v11.09 - Supported Device list at: http://driverpacks.net/driverpacks/windows/xp/x86/wlan/11.09\n* Monitors v10.05 - Supported Device list at: http://driverpacks.net/driverpacks/windows/xp/x86/monitors/10.05\n\n(o) Windows XP Service Pack 3 Updates:\n\n* Windows XP Service Pack 3 (KB936929).\n* Windows Internet Explorer 8.\n* Windows Media Player 11.\n* Microsoft European Union Expansion Font Update v1.2.\n* Microsoft XML Core Services v4.0 Service Pack 3 (KB973685).\n* Windows XP Root Certificates Update (KB931125) Version October 2011.\n* Windows XP CAPICOM v2102.\n* Microsoft Windows Update Web Control 7.4.7600.229.\n* Microsoft Update Catalog Web Control 7.4.7057.248.\n\n(o) New Microsoft Windows XP Service Pack 3 Applications:\n\n* Windows XP Powertoy - ClearType Tuner v1.01.\n* Windows XP Powertoy - Alt-Tab Replacement v1.0.\n* Windows User Profile Hive Cleanup Service v1.6g.\n* Microsoft BitLocker To Go Reader v1.0 (KB970401).\n* Windows Feature Pack for Storage v1.0 (KB952013).\n* Windows XP exFAT file system driver update package v1.0 (KB955704).\n* Windows XP GDI+ Detection Tool v1 (KB873374).\n* Windows XP QFEcheck v6.2.29.0.\n* Microsoft Windows Browser Choice (KB976002 v5).\n* Windows Genuine Advantage Validation v1.9.42.0 (KB892130) - Cracked Version.\n\n(o) Other Applications:\n\n* 7-Zip v9.20.\n* Open Command Prompt Shell Extension v2.1.0.\n* HashCheck Shell Extension v2.1.11.\n* SumatraPDF v1.8.\n* STDU Viewer v1.6.62.\n* Paint.NET v3.5.10.\n* Virtual CloneDrive v5.4.5.0.\n* Ultracopier v0.2.0.16.\n\n(o) Runtimes:\n\n* Java SE Runtime Environment (JRE) v7 Update 1.\n* Flash Player ActiveX Control v11.0.1.152.\n* Shockwave Player v11.6.3.633.\n* Microsoft Silverlight v4.0.60831.0.\n* Microsoft DirectX v9.29.1962.\n* Microsoft .NET Framework v1.1 SP1, v2.0 SP2, v3.0 SP2, v3.5 SP1, v4 Client, v4 Extended.\n* Microsoft Visual C-family v1, v7, v8, v9, v10, (v2, v3, v4, v5, v6 are already included in Windows XP Service Pack 3).\n* Microsoft Visual Basic v1, v2, v3, v4, v7+, (v5, v6 are already included in Windows XP Service Pack 3).\n\n\n[#] REMOVED WINDOWS XP COMPONENTS.\n------------------------------------------------------------------\n\n* Applications: Address Book, Games, Internet Games, Paint, Pinball.\n* Multimedia: Images and Backgrounds, Movie Maker, Music Samples, Old CDPlayer and Sound Recorder.\n* Network: Communication tools, FrontPage Extensions, Internet Information Services (IIS), MSN Explorer, Netmeeting, Outlook Express, Windows Messenger.\n* Operating System Options: Blaster/Nachi removal tool, Desktop Cleanup Wizard, Out of Box Experience (OOBE), Tour, Zip Folders.\n* Drivers: Display Adapters, IBM ThinkPad, Logitech WingMan, Microsoft SideWinder, Scanners, Serial Pen Tablet, Sony Jog Dial, Toshiba DVD decoder card.\n* Files: clock.avi, swtchbrd.bmp, yahoo.bmp.\n* Folders: &quot;DOCS&quot;, &quot;DOTNETFX&quot;, &quot;SUPPORT&quot;, &quot;VALUEADD&quot;, &quot;I386\\WIN9XMIG&quot;, &quot;I386\\WIN9XUPG&quot;.\n* Nothing has been removed that could cause any System Problems or any Problems with other Software Applications.\n\n\n[#] HELP GUIDES.\n------------------------------------------------------------------\n\n(o) Infos on how to Remove the included Drivers and include you own Drivers:\n\n1. Download the Driver for your SATA Controller that is in your computer and then make a new folder and extract all the files with a Zip Program like 7-Zip into the new folder (If there is no file &quot;txtsetup.oem&quot; in the Zip file that you downloaded then use google to find the SATA Driver that has this file included because this will not work without this file).\n2. Make a new folder on your Hard disk drive and name it &quot;WINXPCD&quot;.\n3. Open the ISO file &quot;Windows XP Professional 32-bit en-US - Black Edition v201X.XX.XX.iso&quot; with a Zip Program like 7-Zip and extract all the files into the folder &quot;WINXPCD&quot;.\n4. If you see a folder &quot;[BOOT]&quot; in the &quot;WINXPCD&quot; folder then delete it.\n5. Now go to the directory &quot;WINXPCD\\OEM&quot; and run the file &quot;DriverPacks BASE - Remover vX.X.cmd&quot;.\n6. Download and install the program nLite from &quot;http://www.nliteos.com/download.html&quot;.\n7. Start the program and click Next and Browse to the folder &quot;WINXPCD&quot; and after the loading is done click two time on Next and then select the option &quot;Drivers&quot; and the option &quot;Bootable ISO only&quot; and then click Next.\n8. Now Click on &quot;Insert&quot; and then choose &quot;Multiple driver folder&quot; and Browse to your folder where your 32-bit SATA Drivers are and then click OK.\n9. Now Select the appropriate driver for Windows XP 32-bit and then click OK and then choose &quot;Textmode driver&quot; and select all options in the Box &quot;Textmode integration options&quot; and then click OK and then click Next and then click Yes and if the integration is finished click Next.\n10. At the Option &quot;Label&quot; write &quot;WinXP_32-bit_BE&quot; or whatever you want (Maximum 16 characters) and then click &quot;Make ISO&quot; and then Browse to the location where you want to save the new Windows XP ISO file and you done.\n* To test if the ISO file with the new integrated SATA/AHCI driver are also working on your Computer you need to install the program VirtualBox from &quot;www.virtualbox.org&quot;. It is important that you set in VirtualBox the Virtual Hard disk to SATA not IDE or the test will be useless.\n* If you have a problem to include your SATA into your Windows XP then visite the MSFN forum at &quot;www.msfn.org/board/index.php&quot; and post the topic about the problem you have. But first make sure that you can't find the solution for your problem in 10 minutes over a Web Search Engine or over forum search engine before posting a new topic in the forum.\n\n(o) Infos on how to install Windows XP from an USB Flash drive:\n\n* First make sure that your Computer (motherboard) is also supporting USB Booting, if you can't find any option like this in your BIOS then your Computer (motherboard) isn't supporting this so an installation of Windows XP from a USB Flash drive will not work.\n1. Make a new folder on your Hard disk drive and name it &quot;WINXPCD&quot;.\n2. Open the ISO file &quot;Windows XP Professional 32-bit en-US - Black Edition v201X.XX.XX.iso&quot; with a Zip Program like 7-Zip and extract all the files into the folder &quot;WINXPCD&quot;.\n3. If you see a folder &quot;[BOOT]&quot; in the &quot;WINXPCD&quot; folder then delete it.\n4. Now download the Program WinToFlash at &quot;www.wintoflash.com/home/en/&quot; and install it.\n5. Start the WinToFlash Program and now the Wizard will help you to do the rest, only but note that the &quot;Windows files path:&quot; is the &quot;WINXPCD&quot; folder you created and the &quot;USB drive:&quot; is the USB Flash drive that is connected to the Computer.\n6. If you done then restart your computer and press the key to enter the &quot;Boot Menu Option&quot; and select the USB device that has the Windows XP on it. If the computer starts and there is no key to enter the &quot;Boot Menu Option&quot; then press the key for the for the &quot;BIOS Settings Menu&quot; and set the Boot Priority for the USB device above the Hard disk drive and then select save and exit.\n* If you have a problem installting Windows XP from an USB Flash drive then visite the WinToFlash forum at &quot;www.wintoflash.com/forum/index.php&quot; and post a topic about your problem. But first make sure that you can't find the solution for your problem over the forum search engine before posting a new topic in the forum.\n\n(o) How to install Windows XP new:\n\n1. BACKUP YOUR FILES FIRST ON A CD/DVD OR TO AN HARDDISK DRIVE and download all the Up-to-Date Drivers that you need for your Computer from the &quot;Chip Cards&quot; manufacturer Websites.\n2. Go to your Mainboard or Computer manufacturer Website and look if there's no a new BIOS update for your Mainboard (You can skip this but it is always better to have an bug free BIOS).\n3. Select in your Burn program the option for Burning an Image file and then select the file &quot;Windows XP Professional 32-bit en-US - Black Edition v201X.XX.XX.iso&quot; and then Burn the Disc at a low speed like 4x to avoid missing file errors if you install the Windows XP. If you need a good Burn Program i recommend the free ImgBurn program at &quot;www.imgburn.com&quot;.\n4. Insert your burned Windows XP Disc in your Optical Disc Drive and then restart your Computer. If your Computer starts you should see the message &quot;Press any Key to boot from the CD.&quot; if you see this then press a random key on your keyboard. If you don't see this message then you need go into your &quot;BIOS Settings Menu&quot; and set the Boot Priority for the Optical Disc drive above the Hard disk drive.\n6. If Windows XP has loaded the drivers then press on your Keyboard the key &quot;ENTER&quot; and then press the key &quot;F8&quot; and then press the key &quot;ESC&quot;.\n7. Now select the Hard disk drive where you want to install Windows XP (Default is &quot;C:&quot;) and then press on your Keyboard the Key &quot;D&quot; and then press the Key &quot;ENTER&quot; and then press the Key &quot;L&quot;.\n8. Now select the same Hard disk drive again (Default is &quot;C:&quot;) and press on your Keyboard the Key &quot;ENTER&quot; and then you should select the option &quot;Format the partition using the NTFS file system (Quick)&quot; and then press the key &quot;ENTER&quot;.\n9. After the Windows XP installation is finished you need to install all the Up-to-Date Drivers for your Computer and then your DONE. :-)\n* If you get corrupted file error(s) or missing file error(s) during your Windows XP installation then you should try this:\n1. Burn the Disc at the lowest possible speed.\n2. Don't use old scratched Discs.\n3. Try to clean your Optical disc drives.\n4. Use another Optical disc drive to install Windows XP.\n5. Try to install Windows XP from a USB Flash drive.\n\n\n\n\n\n\n\n(o) v2011.11.10 Changelog:\n\n* Readded Windows XP Security Center.\n* Added some free games websites in the Windows XP Favorites folder.\n* Updated Shockwave Player from &quot;11.6.1.629&quot; to &quot;v11.6.3.633&quot;.\n* Updated Java SE Runtime Environment (JRE) from &quot;v7&quot; to &quot;v7 Update 1&quot;.\n* Updated Windows XP Root Certificates Update (KB931125) from &quot;Version June 2011&quot; to &quot;Version October 2011&quot;.\n* Updated Tweak &quot;Suppressing Microsoft Update nagging to install Windows Malicious Software Removal Tool (KB890830)&quot; from &quot;4.1.5503&quot; to &quot;v4.2.5600&quot;.\n* Integrated all Windows XP Service Pack 3 Updates form 12.10.2011 till 8.11.2011.","torrent":{"xt":"urn:btih:3097e8b09b5e933c91915e1b3432bb5d9886bea1","amp;dn":"Windows+XP+Professional+32-bit+en-US+-+Black+Edition+v2011.11.10","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3097e8b09b5e933c91915e1b3432bb5d9886bea1","infoHashBuffer":{"type":"Buffer","data":[48,151,232,176,155,94,147,60,145,145,94,27,52,50,187,93,152,134,190,161]},"announce":[],"urlList":[]}}