{"title":"Walking Meditations","uid":7759826,"size":57318742,"categoryP":"applications","categoryS":"ios_(ipad_iphone)","magnet":"?xt=urn:btih:30c751f73e990653f656ab74c272a2c343ec6e66&amp;dn=Walking+Meditations&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1351197363,"description":"Enjoy the benefits of meditation as you walk with the Meditation Oasis Walking Meditations app. Walking meditation can be just as profound as sitting meditation. It brings the meditative experience into daily activity.\n\nWalking meditation is perfect for those who have trouble sitting still to meditate. For those who enjoy sitting meditations, walking meditation brings a new dimension, helping to bring meditation into every moment of the day.\n\nOur approach to walking meditation is easy and informal. These meditations gently guide you to experience your body and your surroundings fully as you walk, letting go of the mind's preoccupation with naming, analyzing and evaluating what's going on. Letting go of thoughts about the past and future allows you to experience the present moment more fully.\n\nTHE APP CONTAINS:\n\nâœ“ THREE WALKING MEDITATIONS, each with a different emphasis\n\nâœ“ TIPS on how to get the most out of your walking meditation\n\nâœ“ DIARY PAGE - for those who want to keep notes on insights and experiences\n\n---------\n\nEach walking meditation has a different focus:\n\nâ˜… BEING FULLY PRESENT â˜… Guided Walking Meditation (16 min)\n\nThis meditation helps you to be fully present to all of the experiences you have while walking -- what you experience within yourself and in the world around you.\n\nâ˜… ENLIVENING THE BODY â˜… Guided Walking Meditation (17 min)\n\nThis meditation focuses on the experience of the body while walking. It enlivens the body, strengthens the mind-body connection and is both calming and grounding.\n\nâ˜… ENHANCING THE SENSES â˜… Guided Walking Meditation (18 min)\n\nThis meditation focuses on what you see, hear, smell and feel through the sense of touch as you walk. It enhances your experience of life by enhancing your perception.\n\n---------\n\nCREATED BY MARY MADDUX, MS, HTP and RICHARD MADDUX, best known for their popular Meditation Oasis podcast, smartphone apps and CDs.\n\nMary and Richard bring over 30 years of meditation practice and teaching to the creation of their guided meditations and music. In addition to teaching meditation, Mary has worked in both conventional and alternative settings as a counselor and healing arts practitioner. Richard has played and composed music all of his life. His music is composed especially for meditation, relaxation and healing.","torrent":{"xt":"urn:btih:30c751f73e990653f656ab74c272a2c343ec6e66","amp;dn":"Walking+Meditations","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30c751f73e990653f656ab74c272a2c343ec6e66","infoHashBuffer":{"type":"Buffer","data":[48,199,81,247,62,153,6,83,246,86,171,116,194,114,162,195,67,236,110,102]},"announce":[],"urlList":[]}}