{"title":"FlightPanel By bobiras2009","uid":7658886,"size":661355,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:30fd78c5d622a69624f24c6e16dfbd8e64a894e9&amp;dn=FlightPanel+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1348249768,"description":"Follow my uploads here:                            &lt;a href=&quot;\nhttps://forum.suprbay.org/member.php?action=profile&amp;uid=311481&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/member.php?action=profile&amp;uid=311481&lt;/a&gt;    \n\nYou can make requests here:                             &lt;a href=&quot;\nhttps://forum.suprbay.org/forumdisplay.php?fid=4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/forumdisplay.php?fid=4&lt;/a&gt;\n                 \n\n                                By bobiras2009\t\t\n\n\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\nFlightPanel shows working aircraft cockpit gauges using the phone's sensors.\n\nFlightPanel recreates functional airplane cockpit gauges using the phone's built-in GPS, accelerometer, magnetic compass, clock, and battery info.\n\nIt's a fun way to show off your phone, especially if you're an aviation enthusiast, but it is not FAA rated nor meant to replace actual avionics. Phone sensors work on completely different principles!\n\nFlightPanel is only as accurate as your phone's sensors. Many of the gauges in FlightPanel require a clear GPS signal to work properly. Slow or noisy GPS updates, magnetic compass calibration issues, etc. are problems or limitations with your PHONE'S HARDWARE, not the APP.\n\nThe app works on almost all devices, but there are MANY different hardware devices and some work better than others.\n\nPlease do not use comments / ratings to report bugs. We cannot contact or help you that way. Send us an email and we'll do our best to help you.\n\nIf you are unsatisfied, you can get an instant automatic refund from the Android Market within 15 minutes. Or you can send us an email telling us why and we'll give you a refund.\n\nEasy technical support email built into the app... just select Menu-&gt;Help-&gt;Get Help by Email\n\n\nThe INOP tags are a new feature which shows gauges that are not (yet) functioning because there is missing or uncalibrated hardware (in the case of the magnetic compass or artificial horizon), or because the GPS is turned off, or has not sent any position data for an extended period of time.\n\nThe INOP tags should automatically disappear after calibration or once data arrives from the GPS and the gauges start updating real data. These INOP tags can be hidden via preferences.\n\n                                By bobiras2009\t\t","torrent":{"xt":"urn:btih:30fd78c5d622a69624f24c6e16dfbd8e64a894e9","amp;dn":"FlightPanel+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30fd78c5d622a69624f24c6e16dfbd8e64a894e9","infoHashBuffer":{"type":"Buffer","data":[48,253,120,197,214,34,166,150,36,242,76,110,22,223,189,142,100,168,148,233]},"announce":[],"urlList":[]}}