{"title":"Melissa Manning Sweater Stretcher","uid":7788061,"size":255104975,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:321ad42a93f01b525980a4b4d02b9eedbed38aa0&amp;dn=Melissa+Manning+Sweater+Stretcher&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"Sandor1957","files":1,"time":1351950708,"description":"Melissa Manning said she hadn't noticed that her big boobs had grown even bigger since the last time she visited SCORELAND but the staff caught that phenomenon immediately. The May '12 V-mag covergirl and July '12 SCORE covergirl is more boobalicious than ever. We have the same kind of fanatic attention to detail that UFO investigators have except we focus on tits not flying saucers (unless they are shaped like boobs). V-mag editor spotted the change the second she saw Melissa. So Maria decided to have Melissa measured by our make-up stylist in the models' dressing room (on video in the BTS Behind The Scenes section). Absolute scientific accuracy was the goal. Melissa fessed up and said she hadn't been measured since she was 15 and her approach to bra buying was hit or miss. She'd try on different sizes and brands picking them out by eye and see what fit her wonderful hooters. The end result? Melissa thought she was a 34G but she is really a 36H-cup. The tape never fails. Melissa admits that she tries not to buy bras too often but now, armed with this new data, Melissa can march confidently into that bra shop or the ladies underwear section of her favorite department store. Check out this top-heavy sweater stretching video made shortly after Melissa's measuring. \n\nScreens:","torrent":{"xt":"urn:btih:321ad42a93f01b525980a4b4d02b9eedbed38aa0","amp;dn":"Melissa+Manning+Sweater+Stretcher","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"321ad42a93f01b525980a4b4d02b9eedbed38aa0","infoHashBuffer":{"type":"Buffer","data":[50,26,212,42,147,240,27,82,89,128,164,180,208,43,158,237,190,211,138,160]},"announce":[],"urlList":[]}}