{"title":"Jimmy Neutron Boy Genius [PC]","uid":7653988,"size":140384256,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:321c24a5226aa2d7f15cf7f0c2d9513651368552&amp;dn=Jimmy+Neutron+Boy+Genius+%5BPC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tywood_101","files":-1,"time":1348104527,"description":"Jimmy Neutron Boy Genius - \n\nThe game is a 3D adventure starring Jimmy Neutron and his robotic canine Goddard. In the game, the evil King Goobot has abducted Jimmy's parents and friends, so Neutron must begin an intergalactic quest to save them. While progressing through various locales inspired by the movie, players need to solve puzzles using an assortment of gadgets.\n\nPlayed from a traditional third-person perspective, you can also get jimmy neutron from blockbuster video games and game traders the game consists of five distinct regions linked together by a main hub. Once players decide on a region, they can enter a portal and then be whisked away to a 3D world. Among the environments players explore are Jimmy's House, an Asteroid Surface, an Asteroid Interior, Yolkus Prime, and Retroland Amusement Park. Each region spans multiple levels, with the goal in each being to find a number of key items and special prizes and a shrunken head. A secondary goal in some levels is to locate friends Carl Wheezer, Cindy Vortex, Rose, Nissa, and Zachary.\n\nEnemies trying to prevent Jimmy from succeeding include giant ants and the blob-like Yokians, with villains Ooblar, Poultra, and King Goobot forming the boss encounters. Players can run, jump, kick, and use an assortment of inventions. Health can be replenished by finding slices of blueberry pie, extra lives are awarded for every ten neutrons found, and weapons include the Shrink Ray, Inflato Ray, and the Jimmy Bat. Three types of vehicles can also be used to traverse the levels, the Goddard Pogo, the Goddard Sled, and the Goddard Scooter.\n\nThis was one of my favorite games also when I was a kid and I really felt the need to share it with you guys. It works excellently (if there's any problems, let me know and I am sorry. There shouldn't be!)\nEnjoy and please seed for the rest of the world to enjoy!! :D","torrent":{"xt":"urn:btih:321c24a5226aa2d7f15cf7f0c2d9513651368552","amp;dn":"Jimmy+Neutron+Boy+Genius+%5BPC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"321c24a5226aa2d7f15cf7f0c2d9513651368552","infoHashBuffer":{"type":"Buffer","data":[50,28,36,165,34,106,162,215,241,92,247,240,194,217,81,54,81,54,133,82]},"announce":[],"urlList":[]}}