{"title":"RAM Manager Pro v4.0.1 Final By bobiras2009","uid":7614306,"size":143853,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:3305d90d88068d82daa2560209fa824de4047c68&amp;dn=RAM+Manager+Pro+v4.0.1+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1347159009,"description":"For make Requests go here: https://forum.suprbay.org/showthread.php?tid=129845\n\nI will not upload requests that post in the comments in my torrents.           \n                 \n\n                                By bobiras2009\t\t\n\n\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\n\n This application optimizes the RAM of all android devices and gives you better performance. We tested and we're still testing the best RAM balance which makes your system as fast as possible. This application improves perfomance of your device in all directions.\n\nROOT IS REQUIRED!!!\n\nSwitching between applications is very fast, your system will be smoother then ever before. You can fully use your multitasking and you still have as much memory as you need.\n\nFeatures:\n\n    Balance - Option which makes your RAM to the best optimization, this option is for everyday using. Use this option when you want to have fast phone without lags.\n    Balance (More free memory) - This option is nearly the same as Balance, but this option should be advantageous for users who have more RAM than 512 MB. This option gives you more free memory but a bit reduces multitasking.\n    Balance (More multitasking) - This option is nearly the same as Balance, but this option should be advantageous for users who have less RAM than 512 MB. This option gives you more multitasking, but a bit reduces free memory.\n    Hard Gaming - Option which stabilizes your RAM for playing hardest games. Use this option for games which lag on your phone. Your games will run smooth without lags.\n    Hard Gaming (Less aggressive) - This option is similar to Hard Gaming but should be better for devices with RAM lesser than 512MB.\n    Hard Multitasking - Option for users which are really hard working on their phones. You can have a lot of running apps and quickly switch between them without lags.\n    Default (Samsung) - Default settings by Samsung, these settings are also used by LG, HTC, etc.\n    Default (Nexus S) - Default settings which are used by all Google devices.\n    Default - This option reverts your RAM to your default settings, which you had before you installed this app.\n\nWhat's in this version : (Updated : Sep 81, 2012)\n\n    Added czech language\n    Added new memory graph\n\nRequired Android O/S : 2.1+\n\n\n                                By bobiras2009\t\t","torrent":{"xt":"urn:btih:3305d90d88068d82daa2560209fa824de4047c68","amp;dn":"RAM+Manager+Pro+v4.0.1+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3305d90d88068d82daa2560209fa824de4047c68","infoHashBuffer":{"type":"Buffer","data":[51,5,217,13,136,6,141,130,218,162,86,2,9,250,130,77,228,4,124,104]},"announce":[],"urlList":[]}}