{"title":"How Obama won the re-election.pdf","uid":7804785,"size":830918,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:341bfe6551e206d4b4f54fce7de39992fd976523&amp;dn=How+Obama+won+the+re-election.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"hatepig","files":-1,"time":1352373006,"description":"OBAMA got much of his vote from people on welfare and food stamps, (44Million)he got votes from those who voted strictly for COLOR nothing more. They have no clue about the defecit or having a 401K or whether Obama plays golf or not.\n\n All they know is he told them MITT was a wealthy white man and they do not like wealthy white people. They seem them as the enemy and they voted for OBAMA. Their I said it! They do not realize that 65% of GM workers are OUT of the USA. They do not know that Obama when he SEIZED Chrysler put 200,000 people out of work \n\n\nclosing dealerships. They do not see how he SEIZED the health care system only that they think they will have FREE Obamacare and they do NOT REALIZE it is NOT FREE!!!!They still think they have FREE obamacare to this day!!!\n\n\n\nThey do not see him cutting the military in half is a problem-DUH the majority do not see anything or REALLY think about the LONG FOCUS of the things he has done. THE UN treaty that will CONTROL what we do or see on the INTERNET that treaty is being signed in DECEMBER by OBAMA &amp; HILLARY. These are not things that had not one once of thinking on their part in their vote!!!!!!!!!!!!\n","torrent":{"xt":"urn:btih:341bfe6551e206d4b4f54fce7de39992fd976523","amp;dn":"How+Obama+won+the+re-election.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"341bfe6551e206d4b4f54fce7de39992fd976523","infoHashBuffer":{"type":"Buffer","data":[52,27,254,101,81,226,6,212,180,245,79,206,125,227,153,146,253,151,101,35]},"announce":[],"urlList":[]}}