{"title":"POtHS - Super Natural Realms - UFOs Angels Spirits Witches and D","uid":7755912,"size":6244532416,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3497f795a93c1b181b60d44efdb6ffcfda5c4a54&amp;dn=POtHS+-+Super+Natural+Realms+-+UFOs+Angels+Spirits+Witches+and+D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":117,"time":1351099211,"description":"POtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - Super Natural Realms - UFOs Angels Spirits Witches and Demons Vol 31 - The URZI UFO Case 2010 - Hidden Truth Alien Agenda\n\n\n\n\nPOtHS says: Yahweh the Creator needs NO SPACESHIP or Mechanical device to do what He does. There are 2 types of inter-dimensional travelers. Yahweh, Jesus, The Holy Spirit obviously and the unfallen (HEAVENLY) angels that require nothing mechanical to dimension travel, however, The Fallen Angels seem to have lost some of their power and need artificial means to manipulate the different dimensions. EVERYTHING coming in a spaceship is of Satan not The Holy Yahweh. I am told that there are 11 different dimensions needed for The Creator to do his thing. Passing from one Dimension to the other is a mere thought for the Holy Ones. \n\nDescription:\n\nThe URZI UFO Case 2010:\n--------------------------------------------------------------\n\nETs UFOs and the New Technology by Schneider, 1995:\nThis guy killed 'grey aliens.' An account of 'alien' technologies and the reality of underground bases controlled by demonic forces.  \ntruthseekertimes.ca\n--------------------------------------------------------------\n\nContacts from Beyond Earth and Future Agendas:\nGuy Malone interviewed on Future Quake.  \n--------------------------------------------------------------\n\nDemonic Alien Agenda:\nWhat does the Bible say about UFOs, aliens, alien abductions? Are &quot;aliens&quot; demons in disguise attempting to decieve the world into believing they are our creators and saviors? &quot;Aliens&quot; are giving messesges to their human contactees that are anti-biblical, deny Christ and his work on the cross. Sounds like a demonic agenda.\n--------------------------------------------------------------\n\nThe Nephilim Agenda - Randy DeMain on Up Front in The Prophetic:\nAncient mysteries of the Bible are unfolding with startling clarity. One such mystery is the Genesis Six account of giants on the earth. \n--------------------------------------------------------------\n\nThe Coming UFO Hoax by Bill Cooper:\nCould Jesus Christ be coming back very soon? The cards are on the table, The game is being played, But its up to you to educate yourselves. Go, dont take my word for it! RESEARCH,RESEARCH,RESEARCH.\n--------------------------------------------------------------\n\nUFO Crash Con  New UFO Crash Retrieval - Linda Moulton Howe LIVE:\n\n--------------------------------------------------------------\n\nUFO Propaganda to bring us into a New World Order:\nOver the past 60 years we have been bombarded with hints that we have been or are being visited by aliens and many many UFO's but now it seems many think that this is a carefully planned false flag attack to bring the world under one control system by means of an outside threat, then the people will allow their freedom to be take away to keep then safe. 2012? time will tell...\n--------------------------------------------------------------\n\nUFOs and the National Security State with Richard Dolan LIVE:\nThe 6th Annual X-Conference, held in 2010, at the National Press Club,\n-------------------------------------------------------------\n\nUFOs Angels and God III - The Hidden Truth Demons devils Fallen Angels:\nAre UFO's real? The evidence would say yes. What are they? And where do they come from?\n\n\n\nPreparation for Alien UFO Deception in High Gear:\nThis 4 part presentation includes the following topics as discussed by Dr. Scott Johnson.\n\n- Vatican Preparing 1.1 Billion Followers For Alien Deception\n\n\n\n--------------------------------------------------------------\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nThese Torrents are currently on a Free Leech --  High Speed Server\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\n      \n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n","torrent":{"xt":"urn:btih:3497f795a93c1b181b60d44efdb6ffcfda5c4a54","amp;dn":"POtHS+-+Super+Natural+Realms+-+UFOs+Angels+Spirits+Witches+and+D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3497f795a93c1b181b60d44efdb6ffcfda5c4a54","infoHashBuffer":{"type":"Buffer","data":[52,151,247,149,169,60,27,24,27,96,212,78,253,182,255,207,218,92,74,84]},"announce":[],"urlList":[]}}