{"title":"Kung Fu Panda(2008)DVDRip.AC3(ENG)-DROCK(Fixed in sync)","uid":7617759,"size":732620006,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3549cf0e47ed8f9c8a6507bd6cbffb148869923b&amp;dn=Kung+Fu+Panda%282008%29DVDRip.AC3%28ENG%29-DROCK%28Fixed+in+sync%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":1,"time":1347248699,"description":"Don't download the other Kung Fu Panda by me, because it's out of sync. I re-ripped this one, it's all good in the hood.(as the ghetto Mr. Rogers would say.)\n\nA clumsy panda bear becomes an unlikely kung fu hero when a treacherous enemy spreads chaos throughout the countryside in this animated martial arts adventure featuring the voices of Jack Black, Dustin Hoffman, Angelina Jolie, and Jackie Chan. On the surface, Po (voice of Black) may look like just another portly panda bear, but beneath his fur he bears the mark of the chosen one. By day, Po works faithfully in his family's noodle shop, but by night he dreams of becoming a true master of the martial arts. Now an ancient prophecy has come to pass, and Po realizes that he is the only one who can save his people from certain destruction. With time running short and malevolent snow leopard Tai Lung (Ian McShane ) closing in, Furious Five legends Tigress (Jolie), Crane (David Cross ), Mantis (Seth Rogen), Viper (Lucy Liu), Monkey (Chan), and their wise sensei, Master Shifu (Hoffman), all draw on their vast knowledge of fighting skills in order to transform a lumbering panda bear into a lethal fighting machine. Now, if the noble Po can master the martial arts and somehow transform his greatest weaknesses into his greatest strengths, he will fulfill his destiny as the hero who saved his people during their darkest hour.\n\nRipped with Handbrake\n\nLength: 1 Hour 30 Minutes\n\nFile Type: MP4\n\nFrame Width: 720\n\nFrame Height: 304\n\nFrame Rate: 29fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:3549cf0e47ed8f9c8a6507bd6cbffb148869923b","amp;dn":"Kung+Fu+Panda%282008%29DVDRip.AC3%28ENG%29-DROCK%28Fixed+in+sync%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3549cf0e47ed8f9c8a6507bd6cbffb148869923b","infoHashBuffer":{"type":"Buffer","data":[53,73,207,14,71,237,143,156,138,101,7,189,108,191,251,20,136,105,146,59]},"announce":[],"urlList":[]}}