{"title":"All My M0vies v2.4.2 Final By bobiras2009","uid":7640126,"size":607874,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:35f42bb76a78a683bba2d4e9058950eccd4a0ddc&amp;dn=All+My+M0vies+v2.4.2+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1347755209,"description":"Follow my uploads here:                             &lt;a href=&quot;\nhttps://forum.suprbay.org/member.php?action=profile&amp;uid=311481&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/member.php?action=profile&amp;uid=311481&lt;/a&gt;    \n\nYou can make requests here:                              &lt;a href=&quot;\nhttps://forum.suprbay.org/forumdisplay.php?fid=4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/forumdisplay.php?fid=4&lt;/a&gt;\n                 \n\n                                By bobiras2009\t\t\n\n\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\nDo you own a lot of movies? Do you have trouble keeping track of all your movies?\nAll My Movies for Android allows you to catalog your entire movie collection with a few taps.\nImportant Notice! This application is for managing a movie collection. Is not possible download or watch\n\nThe title search using archive supplied by TMDb. themoviedb.org (Tmdb) is a free and open movie database. It is completely open and is led by people like you. And 'now used by millions of people every month, is also used by the centers of the world's most popular media. This application interacts with this database to retrieve information about the movie. We invite you to collaborate http://www.themoviedb.org . In seconds you can add any information relevant to a movie.\n\nYou can evaluate the application by downloading All My Movies Free for Android. Is an identical version, available for free, but limited to 30 titles. Free version contains Ads.\nWith All My Movies for Android you can keep track of movies you have, you have owned or lent or movies you wish to buy, than those already seen, or you want to see. Never again will you have to buy or rent a movie twice.\n\nFeatures:\n\n    Add movie by title search or barcode search.\n    Add movie by cast member search.\n    Manage different categories (Owned, wished...).\n    Customize with location, notes, evaluation and more.\n    View details with synopsis, full cast list, and much more.\n    Display the poster magnified high definition.\n    Link to IMDB site, or if owned directly interacts with IMDB application.\n    Link to TMDB site.\n    Link to WIKIPEDIA site in cast management.\n    Watch trailers.\n    Loan titles to your friends and keep track. You can also select from the contacts. With a few taps you can call or send a text message or an email to your contact to remind him to give back the movie. And plus you can also put a reminder on your calendar. The application will remember your loaned\n    Quick search of your movies and other sort.\n    Integration with social networking applications on your device (Twitter, Facebook, Google + etc.).\n    Shake to random select based on the filters applied.\n    Create backups of your movie collection or restore previous backups.\n    Management of the cast with photos, biography and filmography. \n    Section with released recently and recommended\n    The application is optimized for phones but not for tablet.\n\nWhat's in this version : (Updated : Sep 14, 2012)\n\n    Improved movies search using the barcode scanning functionality\n\nRequired Android O/S : 2.2+\n\n\n\n                                By bobiras2009\t\t\n","torrent":{"xt":"urn:btih:35f42bb76a78a683bba2d4e9058950eccd4a0ddc","amp;dn":"All+My+M0vies+v2.4.2+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35f42bb76a78a683bba2d4e9058950eccd4a0ddc","infoHashBuffer":{"type":"Buffer","data":[53,244,43,183,106,120,166,131,187,162,212,233,5,137,80,236,205,74,13,220]},"announce":[],"urlList":[]}}