{"title":"Orcs.Must.Die!.V.1.0r8.with.4 DLC","uid":6806414,"size":1538826240,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:360a8c6f53a0fd6a57869adacc3a1dba20a469e7&amp;dn=Orcs.Must.Die%21.V.1.0r8.with.4+DLC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"astriguza","files":1,"time":1320878975,"description":"Orcs.Must.Die!.V.1.0r8.with.4 DLC\n\nRELEASE NOTES\n\nSlice them, burn them, skewer them, and launch them - no matter how you\nget it done, orcs must die in this fantasy action-strategy game from\nRobot Entertainment.\n\nAs a powerful War Mage with dozens of deadly weapons, spells, and traps\nat your fingertips, defend twenty-four fortresses from a rampaging mob\nof beastly enemies, including ogres, hellbats, and of course, a whole\nbunch of ugly orcs. Battle your enemies through a story-based campaign\nacross multiple difficulty levels, including brutal Nightmare mode\n\nWill you roast orcs in pits of lava, pound them flat with a ceiling\ntrap, or freeze and shatter them with a slash? No matter the weapons\nand traps you choose, you're sure to have an orc-killing blast\n\nFeatures:\n\n24 Fortresses to Defend - Twisting passages, tall towers, and wide-open\nchambers all need a war mage to protect them\n\n6 Orc-Killing Weapons and Spells - From crossbow and bladestaff to the\nmagical power of the elements\n\n19 Deadly Traps and Fierce Minions - Choose from a wide variety of\ntraps including arrow walls, spike traps, spinning blades, and flaming\nbrimstone or call in allies to assist you in the destruction of the orc\nhorde\n\n11 Unique Enemies - Including ogres, flying hellbats, and of course, a\nwhole bunch of ugly orcs\n\nStory-based Campaign - Fend off orcs across three acts to discover the\nmysterious power behind their relentless assaults\n\nPersistent Upgrades - Unlock improved traps as you progress through the\ncampaign\n\nExtensive Replayability - Nightmare Mode and a skull ranking system\nprovide extended play\n\nScoring System and Leaderboard - Compete with your friends for the\ntitle of Best Orc Killer\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Play the game\n5. Support the companies, which software you actually enjoy\n","torrent":{"xt":"urn:btih:360a8c6f53a0fd6a57869adacc3a1dba20a469e7","amp;dn":"Orcs.Must.Die%21.V.1.0r8.with.4+DLC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"360a8c6f53a0fd6a57869adacc3a1dba20a469e7","infoHashBuffer":{"type":"Buffer","data":[54,10,140,111,83,160,253,106,87,134,154,218,204,58,29,186,32,164,105,231]},"announce":[],"urlList":[]}}