{"title":"20120920-Stossel-[Union Power].Fox Business.CF.avi","uid":7663336,"size":342079700,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:363cbe331da0a31f479cbc07201773e5c882fd51&amp;dn=20120920-Stossel-%5BUnion+Power%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"skJGZV6z","files":-1,"time":1348365949,"description":"----------\n\nSTOSSEL - [Union Power] - Fox Business Network\n2012, September 20, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n[note: I have only ever received the SD version of FBN from my cable provider, as you may have guessed from the quality. \n\nStarting with this episode, to better unify the presentation of HD and SD feeds, FBN has adopted a new widescreen aspect and new graphics for the SD feed. This also means that it's now letterboxed for 4:3 aspect SDTVs. I've cropped off this letterboxing and the blank overscan areas at the sides, but since it's still the same SD source, this only means that while you'll now enjoy a 16:9 aspect ratio, the vertical resolution is reduced by 24%.\n\n624x364 pixel frame size, interlacing (removed) means high-motion areas achieve an effective vertical resolution half this, or just 182 pixels (down from 240 px effective with the prior 4:3 SD version, which had been equivalent to old VHS).\n\nFor a higher quality stream, I would need access to an HD feed (and also HD capture equipment, which I don't have in any case).\n\nSo, please enjoy as best you're able!]\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nA few things I heard at a rally of 10,000 union members in Philadelphia last month: Workers should have a &quot;Second Bill of Rights&quot;...people told me that everyone is entitled to a &quot;living wage&quot;... We (not our employers) own our jobs... &quot;Slackers&quot; should be helped rather than fired.\n\nOn our show this week, my guests and I discuss unions and what they really do for workers.\n\nJohn Tillman of the Illinois Policy Institute talks about the Chicago Teachers' Union strike and what it says about union power.\n\nOur special correspondent Kennedy also went to that union rally in Philadelphia. She got a more hostile reception than I, probably because she tried to get some to sign her &quot;Second Bill of Rights&quot; for business owners.\n\nGeorgia Congressman Phil Gingrey explains that government workers get something called &quot;official time.&quot; This means that you pay... so they can work full-time for their union.\n\nElizabeth and Mallory Factor, authors of the new book Shadowbosses, say unions manipulate government and rob taxpayers.\n\nSteve Malanga the Manhattan Institute points out that union pensions are bankrupting cities and states. But two states reformed their systems for the better- Utah Governor Gary Herbert explains how Utah put itself on a more fiscally responsible course.","torrent":{"xt":"urn:btih:363cbe331da0a31f479cbc07201773e5c882fd51","amp;dn":"20120920-Stossel-%5BUnion+Power%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"363cbe331da0a31f479cbc07201773e5c882fd51","infoHashBuffer":{"type":"Buffer","data":[54,60,190,51,29,160,163,31,71,156,188,7,32,23,115,229,200,130,253,81]},"announce":[],"urlList":[]}}