{"title":"BlacksOnBlondes - Kagney Linn Karter.wmv","uid":6820611,"size":669867505,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:3682051490083923742fbebf7c2d44d475aa04cf&amp;dn=BlacksOnBlondes+-+Kagney+Linn+Karter.wmv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"FluxXxu","files":1,"time":1321373785,"description":"BlacksOnBlondes - Kagney Linn Karter.wmv\n\nDescripion:\nKagney Linn Karter is a self-proclamied, &quot;black cock slut.&quot; This week, she's gonna put that to the test by getting fucked by the biggest black cock around:Mandingo. Kagney Linn Karter tits are temporariliy hidden by an outfit that's holding tightly against her curvy body. It's not too long before we get a glimpse of Kagney's rockin' body , and she's not share about showing it off. Kagney doesn't hold back as she loses her mind at the sight of Mandingo's big, black cock. How much is Kagney Linn Karter into interracial sex? Well, Kagney not only sucks on the first 5 inches of Mandingo's black cock; she licks the sides and gives his silver dollar coin purse plenty of attention. The lipstick slowly running off her lips and onto his meaty pole is just the start of this interracial sexcapade. Kagney's pussy gets progressively wetter as her mouth gets increasingly larger by the massive black tree trunk stuffing her face and windpipe. The only break her lungs get is when Kagney Linn Karter takes her time as she glides and slides Mandingo into her sensitive snatch. Kagney has to avoid getting permanently disfigured by Mandingo's black nuclear warhead. Mandingo feels her up as he slowly, but surely, gets as much of his gigantic black cock deep inside parts of her body no white cock has ever been able to reach. Mandingo bends her over and, with her fat tits nearly reaching the floor, pounds the life out of her white pussy as her screams nearly cause the neighbors to dial 9-1-1. It didn't matter if Mandingo hits that pussy from front, behind or from across the street. The constant and nonstop pulverizing of Kagney Linn Karter continues until Mandingo's black coconuts can't hold back the flood of black jizz they inevitably unleash. Kagney Linn Karter's body, esecially her face and great tits, look as if they went through a hurricane of black jizz. Then again, Mandingo is a phenom when it comes to delivering the black cock to horny white bitches.\n\nTags: Sex, Interracial, Hot, xXx\n\nScreens:\n &lt;a href=&quot;\nhttp://www.starpix.us/show.php/8466_1.jpg.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.starpix.us/show.php/8466_1.jpg.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.starpix.us/show.php/8465_2.jpg.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.starpix.us/show.php/8465_2.jpg.html&lt;/a&gt;","torrent":{"xt":"urn:btih:3682051490083923742fbebf7c2d44d475aa04cf","amp;dn":"BlacksOnBlondes+-+Kagney+Linn+Karter.wmv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3682051490083923742fbebf7c2d44d475aa04cf","infoHashBuffer":{"type":"Buffer","data":[54,130,5,20,144,8,57,35,116,47,190,191,124,45,68,212,117,170,4,207]},"announce":[],"urlList":[]}}