{"title":"The Ed Show 10-9-12.mp4","uid":7718790,"size":184584452,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:37f36e15cc8e6876fbf894e358a4c234b4b4b0ad&amp;dn=The+Ed+Show+10-9-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1350009946,"description":"The Ed Show; October 9, 2012.\n\nThe presidential candidates have descended into Ohio, a vital state especially for Mitt Romney. If Romney loses that state, he will have to win six of the remaining seven swing states. NBC's Peter Alexander reports.\n\nOn the last day for voter registration in Ohio, Florida and 15 other states, President Obama pounded the stump, the Romney lie tour continued and the polls tightened.\n\nEugene Robinson (MSNBC Analyst, Associate Editor and Pulitzer Prizewinning Columnist for the Washington Post), and Joan Walsh (Salon's Editor at Large, and author of &quot;What's The Matter With White People? Why We Long For A Golden Age That Never Was&quot;), joined Ed to review the state of the race.\n\nYoung voters could be the key to victory in Florida for President Obama.  Annette Taddeo (of the Miami-Dade Democratic Party) joined Ed to discuss the youth vote and enthusiasm leading up to the election.\n\nGOP vice presidential nominee Paul Ryan gets honest on gun laws, while the NRA continued to spread lies about the president's policies.  They got truth and analysis from Gov. Brian Schweitzer (D-MT).\n\nThe nuns are back on the bus, kicking off another leg of their anti-poverty tour.  Ed talked with Sister Simone Campbell about that and the presidential campaign.\n\nA billionaire CEO claims he'd be forced to lay off employees if President Obama is re-elected.  And it's not the first time he's tried to influence his employees' votes.\n\nAnd in the Big Finish, the real Romney plan for this country is not the one he laid out in last week's debate.  Ed had commentary on Romney's America.","torrent":{"xt":"urn:btih:37f36e15cc8e6876fbf894e358a4c234b4b4b0ad","amp;dn":"The+Ed+Show+10-9-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37f36e15cc8e6876fbf894e358a4c234b4b4b0ad","infoHashBuffer":{"type":"Buffer","data":[55,243,110,21,204,142,104,118,251,248,148,227,88,164,194,52,180,180,176,173]},"announce":[],"urlList":[]}}