{"title":"Massive Avatar pack Volume#3","uid":7662551,"size":15528550,"categoryP":"other","categoryS":"pictures","magnet":"?xt=urn:btih:3835bba5bb4d237eaa9d56b1760f5cf68ab238fe&amp;dn=Massive+Avatar+pack+Volume%233&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"horrorhound","files":667,"time":1348348789,"description":"\n\nzombiRG presents Massive Avatar pack Volume 3\n\ntech:\nSize:14.8MB\nmixxed formats: pnj jpeg gif\nAvy Total Count:668 Avatars\nAvatars per Folder Cat:\nAbstract: 96 avy's|2.06MB\nEarth: 69 avy's|1.47MB\nMovie:  78 avy's|1.69MB\nMusic: 48 avy's|912KB\nPhotography: 14 avy's|255KB\nSyFy-Fantasy: 248 avy's|5.78MB\nVideo Game: 114 avy's|2.63MB\n\n\nThis is so far the biggest pack I've done, with over 600 avatars within. Most of these are artistic save the video game and syfy packs. The photography only has 14 avy's inside because actual photography avatars are really hard to find, but I did add a few Lightning Photography ones to it. Abstract folder has the more colorful art based ones like my previous pack; just a ton more. Earth Folder has HD avatars from massive scenes of the earth. Movie Folder has tons of movie based ones like the Avengers and Donny Darko. Music Folder is more artistic, it includes headphone avatars, as a general meaning of music. Syfy-Fantasy pack is massive with Creatures,Dragons,Moinsters, and Planets. Video Game pack has a ton of video game based avatars within as well as a few Mario Gif ones. Seed till you bleed and enjoy this massive avatar pack! More coming soon.\n\n\nI've added less screens this time for two reasons; the first being since I have made 7 sub folders I want to cover them all and 2nd I don't want to overload my image host, the other day we had 15,000 views in one day equaling a total of 3gb of bandwidth, in one day. I thank you all for the support and seeds on these uploads and thank you for the help in  setting a new record for zombiRG!\n\n\n\n\n\nCome chat with zombiRG in our chan in IRC on the efnet server at /join #zombiRG\n\n\nA note for TPB I am now adding url's for screens seeing the img coding does not work here. Check Comment Below","torrent":{"xt":"urn:btih:3835bba5bb4d237eaa9d56b1760f5cf68ab238fe","amp;dn":"Massive+Avatar+pack+Volume%233","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3835bba5bb4d237eaa9d56b1760f5cf68ab238fe","infoHashBuffer":{"type":"Buffer","data":[56,53,187,165,187,77,35,126,170,157,86,177,118,15,92,246,138,178,56,254]},"announce":[],"urlList":[]}}