{"title":"The Ed Show 9-12-12.mp4","uid":7632746,"size":165457184,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:389d34a6b6e59ff25ee776d4e141c37cd59ee941&amp;dn=The+Ed+Show+9-12-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1347574166,"description":"The Ed Show; September 12, 2012.\n\n The American consulate in Benghazi, Libya, is under attack and Mitt Romney just can't wait for the facts to slam President Obama.\n\nFour Americans, including U.S. Ambassador Chris Stevens, were killed, but Romney doubles-down. Even some conservatives are shaking their heads.\nEd heard from Spencer Ackerman (Senior Reporter with Wired Magazine on American national security), and Hillary Mann Leverett (Foreign Policy Professor at American University), on the tragic events in Libya. \n\nThen, Ben Smith (editor-in-chief of BuzzFeed), looked at the Romney campaign's desperate move, and the backlash.\n\nDiplomacy has traditionally been a bipartisan effort, but Romney seems to be at a loss.  Rep.Keith Ellison (D-MN) joined Ed to discuss the Romney response.\n\nSome Republicans are jumping to defend Romney's desperate attack on the president. \nThey had a debate that with Michael Medved (nationally syndicated talk show host) and Lawrence Korb (a Senior Fellow at the Center for American Progress and the former Assistant Secretary of Defense under Ronald Reagan.)\n\nWhile the world mourns the death of four American diplomats in Libya, one is being remembered in a very different way. They looked at how online communities are paying tribute to Sean Smith.\n\nAnd new census data shows the income gap between the rich and the rest of us is growing. But it also has some good news when it comes to the number of insured Americans. Ed had all the details.","torrent":{"xt":"urn:btih:389d34a6b6e59ff25ee776d4e141c37cd59ee941","amp;dn":"The+Ed+Show+9-12-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"389d34a6b6e59ff25ee776d4e141c37cd59ee941","infoHashBuffer":{"type":"Buffer","data":[56,157,52,166,182,229,159,242,94,231,118,212,225,65,195,124,213,158,233,65]},"announce":[],"urlList":[]}}