{"title":"The Ed Show 10-2-12.mp4","uid":7692060,"size":186835109,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:38be15fa7e5c262a4048d078d85d1aa258a490c5&amp;dn=The+Ed+Show+10-2-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1349270114,"description":"The Ed Show; October 2, 2012.(Rush)\n\n\nThe first presidential debate is Wednesday night in Denver and Mitt Romney is finally revealing aplan to pay for a $5 trillion tax cut.\n\n&quot;As an option, you could say everybody's going to get up to a $17,000 deduction; and you could use your charitable deduction, your home mortgage deduction, or others - your healthcare deduction, and you can fill that bucket, if you will, that $17,000 bucket that way,&quot; Romney told a Denver TV station last night.   \n\nTuesday Ed (who is live from Denver) breaks down Romney's &quot;bucket&quot; plan with Robert Gibbs, Senior Campaign advisor for President Barack Obama.\n\nDevastating new polls numbers show Mitt Romney's secret video is crushing his campaign.  How aggressive does the president needs to be?  Alex Wagner (Host of MSNBC's NOW with Alex Wagner), and  Richard Wolffe (MSNBC Political Analyst) joined Ed for a preview of Wednesday night's presidential debate.\n\nThe Obama campaign launched a new ad targeting Mitt Romney's investment in China with Bain Capital.  Ed showed the Romney campaign's response and reaction from Sen. Sherrod Brown (D-OH).\n\nMitt Romney's billionaire base is starting to lose their cool. E.J. Dionn (Senior Fellow at The Brookings Institution and Washington Post columnist), explained why billionaires who do so well under Obama can't stand the president\n\nFirst Lady Michelle Obama fired up supporters as voters swarm the polls. We'll bring you the latest on early voting in Ohio.\n\nAnd voters win a major victory in Pennsylvania, but why is Republican voter fraud getting swept under the rug in Colorado?  Ed asked Rick Palacio, Chairman of the Colorado Democratic Party.","torrent":{"xt":"urn:btih:38be15fa7e5c262a4048d078d85d1aa258a490c5","amp;dn":"The+Ed+Show+10-2-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38be15fa7e5c262a4048d078d85d1aa258a490c5","infoHashBuffer":{"type":"Buffer","data":[56,190,21,250,126,92,38,42,64,72,208,120,216,93,26,162,88,164,144,197]},"announce":[],"urlList":[]}}