{"title":"CPD.10-additional complementary-stuff&amp;fix-test2.rar","uid":6816428,"size":1018434836,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:399536d1752234396c146707cbd97157b2c08163&amp;dn=CPD.10-additional+complementary-stuff%26amp%3Bfix-test2.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Tyr3ll","files":1,"time":1321228705,"description":"Torrent content :\n\n1) Cyberlink PowerDirector 10 content pack v1 that was missing in my first torrent for this specific product.\nSpecial thanks to Dobio007 for have letting me know a such information\nanyway.\nThx to Cyberlink support also and more especialy to certain very helpfull guys\nwho try to help a bit to this topic.\n\nThe content pack included in my first torrent was supposed combined content pack v1 and v2 all in one together in a single archieve.\nAfter verification it does not seem exactly true.\nLook's like it is the content pack v2 only,no more.\nThis content pack v1 is crucial otherwise you might encountering several possible troubles as well anyway in certains cases or circonstances while using powerdirector 10 in full job.\nThis time i really hope it will resolve all problems so.\n\n2)True Romance pack which last one is an optional additional complementary\npack for much fun but not crucial anyway.\n\nYou will have now all necessary files for the complete retail for Cyberlink\nPowerDirector 10.\nI cannot do better anyway.\nAs you can see it is again a consequent torrent near 1 Gb again:\nThat means the full retail have a full size of approximaly 2,70-2,75 Gb...\nAwesome,isn't it ?\nBtw the archieve has the same password protection.\nFor the end,i'm not really happy cause a stupid guy as a stupid idiot might \nhave announced my torrent seed on Cyberlink support forum.\nNot cool and not nice at all anyway.\nEven if i can understand his act...\nTherefore please,try to stay discret with my both seeds about this product and don't deceived me as well.\nI don't need of publicity,i just share my little gold with each of you and i think it is already not so bad then.\nBe mature as well as respectfull.\nTy for understanding\n...\n\nEnjoy and gl\n\nregards\n","torrent":{"xt":"urn:btih:399536d1752234396c146707cbd97157b2c08163","amp;dn":"CPD.10-additional+complementary-stuff%26amp%3Bfix-test2.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"399536d1752234396c146707cbd97157b2c08163","infoHashBuffer":{"type":"Buffer","data":[57,149,54,209,117,34,52,57,108,20,103,7,203,217,113,87,178,192,129,99]},"announce":[],"urlList":[]}}