{"title":"POtHS 2 - Bible Study - Part 109 - Mysteries of Pagan Idol Worsh","uid":7682737,"size":4051497134,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3a0274d573b9fa55831df1c7129cf579161092ea&amp;dn=POtHS+2+-+Bible+Study+-+Part+109+-+Mysteries+of+Pagan+Idol+Worsh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":-1,"time":1348863916,"description":"POtHS\nPouring Out the Holy Spiritruth\n\n \n\nPOtHS - Bible Study - 10p - Mysteries of Pagan Idol Worship Vol 4 - Mother of Harlots\n\n\nPOtHS Comment: Very Good\n\nDescription:  \n\nTHE WAY OF CAIN - Mans Religion:\nMost Christians have heard the story of Cain and Abel. But do you really know the biblical account? Did Cain actually start his own religion? If he did, how did he do it? Do all the world's religions originate from Cain? Gary Paul Miller reveals the real founder of &quot;religion&quot; and why you will never look at religions and religious men the same.\n\n\n\nSex Drugs and Rock Music by Barry Westbrook:\nFormer star DJ tells all.  Barry delivers an expose on the satanic deception of the music industry and common practices to entice the people into the satanic realms.\n\nThe Fruit of Evolution:\n&quot;I am prepared to fight and die for my cause ... I, as a natural selector, will eliminate all who I see unfit, disgraces of human race and failures of natural selection.&quot;\n\n7 Nov 2007, one day after this film was recorded Eight people were killed and at least 10 others injured in a shooting at a school in southern Finland. Before the attack the killer made the boast above on YouTube.  This talk looks at the moral consequences of evolution, from the holocaust to the sexual revolution.  The Edinburgh Creation Group describes what has come from evolutionism.  This is part two of the two part series.\n\n\nThe Authority Of Gods Word - Ken Ham of Answers in Genesis:\nKen's emphasis is on the relevance and authority of the book of Genesis to the life of the average Christian, and how compromise on Genesis has opened a dangerous door regarding how the culture and church view biblical authority. &lt;a href=&quot; http://www.answersingenesis.org/outreach/speakers/ken-ham/bio/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.answersingenesis.org/outreach/speakers/ken-ham/bio/&lt;/a&gt;\n\n\n\n \nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n\n                                           \n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n","torrent":{"xt":"urn:btih:3a0274d573b9fa55831df1c7129cf579161092ea","amp;dn":"POtHS+2+-+Bible+Study+-+Part+109+-+Mysteries+of+Pagan+Idol+Worsh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a0274d573b9fa55831df1c7129cf579161092ea","infoHashBuffer":{"type":"Buffer","data":[58,2,116,213,115,185,250,85,131,29,241,199,18,156,245,121,22,16,146,234]},"announce":[],"urlList":[]}}