{"title":"Hogtied------HT-26084 Chanel Preston WMV","uid":7759989,"size":597754920,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:3a447d96dd95777d1d7e725215c86b87e9412bdc&amp;dn=Hogtied------HT-26084+Chanel+Preston+WMV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"merzedes","files":1,"time":1351201508,"description":"Chanel Preston\n\nOct 25, 2012 - Performers: Chanel Preston\n          \n          \nWMV only. MP4 + Pics later.\n          \n\nWelcome Chanel back to HogTied. In this update, she is given unpleasant but totally hot predicament bondage. In the first scene, she is perched with her tits on top of the ass less chair. Her head is encased in nylon, her nipple clamps tied to her neck, and the nylon to her chest harness. If she ties to see the torment or not react to the pain, she jerks her sensitive nipples and fabulous breasts. The chair is laid down and so is she... on her back again like the dirty whore she is. Chanel quickly discovers in this position she can't close her legs. Claire pounds her cunt milking sweet cum out of her cunt hole. In scene two, Chanel is given a booty tie to pop her ass out and oiled up like Sunday dinner. Claire goes after her with the flip cat and yet again, Chanel can't seem to close her legs with them bound so tightly to the wooden spreader bar. She cums again and again at Claire's whim, whimpering and begging again and again for release. In the third position, she is bound to a wood table with holes. Her legs are bound together and toes tied up to the pulley. Its discovered this is the perfect position to mercilessly tickle this cunt. She tries to escape, but its completely useless. A dildo assaults her cunt. A vibe on her clit. It becomes apparent that this bitch was made for the playground.\n\nScreens &lt;a href=&quot;\nhttp://www.hogtied.com/site/shoot.jsp?shootId=26084&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hogtied.com/site/shoot.jsp?shootId=26084&lt;/a&gt;\n\n8000 uploads and counting, if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)   \n \nCheers  :-)  \n\n\n\n\n","torrent":{"xt":"urn:btih:3a447d96dd95777d1d7e725215c86b87e9412bdc","amp;dn":"Hogtied------HT-26084+Chanel+Preston+WMV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a447d96dd95777d1d7e725215c86b87e9412bdc","infoHashBuffer":{"type":"Buffer","data":[58,68,125,150,221,149,119,125,29,126,114,82,21,200,107,135,233,65,43,220]},"announce":[],"urlList":[]}}