{"title":"Melissa Harris-Perry 9-1-12.mp4","uid":7616515,"size":380701483,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3ac30c8e097e7b82e5dd1548e75bcf0d935f5ccb&amp;dn=Melissa+Harris-Perry+9-1-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":-1,"time":1347215669,"description":"Melissa Harris-Perry; Saturday, September 1, 2012.\n\nRepublicans for the last several days presented whatever argument they have for why they should be in charge, why government isn't the answer, &quot;you DID build that,&quot; and so on and so forth. Now that they're done, Melissa offered a retort of sorts.\n\nMHP's guests included:\n\nA two person panel Nancy Giles (comedian, writer, and contributor to CBS News' &quot;Sunday Morning&quot;) and David Coates (political science professor at Wake Forest University) on if there was a Romney convention bounce and his likeability.\n\nMonica Mehta (business and finance expert and author of &quot;The Entrepreneurial Instinct&quot;), David Coates (political science professor at Wake Forest University), Nancy Giles (comedian, writer, and contributor to CBS News' &quot;Sunday Morning&quot;), Bob Franken (syndicated columnist) discussed Romney's pitch.\n\nA two person panel Nancy Giles and Ronald Scott (author of &quot;Mitt Romney: An Inside Look at the Man and His Politics&quot;) looked at Mormonism.\n\nIrin Carmon (staff writer at Salon.com) took Monica Mehta's seat on the panel. Nancy Giles stayed and replaced David Coates on the panel. Rebecca Traister (senior writer at Salon.com and author of &quot;Big Girls Don't Cry&quot;), and Monica Mehta. This panel talked about 'the gender gap'.\n\nKaren Carter Peterson (Democratic State Senator from Louisiana, and Chairwoman of the Louisiana Democratic Party) joined via satellite and discussed hurricane Isaac.\n\nDavid Coates replaced Rebecca Traister on the new panel, which discussed welfare and social programs.&quot;\n\nSaturday's Foot Soldiers are Jesse Shaffer Sr. and Jr. They went around saving people in the community of Plaquemines Parish after hurricane Isaac.","torrent":{"xt":"urn:btih:3ac30c8e097e7b82e5dd1548e75bcf0d935f5ccb","amp;dn":"Melissa+Harris-Perry+9-1-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ac30c8e097e7b82e5dd1548e75bcf0d935f5ccb","infoHashBuffer":{"type":"Buffer","data":[58,195,12,142,9,126,123,130,229,221,21,72,231,91,207,13,147,95,92,203]},"announce":[],"urlList":[]}}