{"title":"The Mixed Up Files of Mrs. Basil E. Frankweiler","uid":7697695,"size":7711805,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3c381a4d81f98f1ab66f5779a8c5262a46d189e9&amp;dn=The+Mixed+Up+Files+of+Mrs.+Basil+E.+Frankweiler&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tomdarien69","files":1,"time":1349409513,"description":"The Mixed-Up Files of Mrs. Basil E. Frankweiler\nBy E.L. Konigsburg\n\nFORMAT: EPUB\n\nSUMMARY:\n\nClaudia Kincaid is almost twelve, a straight &quot;A&quot; student, only girl and eldest child of four, who decides to run away to somewhere beautiful, comfortable, and preferably indoors.\n\nClaudia is in fact rebelling against the monotony of her life, unfair distribution of labor, limited television choices and low allowance.\n\nEver the organizer, she carefully formulates a master plan to escape to the Metropolitan Museum of Art, and enlists her middle brother Jamie to join her. Of course, there are very practical reasons that Jamie was the chosen one, and after Claudia tears down his defenses, he becomes a willing accomplice.\n\nThe story tells of their grand adventure, and how they were able to survive undetected inside the Met for a whole week. While there, they take the opportunity to learn new things, and become captivated by the newest exhibit, a marble angel that may just be a genuine Michelangelo sculpture.\n\nThere and then, Claudia resolves to solve the mystery before returning home, but unfortunately, finances are running low and time is running out for the fugitives.\n\nThrough dogged determination, they use the last of their resources to locate the former owner of the angel, Mrs. Basil E. Frankweiler, the lady of the title and narrator of the story. After winning the good lady's favorable consideration, they negotiate a deal with her, the outcome of which decides the success or failure of their adventure.\n","torrent":{"xt":"urn:btih:3c381a4d81f98f1ab66f5779a8c5262a46d189e9","amp;dn":"The+Mixed+Up+Files+of+Mrs.+Basil+E.+Frankweiler","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c381a4d81f98f1ab66f5779a8c5262a46d189e9","infoHashBuffer":{"type":"Buffer","data":[60,56,26,77,129,249,143,26,182,111,87,121,168,197,38,42,70,209,137,233]},"announce":[],"urlList":[]}}