{"title":"Electric Highlife Sessions~Bokoor Studios (Naxos) [320KB] {MKOP}","uid":7614393,"size":172297470,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3cfc5d5f7dd962738d74f051aef90142f7affebe&amp;dn=Electric+Highlife+Sessions%7EBokoor+Studios+%28Naxos%29+%5B320KB%5D+%7BMKOP%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mudmashers","files":14,"time":1347161514,"description":"Electric Highlife: Sessions From the Bokoor Studios (Naxos) [320KB] {MKOP}\n\nHighlife is Ghana. For a century it's developed, mutated, and changed, played in many ways and styles by bands with any combination of instruments. This CD focuses on the 1980s and the output of one particular studio. So while it's not exactly a broad survey, it does offer a little slice of music, with the emphasis very firmly on electric guitars, whether the frantic rhythms of the Happy Boys or the more laid-back approach of the wonderfully named Beach Scorpions or George Adu's &quot;Obina Mma Obi Kyere No,&quot; where saxophone weaves in and out of the lines -- not jazz, but some organic hybrid of music. With eight different acts, the compilation does offer a fair amount of variety, the wonky guitars of Guyoyo creating a particular affection on &quot;Osikuni Atamio&quot; with a garage amateurishness that's actually very professional if you listen a little more closely. The glorious thing about highlife is how inclusive it is, ranging from the soul/jazz inflections of &quot;Niawu Be Ye&quot; to the more formal &quot;Ensuah Nzema Kotoko.&quot; So while hardly a complete look at highlife in any era, this remains a thoroughly enjoyable little bit of Ghana on your stereo. ~Chris Nickson (Allmusic)\n \n01. F. Kenya - Ensuah Nzema Kotoko (The Nzema Kotoko Family)\n02. Guyoyo - Osikuni Atamfo (Gossiper Enemies)\n03. Black Beats - Tsutsu Tsosemo (Old Time Training)\n04. Eddie Ansah - Mewu Mo Dzi (I'm Looking On High)\n05. F. Kenya - Memia (I Am Too Broke)\n06. George Adu - Obia Ba Nnye (Naughty Child)\n07. F Kenya - Madame Zehae Ala (just As I Am)\n08. George Adu - Obina Mma Obi Kyere No\n09. Bokoor Band - Yaka Duru (Liberian Folktune)\n10. Happy Boys - Sosu Sei Me\n11. Beach Scorpions - Friends Today, Enemies Tomorrow\n12. Happy Boys - Niawu Be Ye (Sow And Reap)\n13. Beach Scorpions - Jealousy\n\nMusic Keep On Playing*Thank You Seeders","torrent":{"xt":"urn:btih:3cfc5d5f7dd962738d74f051aef90142f7affebe","amp;dn":"Electric+Highlife+Sessions%7EBokoor+Studios+%28Naxos%29+%5B320KB%5D+%7BMKOP%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cfc5d5f7dd962738d74f051aef90142f7affebe","infoHashBuffer":{"type":"Buffer","data":[60,252,93,95,125,217,98,115,141,116,240,81,174,249,1,66,247,175,254,190]},"announce":[],"urlList":[]}}