{"title":"The Ed Show 9-26-12.mp4","uid":7677867,"size":186879679,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3e2c439bffd7aae322756676d7bdd3c3504fbc88&amp;dn=The+Ed+Show+9-26-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1348751221,"description":"The Ed Show; September 26, 2012.\n\n41 days until the election and Mitt Romney was still trying to clean up his 47 percent problem.  But America isn't buying it.  \n\nEd started with E.J. Dionne, (Senior Fellow at The Brookings Institution and Washington Post columnist), reports on today's disastrous poll numbers for Republicans.  And Chris Redfern (Chairman of the Ohio Democratic Party), looks at Romney's failure to connect with voters in the Buckeye State.\n\nThen, the star of TV's &quot;Dirty Jobs&quot; gets his dirtiest job yet: Mike Rowe stands on the wrong stage with the wrong candidate.  Rep. Jim McDermott (D-WA) joined Ed for that.\n\nThere's more fallout from Massachusetts Sen. Scott Brown's race baiting campaign against Democratic Challenger Elizabeth Warren.  They got the latest from Ayanna Pressley (Boston City Council Member and the Chair of the Committee on Women &amp; Healthy Communities).\n\nRepublicans don't like reality so they have created a new reality, with wild conspiracy theories about the polls showing President Obama in the lead.  Ed debunked the Republican alternate reality with Chris Kofinis (Democratic Strategist, former Edwards campaign Communications Director).\n\nAnd all of a sudden, Arizona's Senate race is back in play for Dems.  Democratic candidate Richard Carmona joined Ed for an exclusive interview.","torrent":{"xt":"urn:btih:3e2c439bffd7aae322756676d7bdd3c3504fbc88","amp;dn":"The+Ed+Show+9-26-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e2c439bffd7aae322756676d7bdd3c3504fbc88","infoHashBuffer":{"type":"Buffer","data":[62,44,67,155,255,215,170,227,34,117,102,118,215,189,211,195,80,79,188,136]},"announce":[],"urlList":[]}}