{"title":"priPrinter Professional 5.0.3.1452+keygen by Senzati.rar","uid":7709770,"size":4151755,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3e7d6622c02b35c48beee9e7dae26d436dc9d67e&amp;dn=priPrinter+Professional+5.0.3.1452%2Bkeygen+by+Senzati.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BySenzati","files":-1,"time":1349778477,"description":"priPrinter - a printer driver that allows you to manage and edit the document before you print on your printer. This tool is installed in the same way as regular drivers for printers and can be used as the default printer. After printing the selected document, the program automatically starts a window for editing a document, which must be raspchatan. In this window, you are allowed to customize the pages, add some effects to the kind of document do scrap paper and much more. In addition, the interface is translated into several languages, including Russian. \n\n priPrinter is a printer driver that allows you to manipulate printer output before it is printed. priPrinter is installed and selected in the same way as other printer drivers. After printing it automatically displays print preview where you can preview your printings, change layout, reposition pages, crop them and many more. After that you print it to the real printer or save your document for later using. With priPrinter you always will be sure how your printings will look. You may measure items on the paper, define margins and pages layout. There is no need to print again and again trying to achieve desired placemen\n\nOS: Windows 2000/XP/Vista/7","torrent":{"xt":"urn:btih:3e7d6622c02b35c48beee9e7dae26d436dc9d67e","amp;dn":"priPrinter+Professional+5.0.3.1452%2Bkeygen+by+Senzati.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e7d6622c02b35c48beee9e7dae26d436dc9d67e","infoHashBuffer":{"type":"Buffer","data":[62,125,102,34,192,43,53,196,139,238,233,231,218,226,109,67,109,201,214,126]},"announce":[],"urlList":[]}}