{"title":"Sexually Broken--Annie Cruz squirt in her own face  Annie Cruz  ","uid":7737080,"size":543284579,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:3fbfe552e1764fcb46be14dc9586ceabf9cc5bf8&amp;dn=Sexually+Broken--Annie+Cruz+squirt+in+her+own+face++Annie+Cruz++&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1350512940,"description":"Annie Cruz, trapped in a piledriver, made to squirt, in her own face and throat! | Annie Cruz | Matt Williams\n\nOctober 15, 2012\n\n\nMP4 only.\n\n\nSexually Broken welcomes back Annie fucking Cruz. This hot \nAsian is a bendy, squirting, deep throating, multi-orgasmic \ngift from from beyond, for all mankind to enjoy.\n\nBound in a brutal piledriver, with her pussy positioned \ndirectly above her face and her knees bend beside her head, \nAnnie finds herself in a very compromising and humiliating \nposition. Her ass and pussy are completely exposed, making her \nutterly helpless. Bent into such an extreme position, Annie \ncan watch close up every depraved thing we do to her holes, \nshe literally has the best seat in the house.\n\nWe start by warming up Annie's pussy with a flogger. Her pussy \ntakes some good heavy hits as we prep her for the massive \nsquirting that is about ensue. We switch to the cane and \nattack her feet. She suffers as the soles of her feet take \nsome rough bastinado. With the endorphines now coursing though \nher body, we prep her for the massive orgasms she is about to \nendure. Baby oil coats her amazing ass and we start our sexual \nattack that will rock her very soul.\n\nThe first orgasm cums fast, and Annie squirts like a fountain. \nWe direct most of the liquid into the funnel and down Annie's \nown throat. Every time we make Annie cum, she can't help \nhaving to swallow it. We make Annie cum about every 15 \nseconds, she squirts massive amounts cum. How many time can we \nMAKE her cum, How much squirt runs into her own mouth. Annie \nis completely helpless, she can't stop her self from \nsquirting, and we can seem to stop making her... \n\nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/10_15annie3/SexuallyBroken-Annie-Cruz-Matt-Williams-Annie-Cruz-trapped-in-a-pile-driver-made-to-squirt-in-her-own-face-and-throat.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/10_15annie3/SexuallyBroken-Annie-Cruz-Matt-Williams-Annie-Cruz-trapped-in-a-pile-driver-made-to-squirt-in-her-own-face-and-throat.php&lt;/a&gt;\n\n8000 uploads and counting, if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)   \n \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:3fbfe552e1764fcb46be14dc9586ceabf9cc5bf8","amp;dn":"Sexually+Broken--Annie+Cruz+squirt+in+her+own+face++Annie+Cruz++","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3fbfe552e1764fcb46be14dc9586ceabf9cc5bf8","infoHashBuffer":{"type":"Buffer","data":[63,191,229,82,225,118,79,203,70,190,20,220,149,134,206,171,249,204,91,248]},"announce":[],"urlList":[]}}