{"title":"DeadCyborg-Episode1-Linux_v002","uid":7750843,"size":86187399,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:4005a03338d137fc5461800bab16fec6d7641f74&amp;dn=DeadCyborg-Episode1-Linux_v002&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dez82","files":127,"time":1350899565,"description":"What is the story of this game?\n-You are a human being who has waken up in a cryotank... you have no memories, but you find some messages from the past... from yourself...\nYou don't feel good... maybe this is a radioactive and toxic place ... you may not have much time... You find some stupid robots... with strange answers to your questions. \nWhere and when is this game playing?\n-We don't know. Maybe in the future... in a rusty, metal and concrete, post apocalyptic world... but it doesn't matter.\n\nWhat about the game mechanism?\n-The gameplay is very simple. You can move, take items and use them. You can examine a lot of things.\nYou can find information about the world and the story.\nYou must build up the story using these pieces of information.\nThis is a very important and unique part of the game. So: explore, search, think.\nWhy no save in this game?\n-There is checkpoint system with password. The main gameplay is simple, so if you don't read the texts\nagain, you can reach a position very fast - and with the password you can start a level.\nThe graphics are good but why are the animations so simple?\n-This is a text based game. So it's the texts that are important, the animations are only extras.\n\nWhy do you created this game?\n-This game is my fulfilled dream. I love the old text adventures, the fps games and the classic sci-fi writers.\nI wanted to make a game with really serious story about the life and death... about the human existence.\n","torrent":{"xt":"urn:btih:4005a03338d137fc5461800bab16fec6d7641f74","amp;dn":"DeadCyborg-Episode1-Linux_v002","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4005a03338d137fc5461800bab16fec6d7641f74","infoHashBuffer":{"type":"Buffer","data":[64,5,160,51,56,209,55,252,84,97,128,11,171,22,254,198,215,100,31,116]},"announce":[],"urlList":[]}}