{"title":"Four Color Fear: Forgotten Horror Comics of the 1950's [cbr]","uid":9353534,"size":1079190041,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:40cc3c0743dd091dd0b44129bded4f840e43fdb8&amp;dn=Four+Color+Fear%3A+Forgotten+Horror+Comics+of+the+1950%27s+%5Bcbr%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"7","files":5,"time":1387184806,"description":"Four Color Fear: Forgotten Horror Comics of the 1950's\n\nEdited by Greg Sadowski\n\nIntroduction By John Benson\n\nPaperback: 304 pages\n\nPublisher: Fantagraphics Books; Reprint edition (Oct 5 2010)\n\nLanguage: English\n\nOf the myriad genres comic books ventured into during its golden age, none was as controversial as or came at a greater cost than horror; the public outrage it incited almost destroyed the entire industry. Yet before the watchdog groups and Congress could intercede, horror books were flying off the newsstands. During its peak period (1951-54) over fifty titles appeared each month. Apparently there was something perversely irresistible about these graphic excursions into our dark side, and Four Color Fear collects the finest of these into a single robust and affordable volume.EC is the comic book company most fans associate with horror; its complete line has been reprinted numerous times, and deservedly so. But to the average reader there remain unseen quite a batch of genuinely disturbing, compulsive, imaginative, at times even touching, horror stories presented from a variety of visions and perspectives, many of which at their best can stand toe to toe with EC.All of the better horror companies are represented: Ace, Ajax-Farrell, American Comics Group, Avon, Comic Media, Fawcett, Fiction House, Gilmor, Harvey, Quality, Standard, St. John, Story, Superior, Trojan, Youthful and Ziff-Davis. Artist perennials Jack Cole, Reed Crandall, George Evans, Frank Frazetta, Jack Katz, Al Williamson, Basil Wolverton, and Wallace Wood contribute both stories and covers, with many of the 32 full-sized covers created by specialists Bernard Baily, L.B. Cole, William Eckgren, and Matt Fox. Editors John Benson and Greg Sadowski have sifted through hundreds of rare books to cherry-pick the most compelling scripts and art, and they provide extensive background notes on the artists, writers, and companies involved in their creation. Digital restoration has been performed with subtlety and restraint, mainly to correct registration and printing errors, with every effort made to retain the flavor of the original comics, and to provide the reader the experience of finding in the attic a bound volume of the finest non-EC horror covers and stories of the pre-code era.\n\n\nPart1:89-Pages  This installment includes terrifying tales like &quot;A Pact With the Devil&quot; by genius Jack Cole and &quot;Swamp Monster&quot; by the brilliant Basil Wolverton.\n\n\nPart2:86-Pages This installment includes twisted yarns like Jack Katz's &quot;Me, Ghost&quot; and &quot;Drum of Doom&quot; by Al Williamson, as well as a stunning cover gallery!\n\n\nPart3:91-Pages This installment includes haunting stories from luminaries like Wallace Wood, Joe Kubert, Frank Frazetta and more.\n\n\n\nStunning cover gallery In Separate Folder\n\n\nPart4: 86-Pages This installment includes more than eighty pages of terrifying tales, a stunning cover gallery, and lavishly illustrated notes on every story from all of Four Color Fear, featuring detailed histories, shocking secrets, and the hilarious, hard-boiled and sometimes tragic true stories of the creators behind the comics!","torrent":{"xt":"urn:btih:40cc3c0743dd091dd0b44129bded4f840e43fdb8","amp;dn":"Four+Color+Fear%3A+Forgotten+Horror+Comics+of+the+1950%27s+%5Bcbr%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40cc3c0743dd091dd0b44129bded4f840e43fdb8","infoHashBuffer":{"type":"Buffer","data":[64,204,60,7,67,221,9,29,208,180,65,41,189,237,79,132,14,67,253,184]},"announce":[],"urlList":[]}}