{"title":"Video_Reese_Tristan_20111024031126_2024k.wmv","uid":7633451,"size":445039741,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:40d5dc6737322d933750d862f9001b46a92cfc70&amp;dn=Video_Reese_Tristan_20111024031126_2024k.wmv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1347586558,"description":"Seed, seed, and seed.\n\nI have a slow upload speed, so please be patient. \n\n Reese Rideout has a problem. He needs sunblock, and he needs it now. It's a good thing Tristan Scott is around to help him. But things don't always work out as planned. Once Tristan starts running his hands all over Reese's smooth muscular body all thoughts of sunning himself leave Reese's mind and all he can think about is hardcore sex. Going down on Tristan is only the beginning, because pretty soon Tristan is burying his face in Reese's hot bubble butt, and with his adorable facial scruff the sensations were throwing Reese through the roof. Reese couldn't let Tristan have all the fun, though. He had to give him a kick ass rim job as well before shoving his dick deep in Tristan's smokin' hot ass. Reese loves fucking man ass and he's been wanting to bang Tristan for a while now, and once he got the chance he loved every minute of it. Tristan obviously did too, judging from the nice thick load he shot all over Reese's smooth chest. And when it was Reese's turn he blew a wad of cum right on Tristan's handsome face, and Tristan happily lapped up the drippings from Reese's cock. ","torrent":{"xt":"urn:btih:40d5dc6737322d933750d862f9001b46a92cfc70","amp;dn":"Video_Reese_Tristan_20111024031126_2024k.wmv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40d5dc6737322d933750d862f9001b46a92cfc70","infoHashBuffer":{"type":"Buffer","data":[64,213,220,103,55,50,45,147,55,80,216,98,249,0,27,70,169,44,252,112]},"announce":[],"urlList":[]}}