{"title":"TeraCopy v2.121","uid":7689850,"size":1849810,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:41e7e9ad3089f6157ecc0c956f6e8d0996016f0e&amp;dn=TeraCopy+v2.121&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"YahSoft","files":-1,"time":1349059767,"description":"--- -- -Enjoy And SEED-YahSoft- -- ---\n\nCopy and move your files with the speed of your computer by using this simple tool.\n\nIf you are a person who is always copying your files from one place to another on your computer, you will enjoy a program capable of making such transfers are made more quickly, right? So TeraCopy is a great option for you! For he can use all the potential transfer from your computer since the beginning of it, unlike Windows which needs &quot;warm up&quot; before.\n\nFurthermore, TeraCopy adds a context menu for quick access to it, lets pause transfers, is capable of testing the integrity of the files on your task list, besides being able to move files (instead of copying them) and even delete them.\n\nHow to use TeraCopy\n\nUsing it is simple, just drag it to the desired file to it (click &quot;More&quot; to make it larger), and set to where the file will be copied (&quot;Copy To&quot;) or moved (&quot;Move To&quot;) through the &quot;Browse ...&quot;.\n\nSimple mode\n\nIf TeraCopy is not open yet, simply right click on the desired file, move the mouse to &quot;TeraCopy&quot; and choose one of the options (&quot;Add&quot; adds the file to the task list, &quot;Test&quot; the forehead, &quot;Copy To&quot; to copy the place to be specified, &quot;Move To&quot; and moves the &quot;Delete&quot; deletes). Another way to do this is to simply use the command &quot;Copy&quot; and &quot;Paste&quot; Windows, because if TeraCopy &quot;intrude&quot; and he will transfer.\n\nPopup\n\nOnce the transfer you can clear the list of files to be moved (&quot;Clean Up&quot;), save a list of the actions taken (go to &quot;Menu&quot;, move the mouse to &quot;Reports&quot; and select &quot;Save as New&quot;) . ","torrent":{"xt":"urn:btih:41e7e9ad3089f6157ecc0c956f6e8d0996016f0e","amp;dn":"TeraCopy+v2.121","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41e7e9ad3089f6157ecc0c956f6e8d0996016f0e","infoHashBuffer":{"type":"Buffer","data":[65,231,233,173,48,137,246,21,126,204,12,149,111,110,141,9,150,1,111,14]},"announce":[],"urlList":[]}}