{"title":"The Mystery of a Hansom Cab [Unopoleco]","uid":7769298,"size":543412365,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:420606134f01be1e3fa74c786af5ce2d8d7b3e4d&amp;dn=The+Mystery+of+a+Hansom+Cab+%5BUnopoleco%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"unopoleco","files":2,"time":1351470935,"description":"Based on the international best-selling novel by Fergus Hulme, The Mystery of a Hansom Cab is now a stunning new telemovie with twists and turns to the very end.\n\nSet in boom-time Melbourne, 1886, two gentlemen climb into a hansom cab late one murky night. One man climbs out, the other continues his journey. On arrival, the driver finds the second man dead; murdered. The 'high-society' killing sends shockwaves through the young city, still flush from its gold-rush boom. The victim, Oliver Whyte (Brett Climo), fresh from England with glowing 'letters of introduction', had endeared himself to one of the wealthiest men in the colony, Mark Frettlby (John Waters). It is Mark's 21-year-old daughter, Madge (Jessica De Gouw), who Whyte instantly sets his sights on, but Madge is already in love with Brian Fitzgerald (Oliver Ackland), a sensitive, hard-working Irishman.\n\nBrian is arrested for the murder but refuses to provide an alibi. His lawyer, Duncan Calton (Marco Chiappi), and Madge are forced to search for the truth themselves in order to save Brian. Their investigation not only uncovers a trail of secrets and scandal from opium dens and brothels to the cream of society, but their revelation threatens to tear the Frettleby family apart.","torrent":{"xt":"urn:btih:420606134f01be1e3fa74c786af5ce2d8d7b3e4d","amp;dn":"The+Mystery+of+a+Hansom+Cab+%5BUnopoleco%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"420606134f01be1e3fa74c786af5ce2d8d7b3e4d","infoHashBuffer":{"type":"Buffer","data":[66,6,6,19,79,1,190,30,63,167,76,120,106,245,206,45,141,123,62,77]},"announce":[],"urlList":[]}}