{"title":"Infinite Painter v1.9.7 Final By bobiras2009","uid":7653810,"size":1483919,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:42090958cdfa589d5cc81afce917ef62af1cd301&amp;dn=Infinite+Painter+v1.9.7+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bobiras2009","files":-1,"time":1348099243,"description":"Follow my uploads here:                            &lt;a href=&quot;\nhttps://forum.suprbay.org/member.php?action=profile&amp;uid=311481&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/member.php?action=profile&amp;uid=311481&lt;/a&gt;    \n\nYou can make requests here:                             &lt;a href=&quot;\nhttps://forum.suprbay.org/forumdisplay.php?fid=4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/forumdisplay.php?fid=4&lt;/a&gt;\n                 \n\n                                By bobiras2009\t\t\n\n\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\nThis app offers a multitude of brushes designed to replicate realistic mediums. It offers a variety of features built to optimize and streamline the workflow of the artist. It works well with Infinite Design, allowing the user to export their projects from Infinite Design into Infinite Painter with the click of a button.\n\nIt has five different types of symmetries you can use (X-Axis, Y-Axis, Arbitrary Angle, Radial, and Kaleidoscopic). It utilizes a smart menu system and a fluid interface, seeking to make work flow on the go much easier.\n\nNavigation is as easy as putting two fingers on the screen and dragging the canvas or pinching to zoom. The auto save feature also comes in handy, automatically saving your layers and reloading them when you return. You can save your project, and all of your layers stay intact. You can also export your image with or without the background.\nBesides these fundamental necessities, Infinite Painter also offers image importing in four different ways (Camera, Gallery, Google Image Search, and the current painting itself). After importing an image, you can translate, re-size, rotate, flip or recolor it to your liking. You then have the option to either stamp or rub the image onto the canvas. Infinite Painter also provides a dedicated blending button, allowing you to switch easily from painting to blending as you bring your artwork to life.\n\nSuggested workflow: I usually like to take advantage of Infinite Design's limitless canvas in creating my design and laying out my artwork, then I use Infinite Design's Export-to-Painter feature to bring it in and start painting on a layer beneath the line-art. This approach takes advantage of the flexibility offered by Infinite Design and also the complexity offered by Infinite Painter.\n\nFeatures:\n\n    Added a Blend Wheel. You can now control the smudge strength and lighten or darken while blending.\n    Added a new three-dimensional tube brush.\n    Redesigned the Symmetry dialog into a Symmetry Wheel.\n    Added double tap to fullscreen the painting. Double tap again to return back to where you were.\n    Fixed many glitches and FC issues some customers were having.\n\nWhat's in this version: (Updated : Sep 18, 2012)\n\n    Added Layer Blend Modes\n    Added Guides\n    Integrated Inspire Stream\n    Worked out unstable issues with certain devices.\n    Fixed the undo system.\n    Fixed lag in brushes.\n\nRequired Android O/S : 2.1+\n\n\n                                By bobiras2009\t\t","torrent":{"xt":"urn:btih:42090958cdfa589d5cc81afce917ef62af1cd301","amp;dn":"Infinite+Painter+v1.9.7+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42090958cdfa589d5cc81afce917ef62af1cd301","infoHashBuffer":{"type":"Buffer","data":[66,9,9,88,205,250,88,157,92,200,26,252,233,23,239,98,175,28,211,1]},"announce":[],"urlList":[]}}