{"title":"WeatherBug Elite v2 7 30 AnDrOiD","uid":7630723,"size":4316175,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:42322a99245f2b8ebe29b4770c6bdebef50d5f35&amp;dn=WeatherBug+Elite+v2+7+30+AnDrOiD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"FlairDevil","files":-1,"time":1347528238,"description":"~FlairDevil's first torrent ever! Basically a test bed for me to learn what I am doing =) Questions/Comments feel free to troll away at me!  I will be bringing you the latest files available once I get in my stride!\n\n\n\n                _____        ____  _ _____  \n    /         |  __       / __ (_)  __  \n   /     _ __ | |  | |_ __| |  | |_| |  | |\n  / /  |  _ | |  | |  __| |  | | | |  | |\n / ____ | | | | |__| | |  | |__| | | |__| |\n/_/    __| |_|_____/|_|   ____/|_|_____/ \n                      \n                      \n\n\n\nWeatherBug Elite v2.7.30\n\nRequirements: Android OS 1.6 +\n\nGet the latest current conditions, forecasts, radar animation, alerts and more!\n\n\nAccess the world's largest network of real-time weather sensors for forecasts, alerts and more. The Fastest and Most Targeted Alerts. More Accurate Forecasts. Neighborhood-level Weather in Real-Time. Come experience the WeatherBug difference! \n\nExtreme weather can strike at anytime, anywhere. Be prepared with WeatherBug Elite for Android from Earth Networks. WeatherBug provides real-time, customized weather information with faster weather alerting and better forecasts from the largest global weather network. And, with the added benefit of our exclusive neighborhood-level network of stations, getting the most relevant and personalized weather has never been easier.\n\nFeatures include: \n\u0007100% Ad Free - Enjoy your weather information without advertisements\n\n\u0007My Current Location - Automatically updates your weather information based on the closest weather station to you in your neighborhood \n\n\u0007Severe Weather Warnings &amp; Alerts - Receive dangerous weather alerts faster from both the National Weather Service and our exclusive WeatherBug Network\n\n\u0007Pin-Point Conditions - Drop a pin on the map anywhere in the U.S. and view current conditions from our weather station network\n\n\u0007Visual Forecasts - Easy-to-read, at-a-glance displays of essential weather information you need quickly and easily\n\n\u0007Live Cams - Scroll through and view live shots from HD cameras in the WeatherBug Network\n\u0007Enhanced Maps - Lightning strikes*, humidity, pressure, wind speed, hi/lo forecast, traffic and satellite imaging\n\n\u0007Detailed Alert Maps - With vector polygons and full National Weather Service (NWS) alert messages\n\n\u0007Unlimited Saved Locations - Save all your locations without restrictions\n\n\u0007Locations Summary Page - Check weather conditions at-a-glance for all your saved locations\n\n\u0007Additional Home Screen Widget - With extended 3 day forecast and more\n\n\u0007Improved GPS Tracking and Customization -The most relevant information possible, the way you want it\n\n\u0007Live Active Wallpaper - Customize your phone with our live wallpaper\n\n*U.S. only\n\nBe prepared. Know before. Download the app used by millions, voted &quot;Best Weather App Ever&quot; and trusted as a &quot;Best App for Moms&quot; - WeatherBug.\n\nWhat's in this version:\n*NEW* My Storm Tracker (MST): Track and monitor lightning near your GPS location\n*NEW* WeatherBuzz: Share weather alerts on Facebook\n*NEW* Welcome screen introducing new features\n*General stability enhancements\n\nThis app has NO advertisements\n\nMore Info:\n  &lt;a href=&quot;\nhttps://market.android.com/details?id=com.aws.android.elite&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://market.android.com/details?id=com.aws.android.elite&lt;/a&gt;","torrent":{"xt":"urn:btih:42322a99245f2b8ebe29b4770c6bdebef50d5f35","amp;dn":"WeatherBug+Elite+v2+7+30+AnDrOiD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42322a99245f2b8ebe29b4770c6bdebef50d5f35","infoHashBuffer":{"type":"Buffer","data":[66,50,42,153,36,95,43,142,190,41,180,119,12,107,222,190,245,13,95,53]},"announce":[],"urlList":[]}}