{"title":"Take Command 14.02 Build 42","uid":7733558,"size":15931032,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:446075f2389d32498550dca1589d52cbfcf356c0&amp;dn=Take+Command+14.02+Build+42&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"wallpwallpapers","files":-1,"time":1350409877,"description":"Take Command is a comprehensive interactive GUI and command line environment that makes using the Windows command prompt and creating batch files easy and far more powerful. Take Command displays your command line applications in tabbed windows, with optional Explorer-style integration for a visual look at your folders. Take Command includes hundreds of major enhancements to the command line and CMD commands such as COPY, DEL, and DIR, and adds more than 140 new commands, 460 internal variables and functions, a batch file IDE / debugger, and thousands of other features.\n\nFeatures\nYou can run multiple command prompts and GUI applications simultaneously in tabbed windows, including our own Take Command Console (TCC), CMD, bash and PowerShell.\nThe integrated file explorer allows you to examine directories and drag and drop files to the tabbed command prompt windows.\nThe programmable tabbed toolbar lets you create up to 20 tabs with up to 50 toolbar buttons on each. Toolbar buttons can start new tabs or windows, or send commands or text to existing tabs.\nThe TCC scripting language is a massive superset of the CMD command prompt commands, with 182 internal commands, 290 internal functions, and 177 system variables. Almost all of the CMD command prompt commands (e.g. DIR, COPY, DEL, DIR, START, etc.) are enhanced with hundreds of additional options, and TCC adds more than 140 new commands. Take Command can usually do in one or two lines what requires dozens of lines in Windows CMD commands (if it can do it at all).\nMost interactive commands (such as COPY, DIR, DEL, MOVE, etc.) have command dialogs that allow you to select filenames and options and see your command line before executing it. The most powerful Windows command processor is also the easiest to use!\nTake Command includes the best text and binary file viewer available for Windows, including bidirectional scrolling, hex listings, fixed and floating rulers, grid lines, extensive searching and printing features, and much more.\nSelect or exclude files by date, time, size, owner, description, and extended wildcards or regular expressions for extraordinary flexibility in file management.\nSpecify multiple filenames for most file processing command prompt commands (i.e., COPY, DEL, DIR, MOVE, etc.). (COPY even supports multiple targets as well as multiple sources.)\nThe scripting language includes a complete set of flow control structures including IF-Then-Else, DO and FOR loops, SWITCH, subroutines, batch libraries, etc.\nCreate and debug your batch scripts with the integrated graphical IDE. The IDE includes tabbed edit windows and a sophisticated debugger with single stepping, breakpoints, syntax coloring, tooltips, bookmarks, tabbed variable and watch windows. Windows batch file programming has never been easier or more powerful!\n\nInstall:\n\n- run application\n- use keygen","torrent":{"xt":"urn:btih:446075f2389d32498550dca1589d52cbfcf356c0","amp;dn":"Take+Command+14.02+Build+42","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"446075f2389d32498550dca1589d52cbfcf356c0","infoHashBuffer":{"type":"Buffer","data":[68,96,117,242,56,157,50,73,133,80,220,161,88,157,82,203,252,243,86,192]},"announce":[],"urlList":[]}}