{"title":"The Ed Show 10-17-12.mp4","uid":7743383,"size":185513516,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:44b4fdac14df6854e02e8dc6db506333df941868&amp;dn=The+Ed+Show+10-17-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1350688107,"description":"The Ed Show; October 17, 2012.\n\n 20 days until the 2012 election and President Obama went on offense, putting Mitt Romney on the ropes.\n\nWas Tuesday night's debate a game changer?\n\nEd welcomed Bob Shrum (Democratic Strategist) and Michael Steele (former Chairman of the Republican National Committee and MSNBC Analyst), for reaction and analysis.\n\nThen, Cecile Richards (President of Planned Parenthood), looked at how Romney's &quot;binders full of women&quot; gaffe is playing with female voters. [Also important was that the state implemented the policy before he was governor.]\n\nThe right wing machine malfunctioned again after another Romney disaster.  Karen Finney (MSNBC Political Analyst and Former DNC Communications Director) looked at what all the complaining about moderator Candy Crowley really meant.\n\nPaul Ryan fumbled while trying to pander to Ohio football fans. Ed had the details.\n\nAnd in the Big Finish, while Romney promises to get tough on China, workers in Freeport, Illinois, are losing their jobs to the Chinese because of his business policies. Ed talked with James Hoffa (President of the International Brotherhood of Teamsters).","torrent":{"xt":"urn:btih:44b4fdac14df6854e02e8dc6db506333df941868","amp;dn":"The+Ed+Show+10-17-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44b4fdac14df6854e02e8dc6db506333df941868","infoHashBuffer":{"type":"Buffer","data":[68,180,253,172,20,223,104,84,224,46,141,198,219,80,99,51,223,148,24,104]},"announce":[],"urlList":[]}}