{"title":"Halim Munan","uid":7697301,"size":341139463,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:45f8253cf2cb3733a9e673a56e2534d384b8998b&amp;dn=Halim+Munan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Zaini711","files":-1,"time":1349394989,"description":"Release Date: 13 September 2012\n\nLanguage: Malay\n\nSubtitle: English Hardsub \n\nGenre: Comedy / Horror\n\nRunning Time: 1 Hour 21 Minutes\n\nDirector: Hashim Rejab\n\nCast: Fizo Omar, Zul Handyblack\n\nHalim bin Munan (Fizo Omar) is always bullied by his friends because of his straight arrow personality and his strange name, which means invisible in Malay. To make things worse, Halim thinks that he is invisible. His life takes a turn for the worse when he is wrongly accused of indecent peeping at Suriyati (Fiza). To clear his name, Halim goes to meet a shaman named Wak Mali. However, when he tries to speak with Wak Mali, the latter is confused for Halim really is invisible. The reason for his sudden predicament is a special cloth which Halim stole from a nearby grave. The cloth renders him invisible 24-7, which also causes the villagers to suspect Halim after several strange and unexplainable incidents take place. What will happen to Halim now?\n\nHalimmunan mengisahkan remaja lelaki, Halim bin Munan. Dia sering di ejek dan dibuli rakan-rakannya iaitu Ajak, Pawi dan Kimi kerana sikap Halim yang agak lurus dan namanya yang dianggap pelik.\n\nHalim sendiri sebenarnya menganggap dirinya sebagai 'halimunan' dan dia suka berangan sehingga dewasa. Namun, pada suatu hari Halim difitnah orang kampung kerana mengintai Suriyati yang juga anak gadis Arsyad. Bagaimanapun, Munah tidak mempercayai tuduhan itu. Sebagai ibu, Munah yakin dengan Halim.\n\nUntuk membersihkan namanya, Halim bertemu seorang bomoh iaitu Wak Mali. Ucapan salam diucapkan dan selepas Wak Mali menjawab salam tu, Wak Mali kebingungan kerana tidak nampak sesiapa memberi salam padanya.\n\nHalim menjadi 'halimunan' selepas mencuri kain kafan di sebuah kubur berhampiran. Belum sempat halim datang menyerahkan separuh kain sebagai syarat 'dapat ilmu', dia sudah pun bertukar menjadi halimunan.\n\nBagaimanapun, halim sebenarnya dah tersalah ambil kain kafan menyebabkan dia sentiasa halimunan. Pada masa sama, penduduk kampung mencarinya kerana halim dituduh menyamar menjadi pocong dan mengacau penduduk kampung.\n\nApakah yang berlaku seterusnya kepada Halim. Mampukah dia membersihkan namanya dan keluarga yang sudah tercemar? Adakah Halim akan berubah sikapnya yang suka berangan itu? Semua jawapan ada dalam Halimmunan.\n","torrent":{"xt":"urn:btih:45f8253cf2cb3733a9e673a56e2534d384b8998b","amp;dn":"Halim+Munan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45f8253cf2cb3733a9e673a56e2534d384b8998b","infoHashBuffer":{"type":"Buffer","data":[69,248,37,60,242,203,55,51,169,230,115,165,110,37,52,211,132,184,153,139]},"announce":[],"urlList":[]}}