{"title":"HISTORY OF POP AND ROCK MUSIC - part 421","uid":7727555,"size":410781635,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4736a743d274005e9ac57cb095c78eddeb131604&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+421&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pupovaczlatko","files":-1,"time":1350255129,"description":" \n\n\n                     PART  421\n\n\n\n           SUZANNE VEGA  -  Tired Of Sleeping  (1990)\n           SHAWN COLVIN  -  Sunny Came Home  (1997)\n           LAURA MARLING  - Cross Your FingersCrawled / Out of the Sea  (2008)\n\n\n \n    &quot;Tired Of Sleeping&quot; is a song written and recorded by Suzanne Vega from her 1990 album &quot;Days of Open Hand&quot;. This album won the Grammy Award for Best Recording Package in 1991.\n   &quot;Sunny Came Home&quot; is a folk-rock song by American musician Shawn Colvin. It is the theme song to her 1996 concept album &quot;A Few Small Repairs&quot;, and quickly became a hit when it was released as a single on June 24, 1997. It peaked at #7 on the Billboard Hot 100 in the US, and likely would have achieved a higher peak had it been released commercially sooner to correspond with the song's airplay maximum: it was #1 on the Hot 100 Airplay chart for four weeks and also #1 on the Adult Contemporary chart for four weeks. On the Hot 100 Single Sales chart, however, it peaked at #29.The song tells the story of a woman named Sunny who burns down her house to escape her past. It is one of several &quot;story songs&quot; on &quot;A Few Small Repairs&quot;, a method of songwriting Colvin began experimenting with while writing for the album.At the 1998 Grammy Awards, it was named Song of the Year and Record of the Year. The Grammy Awards presentation was the occasion for an interruption by rapper Ol' Dirty Bastard stating that his group, Wu-Tang Clan, is for the children, while Colvin was about to receive her award.\n   Laura Beatrice Marling is an English folk musician from Eversley, Hampshire. Her debut album &quot;Alas, I Cannot Swim&quot;, and her second album &quot;I Speak Because I Can&quot; were nominated for the Mercury Music Prize in 2008, and 2010 respectively. She also won Best Female Solo Artist at the 2011 Brit Awards and was nominated for the same award at the 2012 Brit Awards.","torrent":{"xt":"urn:btih:4736a743d274005e9ac57cb095c78eddeb131604","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+421","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4736a743d274005e9ac57cb095c78eddeb131604","infoHashBuffer":{"type":"Buffer","data":[71,54,167,67,210,116,0,94,154,197,124,176,149,199,142,221,235,19,22,4]},"announce":[],"urlList":[]}}