{"title":"The Ed Show 9-19-12.mp4","uid":7655291,"size":172941104,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:475e060976aef06c03d18cafe16f45f67fb8e904&amp;dn=The+Ed+Show+9-19-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1348134527,"description":"The Ed Show; September 19, 2012.\n\n48 days until the election and the Republican establishment is freaking out over new portions of Mitt Romney's attack on 47 percent of Americans, captured by a hidden camera.\n\nRep. Debbie Wasserman Schultz, (D-FL) (Chair of the Democratic National Committee) joined Ed to analyze the Republican chaos.\n\nThe Romney camp wants to change the subject and talk about &quot;redistribution.&quot;  Great, Ed discussed Mitt Romney's kind of redistribution with Dean Baker (The Center for Economic and Policy Research). \n\nMitt Romney told his wealthy donors in May he would &quot;take advantage&quot; of a foreign policy crisis. Ed looked back at his reaction to last week's crisis in Libya with Jon Soltz (chairman of votevets.org, and Sam stein, political reporter for the Huffington Post).\n\nRomney's running mate, Paul Ryan, launched a second campaign ad for re-election to Congress. Does he know something we don't?  Ed asked Ryan's Democratic challenger, Rob Zerban (D-WI).\n\nSen. Sherrod Brown of Ohio joined Ed to discuss how Ohio voters are reacting to Mitt Romney's 47 percent disaster and much more.","torrent":{"xt":"urn:btih:475e060976aef06c03d18cafe16f45f67fb8e904","amp;dn":"The+Ed+Show+9-19-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"475e060976aef06c03d18cafe16f45f67fb8e904","infoHashBuffer":{"type":"Buffer","data":[71,94,6,9,118,174,240,108,3,209,140,175,225,111,69,246,127,184,233,4]},"announce":[],"urlList":[]}}