{"title":"Pixarra TwistedBrush Pro Studio v19.11 with Key [iahq76]","uid":7801141,"size":23761553,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:47e9bb99101360b1a6529d6d6a405c04b052f141&amp;dn=Pixarra+TwistedBrush+Pro+Studio+v19.11+with+Key+%5Biahq76%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TorDigger","files":3,"time":1352246570,"description":"TwistedBrush Pro Studio\n\nTwistedBrush Pro Studio: TwistedBrush Pro Studio includes everything that TwistedBrush has to offer including over 5000 brushes and full brush editing all at a great price. Great for original digital painting, photo editing and all forms of digital art.\n\nTwistedBrush Pro Studio Only Features \n\n1000's of Brushes: TwistedBrush Pro Studio includes as standard every brush available from Pixarra. Over 7000 at last count covering every area of digital art of great natural media to wild brushes to brushes with that can build a random tree or whole city skyline with a single stroke. Also only available in the Pro Studio version of TwistedBrush is the abilities to import user created brushes from the Pixarra forum.\nBrush Modifiers: Hundreds of quick and easy brush modifiers for changes the brush shape, texture, size, rotation and color combinations.\nBrush Editing: With TwistedBrush Pro Studio full brush editing capabilities are included. Using a specialized sequencing system over 350 brushes effects and 150 time envelopes modify the core brush types to produce the wide range of brushes. Share your brushes with other or import the brush codes from other users for an unlimited supply of brushes.\nSolutions: A one click solution for complex actions. Apply frames, advanced image processing, layouts and other tasks that might normally require significant work have been record for your easy play back. \nAdobe Photoshop (tm) Compatible Plug-ins: Use the wide range of industry standard plug-ins right in within TwistedBrush Pro Studio.\nMany More Features: Explore the wealth of other features in TwistedBrush Pro Studio and TwistedBrush Open Studion such as Blob Modeling, Mask Filters, Alpha Channel Filters, Editing ArtSets for brush management, References Images, Pattern Explorer, Recording your work directly to video, Recording your work to a script that can be played back (Pro), Page Explorer, Random Brush Generation, Auto Page Saving, high performance Undo and Redo, Create a PDF Slideshow, Scanning, Lanczos3 Image Scaling, Paper Textures and of course the extensive range of available brushes! \n\nSystem Requirements:\n\nWindows NT /XP / Vista / Windows 7\n500mb disk space\n1gb RAM (2gb or more recommended)\n\nHomepage: http://www.pixarra.com/\n\nInstallation Instructions:\n\n1. Install Program.\n2. Use given serial to register\n3. Done, Enjoy.","torrent":{"xt":"urn:btih:47e9bb99101360b1a6529d6d6a405c04b052f141","amp;dn":"Pixarra+TwistedBrush+Pro+Studio+v19.11+with+Key+%5Biahq76%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47e9bb99101360b1a6529d6d6a405c04b052f141","infoHashBuffer":{"type":"Buffer","data":[71,233,187,153,16,19,96,177,166,82,157,109,106,64,92,4,176,82,241,65]},"announce":[],"urlList":[]}}