{"title":"Runtastic Pro","uid":7795420,"size":4984266,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:481164cb27ca89a63bd0577e243c954936961518&amp;dn=Runtastic+Pro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"remotehugger2","files":1,"time":1352130846,"description":"Your personal tracking app for running, biking and other sports activities!\nTake your fitness to a new level with runtastic!\nruntastic uses GPS to map your fitness activities - running, biking, walking - and track your progress (distance, speed, calories, and more). Be part of a global fitness community that is both fun and motivational.\nPRO features:\n* Voice feedback during a workout: Get audio feedback for each mile or kilometer\n* Live tracking: Show your friends and family where you are\n* Cheering: Hear cheers and receive messages live from your friends and be motivated to go even further\n* Auto pause: Session is paused automatically when you stop movement (e.g. at a red light or tying your shoe). Works for running, biking, skating, cross-country skiing and handbiking.\n* runtastic Earth View: Watch your workouts in 3D, including mountains, monuments and buildings (free Google Earth App required)\n* Routes: create or find routes on runtastic.com and sync them to your Android smartphone\n* Colored traces: Different colors on the map indicate changes such as pace, elevation, slope etc.\n* Heart rate support: runtastic chest strap\n* Heart rate zone training and analysis: Choose a heart rate zone to monitor and optimize your training (i.e. fat-burning zone)\n* Split table with dynamic mile and kilometer split\n* Calorie goal: Set a specific calorie goal and use the voice feedback to reach your workout goal\n* Pace goal: Define your favorite pace\n* Geotagging: Take pictures during a workout and see these pictures online at your map trace\n* Weather and Temperature: Receive live weather information and save weather data automatically after a workout\n* Prediction of sunset and sunrise\n* Ad free\nFeatures:\n* Map your workouts in real-time with built-in GPS and monitor your progress (time, distance, speed, pace, calories, altitude, etc.)\n* Personal workout diary and metrics\n* Mapping: Detailed live mapping and historic mapping of previous sessions (Google maps)\n* Dashboard configuration: Display preferred statistics\n* Graphs: Get charts with altitude, pace, speed and heart rate information\n* Performance analysis with lap times\n* Enjoy your workouts with the integrated music player\n* Set goals for time and distance\n* Accurate calculation of elevation gain and loss\n* Integrate your runtastic activities to your MyFitnessPal account\n* Manual entry of workouts: Add treadmill, spinning and weight lifting workouts\n* Monthly and overall metrics for distance, number of workouts, duration and calories\n* Share your activities on Google+, Facebook and Twitter\n* LiveWareâ„¢ extension for SmartWatch","torrent":{"xt":"urn:btih:481164cb27ca89a63bd0577e243c954936961518","amp;dn":"Runtastic+Pro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"481164cb27ca89a63bd0577e243c954936961518","infoHashBuffer":{"type":"Buffer","data":[72,17,100,203,39,202,137,166,59,208,87,126,36,60,149,73,54,150,21,24]},"announce":[],"urlList":[]}}