{"title":"POtHS - SIN-ister Secrets - 96 - Hacking Democracy","uid":7723800,"size":3152615212,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:487dc02c8730d9182bd31e26982b36ca27bdfd23&amp;dn=POtHS+-+SIN-ister+Secrets+-+96+-+Hacking+Democracy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":-1,"time":1350150601,"description":"POtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - SIN-ister Secrets - 96 - Hacking Democracy\n\nPOtHS Comment: Watch it and Weep\nDescription:\n\nHacking Democracy:\nHacking Democracy is a 2006 documentary film by producer Robert Carrillo Cohen and producer / directors Russell Michaels and Simon Ardizzone, shown on HBO.  Filmed over three years it documents American citizens investigating anomalies and irregularities with 'e-voting' (electronic voting) systems that occurred during the 2000 and 2004 elections in the U.S.A., especially in Volusia County, Florida. The film investigates the flawed integrity of electronic voting machines, particularly those made by Diebold Election Systems, and the film culminates dramatically in the on-camera hacking of the in-use / working Diebold election system in Leon County, Florida.  In 2007 Hacking Democracy was nominated for an Emmy award for Outstanding Investigative Journalism.\n\nOrginial Uploader's notes:\nJesus Christ is Lord. Confess and Repent with your mouth and you will be saved.\n\nWhen you can't control the Politicians or the voters, then you control the counting! Go back to paper votes and we will have a President that was voted in!\n\nP.S. This movie is called &quot;Hacking Democracy&quot; because voting is a democratic process. They makers are aware that the U.S. was founded as a Constitutional Republic.\n------------------------------------------------------------\n\nUncounted - The New Math of American Elections:\n\n\nThese Torrents are currently on a Free Leech --  High Speed Server\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n\n                                           \n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n\n\n","torrent":{"xt":"urn:btih:487dc02c8730d9182bd31e26982b36ca27bdfd23","amp;dn":"POtHS+-+SIN-ister+Secrets+-+96+-+Hacking+Democracy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"487dc02c8730d9182bd31e26982b36ca27bdfd23","infoHashBuffer":{"type":"Buffer","data":[72,125,192,44,135,48,217,24,43,211,30,38,152,43,54,202,39,189,253,35]},"announce":[],"urlList":[]}}