{"title":"Total Commander 7.55 Portable (registered)","uid":6815459,"size":2848252,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4917cb0ab8a383ec1b074d292e02ffdaff2a2dc4&amp;dn=Total+Commander+7.55+Portable+%28registered%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"The_Duck1","files":-1,"time":1321145469,"description":"General features:\n\nBoth 32 bit and 16 bit versions available!\nLong filenames in Windows 95/98 and Windows NT (16 and 32-bit version)!\nDirect access to Network Neighbourhood\nSupports Drag &amp; Drop with Explorer/the Desktop etc.\nCommand line for starting of programs with parameters, simply by typing the program name or by pressing CTRL+ENTER or CTRL+SHIFT+ENTER. \nConfigurable button bar and Start menu (User-defined commands) to place your frequently used DOS or Windows programs into a drop-down menu. The actual directory and/or the file under the cursor can be delivered to the application. \nConfigurable main menu. \nBuilt in file viewer (Lister) to view files of ANY SIZE in hex, binary or text format, using either the ASCII- (DOS) or the ANSI- (Windows) character set. The line width and font size can now be changed. You can even view files inside archives! New: Support for Unicode UTF-8 format.\nBitmap viewer in Lister, additional formats through Irfanview (see addons).\nHTML- and Unicode-Viewer in Lister. \nParallel port transfer function (direct cable connection), works between Win95/98/NT/2000/3.1 and DOS!\nThumnbails view shows preview images in file lists. \nCustom columns view allow to show additional file details.\nMulti-rename tool to rename many files with specific rules, or by editing the names in a text editor\nTotal Commander comes in the following languages: English, German, French, Italian, Danish, Swedish, Norwegian, Dutch, Spanish, Czech, Russian, Polish, Hungarian, and now also Hebrew, Greek, Afrikaans, Catalan, Turkish and Ukrainian! \nThe help is available in English, German and French (separately).\nFile handling:\n\nExtended copying, moving, renaming and deleting of entire trees (Enables deleting &quot;full&quot; directories). \nCompare files by content, now with built-in text editor.\nSynchronize directories (with subdirs), or a directory with a ZIP file.\nEncode/Decode files in UUE, XXE and MIME format.\nSplit/Combine big files.\nSearch for duplicate files.\nShow/select files with specific search pattern, size, date or contents.\nRestore selection as it was before the last file operation (NUM /).\nEnhanced search function with full text search in any files across multiple drives, even inside archives.\nMulti-rename tool: Allows to rename multiple files in one step (Hotkey: Ctrl+M)\nOverwrite dialog allows to show preview images and custom fields\nWork with Windows Vista user rights model (user account protection)\nFTP client:\n\nBuilt-in FTP client supports most public FTP servers, and some mainframes\nFTP and WWW proxies for FTP connections; new also SOCKS4+5.\nFXP: Send files directly from one remote server to another.\nResume aborted downloads.\nAdd files to download list (through context menu) and download later. \nDownload in the background (separate thread).\nSecure FTP over SSL/TLS, enter the URL as follows: ftps://ftp.servername.com .\nNeeds OpenSSL dlls from www.openssl.org.\nArchive handling:\n\nArchives are handled like subdirectories. You can easily copy files to and from archives. The appropriate archiving program is automatically called. pkzip, arj, lha, rar, ace and uc2 are all supported. \nBuilt-in ZIP-compatible packer, supports long filenames! This packer is based on ZLIB by Info-Zip.\nInternal unpackers for ZIP, ARJ, LZH, TAR, GZ,CAB, RAR and ACE formats. \nAdditional packers can be added as plugins. See addons page.\nPack large archives in the background (separate thread).\nCopy files directly from one archive to another.","torrent":{"xt":"urn:btih:4917cb0ab8a383ec1b074d292e02ffdaff2a2dc4","amp;dn":"Total+Commander+7.55+Portable+%28registered%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4917cb0ab8a383ec1b074d292e02ffdaff2a2dc4","infoHashBuffer":{"type":"Buffer","data":[73,23,203,10,184,163,131,236,27,7,77,41,46,2,255,218,255,42,45,196]},"announce":[],"urlList":[]}}