{"title":"The Lemurian &amp; Atlantian Legacies","uid":7770874,"size":5109137580,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:497a4f9e29b04a2009cf1cd175da122f79219485&amp;dn=The+Lemurian+%26amp%3B+Atlantian+Legacies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GoAaT999","files":5,"time":1351525714,"description":"The First in the Series - The Lemurian &amp; Atlantian Legacies...the Secrets of the Arthurian &quot;Round Tables.&quot;  Lecture and two full day workshops filmed in NYC, Easter 2001.  \n\nIntroduces and explains the Great Atlantean conspiracy, the Grail Quest Wars, the Luciferian Covenant, the continuing battles to control Gate 11, the meaning of the Arthurian Legend and the Maji (Indigo/Eieyani) Grail Lines, the genealogy of the Human Angelic Race Line, the significance, meaning and purpose of the Flamekeepers, the 12 Tribes and the contracts they are called to serve now.  The workshop reveals the significance and detail of the &quot;Cycles of the Rounds,&quot; the contents of the major, suppressed, &quot;Books of Maps &amp; Keys, the secret of the Tribal Shield Rainbow Round Table and relationship to the Angelic Human's original Sacred Mission as well as the nature, composition and interface with the Earth's Planetary Divine Blueprint.  The 12 Cycles, simultaneous incarnation and relationship to human DNA is detailed, and the relationship to accelerated, personal, spiritual actualization is explained. \n\nTechniques for fastest activation of the personal 12 strand DNA are given, including: Tribal Shield Activation, Emerald &amp; Amethyst Awakenings, the Crystal Temple meditation, Cue Zone creation (safe zone/interdimensional interface) together with the original Anuhazi language Tribal Keys (Psonns) - the sound programs used to correctly activate the DNA and Primal Life Force Currents.  The materials from this workshop (and extended further in Kauai May 2001) form the foundations for full understanding and involvement with the Christos Re-alignment Mission occurring on all dimensions at this &quot;time.&quot; \n\nThis is the first detailed briefing and action plan for the awake Angelic Human released by the Guardian alliance - massively emphasizing the significance of our participation in divine Right Action and how it must be achieved! ","torrent":{"xt":"urn:btih:497a4f9e29b04a2009cf1cd175da122f79219485","amp;dn":"The+Lemurian+%26amp%3B+Atlantian+Legacies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"497a4f9e29b04a2009cf1cd175da122f79219485","infoHashBuffer":{"type":"Buffer","data":[73,122,79,158,41,176,74,32,9,207,28,209,117,218,18,47,121,33,148,133]},"announce":[],"urlList":[]}}