{"title":"Saints Row The Third [Xbox360][RegFree][JTAG]","uid":6804237,"size":6464690539,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:4a469a6e53f8e168c420ebfcfecbc0047d392d3c&amp;dn=Saints+Row+The+Third+%5BXbox360%5D%5BRegFree%5D%5BJTAG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mj23no","files":11,"time":1320796779,"description":"TITLE: Saint\\'s Row: The Third\n\nGENRE: Action\n\nPLATFORM: XBOX360 Jtag\n\nDEVELOPER: Volition\n\nUS PUBLISHER: THQ\n\nUK PUBLISHER: THQ\n\nNORDIC PUBLISHER: THQ\n\nONLINE PLAY: TBA\n\nREGIO: Region Free\n\nLANGUAGE: English\n\nGame info:\n\nYears after taking Stilwater for their own, the Third Street Saints have evolved from street gang to household brand name, with Saints sneakers, Saints energy drinks and Johnny Gat bobblehead dolls all available at a store near you. The Saints are kings of Stilwater, but their celebrity status has not gone unnoticed. The Syndicate, a legendary criminal fraternity with pawns in play all over the globe, has turned its eye on the Saints and demands tribute.\n\nRefusing to kneel to the Syndicate, you take the fight to Steelport, a once-proud metropolis reduced to a struggling city of sin under Syndicate control. Take a tank skydiving, call in a satellite-targeted airstrike on a Mexican wrestling gang, and defend yourself against a highly-trained military force using only a sex toy in the most outlandish gameplay scenarios ever seen, igniting a city-wide war that will set Steelport on fire.\n\nSaints Row: The Third gives you control of the Saints at the height of their power, and you live the life to show for it. Now Steelport is ripe for the taking, and it\\'s up to you to make the city your own. Mold the skyline based on your choices, outfit your crew in classy gangster gear or furry costumes, and make life-or-death decisions that will change Steelport, and the Saints, forever. This is now your city. These are now your rules. Strap it on\n","torrent":{"xt":"urn:btih:4a469a6e53f8e168c420ebfcfecbc0047d392d3c","amp;dn":"Saints+Row+The+Third+%5BXbox360%5D%5BRegFree%5D%5BJTAG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a469a6e53f8e168c420ebfcfecbc0047d392d3c","infoHashBuffer":{"type":"Buffer","data":[74,70,154,110,83,248,225,104,196,32,235,252,254,203,192,4,125,57,45,60]},"announce":[],"urlList":[]}}