{"title":"RAM Manager Pro v4.1.1 Final By bobiras2009","uid":7661185,"size":179310,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:4dee68ec662277283a407896465107e2339807de&amp;dn=RAM+Manager+Pro+v4.1.1+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1348310252,"description":"Follow my uploads here:                               &lt;a href=&quot;\nhttps://forum.suprbay.org/member.php?action=profile&amp;uid=311481&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/member.php?action=profile&amp;uid=311481&lt;/a&gt;    \n\nYou can make requests here:                                &lt;a href=&quot;\nhttps://forum.suprbay.org/forumdisplay.php?fid=4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/forumdisplay.php?fid=4&lt;/a&gt;\n                 \n\n                                By bobiras2009\t\t\n\n\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\nRequirements: Android 2.1 and up , root\nOverview: This application optimizes the RAM of all android devices and gives you better performance. \n\nROOT IS REQUIRED!!!\n\nFEATURES:\nâ˜…Balance - Option which makes your RAM to the best optimization, this option is for everyday using. Use this option when you want to have fast phone without lags.\nâ˜…Balance (More free memory) - This option is nearly the same as Balance, but this option should be advantageous for users who have more RAM than 512 MB. This option gives you more free memory but a bit reduces multitasking.\nâ˜…Balance (More multitasking) - This option is nearly the same as Balance, but this option should be advantageous for users who have less RAM than 512 MB. This option gives you more multitasking, but a bit reduces free memory.\nâ˜…Hard Gaming - Option which stabilizes your RAM for playing hardest games. Use this option for games which lag on your phone. Your games will run smooth without lags.\nâ˜…Hard Gaming (Less aggressive) - This option is similar to Hard Gaming but should be better for devices with RAM lesser than 512MB.\nâ˜…Hard Multitasking - Option for users which are really hard working on their phones. You can have a lot of running apps and quickly switch between them without lags.\nâ˜…Default (Samsung) - Default settings by Samsung, these settings are also used by LG, HTC, etc.\nâ˜…Default (Nexus S) - Default settings which are used by all Google devices.\nâ˜…Default - This option reverts your RAM to your default settings, which you had before you installed this app.\nâ˜…Lock launcher in memory\nâ˜…VM Heap size\nâ˜…Swap file - Improves a performance but it may degrade your SD card life\nâ˜…Memory info\nâ˜…Free memory meter\nâ˜…Widget\nâ˜…Chosen option is automatically set on each reboot\nâ˜…You can easily switch between all options without rebooting\n\nThis application optimizes the RAM of all android devices and gives you better performance. We tested and we're still testing the best RAM balance which makes your system as fast as possible. This application improves perfomance of your device in all directions. Switching between applications is very fast, your system will be smoother then ever before. You can fully use your multitasking and you still have as much memory as you need.\n\nThis application is the best solution for all who have problem with free memory, with multitasking, with slow swapping between applications or with slow performance of your device. I recommend to use this application to everybody who wants have better phone, because this application increases speed of your phone and other parameters which depend on RAM.\n\nDO NOT USE RAM SCRIPTS AND TWEAKS!!!\nIf you want be really sure that my application works, I recommend to not use any RAM scripts and tweaks.\n\nMORE FEATURES WILL BE ADDED!\n\nWhat's in this version:\nFixed one minor mistake in widget\n\n                                By bobiras2009\t\t","torrent":{"xt":"urn:btih:4dee68ec662277283a407896465107e2339807de","amp;dn":"RAM+Manager+Pro+v4.1.1+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4dee68ec662277283a407896465107e2339807de","infoHashBuffer":{"type":"Buffer","data":[77,238,104,236,102,34,119,40,58,64,120,150,70,81,7,226,51,152,7,222]},"announce":[],"urlList":[]}}