{"title":"Juxtapoz Art and Culture Magazine April 2011","uid":7694174,"size":83506673,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:4f7af6cce225633cfb0f236ea18bf5fcc77eb2a5&amp;dn=Juxtapoz+Art+and+Culture+Magazine+April+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LeonardTSpock","files":-1,"time":1349308425,"description":"Juxtapoz Art &amp; Culture Magazine April 2011 (PDF)\n\nFeaturing: Lee Quinones, Bill Daniel, Margaret Kilgallen, Dash Snow, Jimi Reid, Fab 5 Freddy, Rammellzee, Gusmano Cesaretti, Martha Cooper and much more...\n\nJuxtapoz Art &amp; Culture Magazine is a magazine created in 1994 by a group of artists and collectors including Robert Williams, Fausto Vitello, Craig Stecyk, Greg Escalante, and Eric Swenson to both help define and celebrate urban alternative and underground contemporary art. It was edited from 1996 to 2006 by Jamie O'Shea. Juxtapoz is published by High Speed Productions, the same company that publishes Thrasher Skateboard magazine in San Francisco, California.\n\nJuxtapoz launched with the mission of connecting modern genres like psychedelic and hot rod art, graffiti, street art, and illustration, to the context of broader more historically recognized genres of art like Pop, assemblage, old master painting, and conceptual art. Although based in San Francisco, Juxtapoz was founded upon the belief in the virtues of Southern California Pop Culture and the freedom from the conventions of the &quot;established&quot; New York art world. Ferus Gallery, run by Walter Hopps and Irving Blum in the 1950s and 1960s was the ultimate cultural touchstone for the magazine.\n\nJuxtapoz originally reflected Williams' own Kustom Kulture sensibility, a combination of California &quot;Big Daddy&quot; Ed Roth-style pop surrealism (identified by some as synonymous with lowbrow art and others as its own genre and the serious figurative craftsmanship that is more likely to be found among illustrators than fine artists today.\n\nJuxtapoz expanded its range in the early 2000s to cover other nascent styles and sub-genres of underground art. Young artists who have received coverage in Juxtapoz include KAWS, Mark Ryden, Barry McGee, Todd Schorr, Camille Rose Garcia, Tim Biskup, and Tom Sachs.\n\nAs of 2009, Juxtapoz had the largest circulation of any art magazine in the United States, (more than established counterparts like Art News, Art in America, and ArtForum). In addition to printed subscriptions which offer alternative cover images to the newsstand version, Juxtapoz is also available as an on-line digital subscription.\n\nGwynned Vitello, C.R. Stecyk III, along with Williams, are executive editors.","torrent":{"xt":"urn:btih:4f7af6cce225633cfb0f236ea18bf5fcc77eb2a5","amp;dn":"Juxtapoz+Art+and+Culture+Magazine+April+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f7af6cce225633cfb0f236ea18bf5fcc77eb2a5","infoHashBuffer":{"type":"Buffer","data":[79,122,246,204,226,37,99,60,251,15,35,110,161,139,245,252,199,126,178,165]},"announce":[],"urlList":[]}}