{"title":"98 &amp;lrm;&amp;ndash; 98 Degrees And Rising - 320cbr (Big Papi) 1998","uid":9353395,"size":116329164,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:52d2e34203e5f33afb2f43f0ec53c8ed43ab0a60&amp;dn=98+%26lrm%3B%26ndash%3B+98+Degrees+And+Rising+-+320cbr+%28Big+Papi%29+1998&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Big-Papi","files":-1,"time":1387181365,"description":"Source: 1998 CD 320cbr\n-\nBy Greg\n\nThis is a great CD! You have to buy it. I'm usually not into Motown groups, but 98 Degrees is cool. &quot;Invisible Man&quot; really got me hooked onto them and this album is even better than the first. For those of you who associate 98 Degrees with a boy band are definitely mistaken. They are mature and can actually sing (they don't dance, also).\n1. Intro - kinda corny but what intro isn't?\n\n2. Heat It Up - this song makes you wanna dance and is a good way to start the CD. I really like it.\n\n3. If She Only Knew - Good slow song. You can feel them, nice harmonies.\n\n4. I Do (Cherish You) - very sweet song. I'd love to play this at my wedding.\n\n5. Fly With Me - I love this song. The part where Jeff Timmons sings a long, high note is beautiful.\n\n6. Still - Nice slow song. This song was written by 98 Degrees and it's very heartfelt.\n\n7. Because Of You - this song will always be a hit. I never get tired of it.\n\n8. Give It Up - this is a nice a cappella song, also written by 98 Degrees, nice harmony\n\n9. Do You Wanna Dance - obviously, you could really dance to this song, you can also hear Drew and Justin who hardly get to sing, I like this song\n\n10. True To Your Heart - this was the first song I hear from this album and I loved it then and I still love, Stevie Wonder sounds good in this one\n\n11. To Me You're Everything - this song has boy band content, but it's still a good song\n\n12. The Hardest Thing - I love this song. It should have gone #1. Loved the video.\n\n13. She's Out Of My Life - This is definitely my all time favorite 98 Degrees song. The harmonies are so beautiful and Jeff sounds really good in this one. You might even cry.","torrent":{"xt":"urn:btih:52d2e34203e5f33afb2f43f0ec53c8ed43ab0a60","amp;dn":"98+%26lrm%3B%26ndash%3B+98+Degrees+And+Rising+-+320cbr+%28Big+Papi%29+1998","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52d2e34203e5f33afb2f43f0ec53c8ed43ab0a60","infoHashBuffer":{"type":"Buffer","data":[82,210,227,66,3,229,243,58,251,47,67,240,236,83,200,237,67,171,10,96]},"announce":[],"urlList":[]}}