{"title":"National Lampoon Magazines 1994 (Complete)","uid":7740437,"size":91962271,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:53ea3598a01c03c203016da85f546fd283f7c006&amp;dn=National+Lampoon+Magazines+1994+%28Complete%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"SplhcbPrime","files":-1,"time":1350610858,"description":"National Lampoon was a ground-breaking American humor magazine. Its success led to a wide range of media productions associated with the magazine's brand name. The magazine ran from 1970 to 1998, and was originally a spinoff of the Harvard Lampoon.\n\nThe magazine reached its height of popularity and critical acclaim during the 1970s, when it had a far-reaching effect on American humor. It spawned films, radio, live theatre, various kinds of recordings, and print products including books. Many members of the creative staff from the magazine subsequently went on to contribute creatively to successful media of all types.\n\nDuring the magazine's most successful years, parody of every kind was a mainstay; surrealist content was also central to its appeal. Almost all the issues included long text pieces, shorter written pieces, a section of actual news items (dubbed &quot;True Facts&quot;), cartoons and comic strips. Most issues also included &quot;Foto Funnies&quot; or fumetti, which often featured nudity. The result was an unusual mix of intelligent, cutting-edge wit, and crass, bawdy frat house jesting.[1] In both cases, National Lampoon humor often pushed far beyond the boundaries of what was generally considered appropriate and acceptable. As co-founder Henry Beard described the experience years later: &quot;There was this big door that said, 'Thou shalt not.' We touched it, and it fell off its hinges.&quot;\n\nThe magazine existed from 1970 to 1998. Many consider its finest period was 1971 to 1975, although it continued to be produced on a monthly schedule throughout the 1970s and the early 1980s and did quite well during that time.\n\nHowever, during the late 1980s, a much more serious decline set in. In 1989, the company that controlled the magazine and its related projects (which was part of &quot;Twenty First Century Communications&quot;) was the subject of a hostile takeover. In 1991 it was sold outright to another company, &quot;J2 Communications&quot;.\n\nAt that point &quot;National Lampoon&quot; was considered valuable only as a brand name that could be licensed out to other companies. The magazine was issued erratically and rarely from 1991 onwards. 1998 saw the last issue.\n\nNational Lampoon was started by Harvard graduates and Harvard Lampoon alumni Doug Kenney, Henry Beard and Robert Hoffman in 1969, when they first licensed the &quot;Lampoon&quot; name for a monthly national publication. The magazine's first issue was dated April 1970. The company that owned the magazine was called Twenty First Century Communications.\n\nAfter a shaky start for a few issues, the magazine very rapidly grew in popularity. Like the Harvard Lampoon, individual issues had themes, including such topics as &quot;The Future&quot;, &quot;Back to School&quot;, &quot;Death&quot;, &quot;Self-Indulgence&quot;, and &quot;Blight&quot;. The magazine regularly reprinted material in &quot;best-of&quot; omnibus collections.\n\nThe magazine took aim at every kind of phoniness, and had no specific political stance, even though individual staff members had strong political views.\n\nComedy stars John Belushi, Chevy Chase, Gilda Radner, Bill Murray, Brian Doyle Murray, Harold Ramis, and Richard Belzer first gained national attention for their performances in the National Lampoon's stage show and radio show. The first three subsequently went on to become part of Saturday Night Live's original wave of Not Ready for Primetime Players, Bill Murray replaced Chase when Chase left SNL after the first season, and Brian Doyle Murray later appeared as an SNL regular.  Harold Ramis went on to be a prolific director and writer working on such films as Animal House, Caddyshack, Ghostbusters, and many more. Brian Doyle Murray has had roles in dozens of films, and Belzer is an Emmy-award-winning TV actor.\n\n&quot;True Facts&quot; was a section near the front of the magazine which contained true but ridiculous items from real life, in other words, other than the masthead it was one of the very few parts of the magazine that was not fictional. &quot;True Facts&quot; included photographs of unintentionally funny signage, extracts from ludicrous newspaper reports, strange headlines, and so on. For many years John Bendel was in charge of the &quot;True Facts&quot; section of the magazine. Several &quot;True Facts&quot; compilation books were published in the 1980s and early 90s, and several all-True-Facts issues of the magazine were published during the 1980s.\n\nThe &quot;Funny Pages&quot; was a large section at the back of the magazine that was \ncomposed entirely of comic strips of various kinds. These included work from a number of artists who also had pieces published in the main part of the magazine, including Gahan Wilson, Ed Subitzky and Vaughn Bode, as well as artists whose work was only published in this section. The regular strips included &quot;Dirty Duck&quot; by Bobby London, &quot;Trots and Bonnie&quot; by Shary Flenniken, &quot;The Appletons&quot; and &quot;Timberland Tales&quot; by B. K. Taylor, &quot;Politeness Man&quot; by Ron Barrett, and many other strips. A compilation of Gahan Wilson's &quot;Nuts&quot; strip was published in 2011.\n","torrent":{"xt":"urn:btih:53ea3598a01c03c203016da85f546fd283f7c006","amp;dn":"National+Lampoon+Magazines+1994+%28Complete%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53ea3598a01c03c203016da85f546fd283f7c006","infoHashBuffer":{"type":"Buffer","data":[83,234,53,152,160,28,3,194,3,1,109,168,95,84,111,210,131,247,192,6]},"announce":[],"urlList":[]}}