{"title":"Mac Blu-ray Player 2.6.2.1029","uid":7762332,"size":37918692,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5435db5477210fdb5129b8aeebd9146527cc279c&amp;dn=Mac+Blu-ray+Player+2.6.2.1029&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"wallpwallpapers","files":2,"time":1351268417,"description":"The first universal Blu-ray player for Mac&amp;PC in the world Mac Blu-ray Player is a useful tool that was designed in order to help you easily load and play your Blu-rayIt can not only play blu-ray HD movies on Mac or PC, but also support any formats of movie, video, audio, music and photo you have ever seen. Particularly, you are able to add subtitles to movie or video, and share the movie's information with your best friends.\n\nFurthermore, it has very easy and convenient interface and layout as well as the hardware acceleration technique that can reduce power consumption effectively.\n\nHere are some key features of &quot;Mac Blu-ray Player&quot;:\n\nÂ· The first bluray player that can support Mac&amp;PC system.\nÂ· Perfect supporting Bluray decryption and is capable of removing AACS, BD+.\nÂ· DVD player as well. Supporting DVD decryption and DVD menu.\nÂ· Outstanding universal performance. Play anything including movie, video, audio, music and photo.\nÂ· Powerful High-Definition video player and hardware acceleration available.\nÂ· Playback position recording and resuming.\nÂ· All media formats supported here: Bluray, DVD, VideoCD, MOV, MKV, AVI, FLV, WMV, MP4, MPEG, RMVB, MP3, WMA, AAC, AC3 and more.\nÂ· Share movie or video information with friends anywhere and anytime.\nÂ· Nice interface and layout, as well as convenient operations.\n\nInstall:\n\n- run application\n- apply patch\n- enjoy!","torrent":{"xt":"urn:btih:5435db5477210fdb5129b8aeebd9146527cc279c","amp;dn":"Mac+Blu-ray+Player+2.6.2.1029","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5435db5477210fdb5129b8aeebd9146527cc279c","infoHashBuffer":{"type":"Buffer","data":[84,53,219,84,119,33,15,219,81,41,184,174,235,217,20,101,39,204,39,156]},"announce":[],"urlList":[]}}