{"title":"Gangstar West Coast Hustle","uid":7787823,"size":5102766,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:54bdb716b292e1666cb8285991693c4f08b48d45&amp;dn=Gangstar+West+Coast+Hustle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1351947700,"description":"Move to the West Coast and immerse yourself in L.A. gang life with the new Gangstar. Explore more realistic environments than ever for a unique gameplay experience. Complete 50 different missions that combine the best of action games and driving games.\n\nA unique feeling of freedom: Drive for miles and miles in massive, open-ended environments. Feel free to complete missions at your own pace, or just do absolutely anything you want!\n\nThe first mobile game that displays such a high level of graphics: a full-3D reconstruction of an entire city with detailed buildings, beautiful landscapes and \nimpressive cars that animate and take crash damage.\n\nGet rich or die trying! Explore the city, shoot and fight, steal vehicles, kill your enemies, and drive or walk anywhere. Go from rags to riches by connecting with relatives and helping out their gang, but beware of the police!\n\nIntuitive gameplay: Drive a variety of vehicles easily thanks to touch controls, and aim at a target simply by touching it on the screen. Shooting sequences are even more enjoyable thanks to the auto-aiming system.\n\nBe a gangster your way. Choose your favorite radio station: hip-hop, rap, reggae, electro, Californian punk rock, etc.","torrent":{"xt":"urn:btih:54bdb716b292e1666cb8285991693c4f08b48d45","amp;dn":"Gangstar+West+Coast+Hustle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54bdb716b292e1666cb8285991693c4f08b48d45","infoHashBuffer":{"type":"Buffer","data":[84,189,183,22,178,146,225,102,108,184,40,89,145,105,60,79,8,180,141,69]},"announce":[],"urlList":[]}}