{"title":"Hippo - Nature's Wild Feast - TVrip - Xvid - Slimoo","uid":6802199,"size":734091264,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:54f258a5b8e27e71f4e1457d824ebe6fa602924f&amp;dn=Hippo+-+Nature%5C%27s+Wild+Feast+-+TVrip+-+Xvid+-+Slimoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"_Slimoo_","files":1,"time":1320723005,"description":"Hippo: Nature's Wild Feast - TVrip - Xvid\n\n\n\nMark Evans explores the food chain in Zambia, examining footage recorded over the past fortnight of the various animals that have feasted on a dead hippo next to the Luangwa river. As well as analysing the rivalry between the lions, leopards and crocodiles that have made the giant creature their dinner, Evans looks at the biological decomposition which has taken place\n\nA new high-tech natural history event, Hippo: The Wild Feast presents the most comprehensive illustration to date of nature's food chain in action. \n\nThe programme, anchored live from Zambia's Luangwa Valley, shows the events of a fortnight as an entire ecological system including predators, scavengers, birds and insects consume the enormous carcass of an adult hippo. \n\nLocated by a section of the Luangwa river, a prime location for some of the biggest predators in Zambia, the hippo has been in the sights of the notoriously vicious honey badger, leopards, lions, Nile crocodiles, hyenas, wild dogs, baboons, monitor lizards and marabou storks: known as the 'undertaker birds' and which use their 10-foot wingspan to swoop down and see off other smaller vultures. \n\nPresenter Mark Evans speaks to animal and entomology experts and local guides about the animals' behaviour and biological decomposition. \n\nWith the potential for fierce showdowns between rivals for these vital calories, Evans explains the different eating mechanisms of the animals: from crocodiles, who use each other as leverage for a 'death roll' to twist off the meat, to marabou storks, who gulp down pounds of flesh, which they store in their gullets. \n\nThe programme also features footage from the dens of predators, staked out by specialist wildlife cameramen.\n\n\n++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n\n\n\nFormat                                   : AVI\nFormat/Info                              : Audio Video Interleave\nFile size                                : 700 MiB\nDuration                                 : 1h 9mn\nOverall bit rate                         : 1 415 Kbps\n\nCodec ID                                 : XVID\nCodec ID/Hint                            : XviD\nDuration                                 : 1h 9mn\nBit rate                                 : 1 292 Kbps\nWidth                                    : 704 pixels\nHeight                                   : 400 pixels\nDisplay aspect ratio                     : 16:9\nFrame rate                               : 25.000 fps\n\n\n\n.\n\n\n","torrent":{"xt":"urn:btih:54f258a5b8e27e71f4e1457d824ebe6fa602924f","amp;dn":"Hippo+-+Nature%5C%27s+Wild+Feast+-+TVrip+-+Xvid+-+Slimoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54f258a5b8e27e71f4e1457d824ebe6fa602924f","infoHashBuffer":{"type":"Buffer","data":[84,242,88,165,184,226,126,113,244,225,69,125,130,78,190,111,166,2,146,79]},"announce":[],"urlList":[]}}