{"title":"Melissa Harris-Perry 9-9-12.mp4","uid":7624679,"size":385893078,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5654363caaa4e344fb871f2630540c3c432679b1&amp;dn=Melissa+Harris-Perry+9-9-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":-1,"time":1347409219,"description":"Melissa Harris-Perry; Sunday, September 9, 2012.\n\nSunday, MHP and her guests looked at power from a number of perspectives. First, they introduced the latest edition of This Week in Voter Suppression!^[TM] (they're about to trademark that), digging through the fine print of Pennsylvania's voter-ID legislation. Then they looked at how power is used in actual governance, from domestic to foreign policy. And as the 11th anniversary of the 9/11 attacks approaches this week, they examined the power of violence and terrorism in our lives, and how the definitions of those words have changed since that horrible day. Lastly, Melissa ended the show with a hopeful Footnote which you don't want to miss.\n\nMHP's guests included:\n\nMellisa talked about the Pennsylvania voter ID case to start.\n\nJudith Browne Dianis (co-director of the Advancement Project), Kenji Yoshino (law professor at New York University), Dorian Warren (Assistant professor at Columbia University, specializes in the study of inequality and American politics), Mickey Edwards (former U.S. Congressman, vice president of the Aspen Institute, and author of &quot;The Parties Versus The People&quot;) talked about blocking the vote.\n\n\nKristen Bucaria (MSNBC page) joined via satellite to discuss voter ID.\n\nEboo Patel (author of &quot;Sacred Ground&quot; and founder and president of Interfaith Youth Core), Amaney Jamal (politics professor at Princeton University and author of &quot;Of Empires and Citizens), Valarie Kaur (Sikh American filmmaker and director of Groundswell, an initiative at Auburn Seminary).\n","torrent":{"xt":"urn:btih:5654363caaa4e344fb871f2630540c3c432679b1","amp;dn":"Melissa+Harris-Perry+9-9-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5654363caaa4e344fb871f2630540c3c432679b1","infoHashBuffer":{"type":"Buffer","data":[86,84,54,60,170,164,227,68,251,135,31,38,48,84,12,60,67,38,121,177]},"announce":[],"urlList":[]}}