{"title":"The Ed Show 9-27-12.mp4","uid":7683192,"size":190175777,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:565f6327f64967af246475008d473f3afbda45e3&amp;dn=The+Ed+Show+9-27-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1348875324,"description":"The Ed Show; September 27, 2012.\n\n40 days until election day, but the presidential election is officially underway (early voting). 27 states allow early voting, including two that started today. And early signs show Mitt Romney is in big trouble.\n\nEd started with Rep. Debbie Wasserman Schultz, (D-FL) (Chair of the Democratic National Committee), about the Democratic effort to get out the vote in Iowa and beyond.\n\nThen, Romney revealed the real goals of Bain capital in a newly discovered video.  \n\nEd asked Robert Reich (former U.S. Labor Secretary and UC Berkeley Professor), what Romney means when he says he's harvesting companies.\n\nMitt Romney said he will use the debate to fact check the president's ad claims.  Ed had a Romney fact check of his own with Steve Benen (Contributing Writer and Blogger with the Washington Monthly, MSNBC contributor, and producer for The Rachel Maddow Show).\n\nThe guy who has no idea what he's talking about when it comes to women has the nerve to call U.S. Sen. Claire McCaskill unladylike.  Ed brought the latest on the Todd &quot;legitimate rape&quot; Akin disaster with Keli Goff (author of &quot;The GQ Candidate&quot; and Political Correspondent for TheRoot.com), and Sam Stein (Huffington Post Political Editor).\n\nEd also had new details about Romney's past investments in China.\n\nAnd in the Big Finish, George W. Bush is staying away from the campaign trail, but his trip to the Cayman Islands could be a headache for Mitt Romney. Jonathan Alter (MSNBC Political Analyst and Bloomberg View Columnist), weighed in. ","torrent":{"xt":"urn:btih:565f6327f64967af246475008d473f3afbda45e3","amp;dn":"The+Ed+Show+9-27-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"565f6327f64967af246475008d473f3afbda45e3","infoHashBuffer":{"type":"Buffer","data":[86,95,99,39,246,73,103,175,36,100,117,0,141,71,63,58,251,218,69,227]},"announce":[],"urlList":[]}}