{"title":"MS2 v1.2.apk","uid":7746226,"size":7172090,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:56c990f22e94631ee32b5ce6d9bb95e04de6ad1b&amp;dn=MS2+v1.2.apk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"biff_wigg","files":1,"time":1350772842,"description":"Mortal Skies 2 , Blast your way to freedom\n1950, World War 2 never ended and German and Japanese forces have conspired to attack the free world.\nOn your last mission you were captured and put in a prison camp. Now it's time for payback.\nEscape the prison camp and blast your way through enemy lines. Will you succeed to destroy them and finally make an end to World War 2 ?\nMortal Skies 2 is a Classic Shoot Em Up arcade action game with action packed gameplay and awesome graphics. Discover this fast paced shoot em up action game with hours, even days of fun. Collecting all achievements will keep you challenged to unlock extra planes.\nFeatures:\n- Extra attention has been given so that it runs smooth on even 1st generations iphones.\n- Earn XP by playing the game and reaching milestones in the game.\n- This XP can be used to improve your plane's speed, armor, bullits and bonuses.\n- 9 big levels across varied environments.\n- Huge diverse endbosses including Bombers, Tanks, Choppers and even a one on one dogfight endboss.\n- 13 Weapon upgrades/power-ups.\n- Awesome Achievement missions: Earn Bronze, Silver and Gold cups for each of the 9 different achievement missions. Different achievements require different gameplay tactics, so you will be challenged to keep playing.\n- OpenFeint and GameCenter support. Submit your highscore and compete with other players worldwide to be the best Mortal Skies 2 pilot in the world.\n- Difficulty settings can be adjusted using a slider bar (100 different difficulty levels !). Increasing the difficulty will also increase the maximum available highscore. So you will always be challenged to set that score.\n- Control your plane by using Touch controls or Accelerometer.","torrent":{"xt":"urn:btih:56c990f22e94631ee32b5ce6d9bb95e04de6ad1b","amp;dn":"MS2+v1.2.apk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56c990f22e94631ee32b5ce6d9bb95e04de6ad1b","infoHashBuffer":{"type":"Buffer","data":[86,201,144,242,46,148,99,30,227,43,92,230,217,187,149,224,77,230,173,27]},"announce":[],"urlList":[]}}