{"title":"BRANDED mp4 cam - GLOBE","uid":7724276,"size":893180432,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:579a47a9d90cbd13ad14fd0631f37618073c3c3c&amp;dn=BRANDED+mp4+cam+-+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"globeplus","files":-1,"time":1350160246,"description":"* MP4 CAM  * 01H42M08S    * + 1500 Bitrate   \n\n\n* Worked with the Dub plugins followed by MP4 conversion\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\nPlot\n\nAs the movie begins, the names of famous visionaries including Joan of Arc, Einstein and Alexander the Great flash on the screen. A caption reads, &quot;All of them saw things others didn't see. All of them changed the world.&quot;\n\nIn the early 1980s, in Soviet Russia, young Misha Galkin is in a public park at night looking at the stars. Suddenly the stars shift into the outline of a cow's head, which turns and looks at him. Moments later, Misha is struck by lightning. A woman examines him and, seeing that he is still alive, predicts that his life will not be ordinary.\n\nIn present-day Russia, Misha (Ed Stoppard) has grown up to become a high-powered marketing executive working with Bob Gibbons (Jeffrey Tambor). When Bob's niece Abby (Leelee Sobieski) comes to visit from America, Bob warns Misha to keep his hands off the girl, but despite Bob's warning, Abby and Misha drift into a relationship. Misha tells Abby various trivia about the history of marketing, such as that Vladimir Lenin invented modern marketing, and that Communism was the first true global brand.\n\nMeanwhile, on a private Polynesian island, an unnamed marketing guru (Max von Sydow) is meeting with the executives of fast food companies. The guru tells them that, to make fast food profitable again, they must change public perceptions of beauty and &quot;make fat the new fabulous.&quot; An unseen voice-over narrator says that the companies agreed to carry out the guru's plan.\n\nIn a series of documentary-style flashbacks, narrated by the same unseen narrator, we see how Misha used his natural marketing savvy to rise from a poor clerk to a marketing exec. Misha's big break came when he met Bob, an American hired to spread Western brands and businesses in post-Communist Russia. In the present, Bob discovers Abby's relationship with Misha and is furious.\n\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n* GLOBE FILES 2012\n\n\n\n ","torrent":{"xt":"urn:btih:579a47a9d90cbd13ad14fd0631f37618073c3c3c","amp;dn":"BRANDED+mp4+cam+-+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"579a47a9d90cbd13ad14fd0631f37618073c3c3c","infoHashBuffer":{"type":"Buffer","data":[87,154,71,169,217,12,189,19,173,20,253,6,49,243,118,24,7,60,60,60]},"announce":[],"urlList":[]}}