{"title":"Casting - Petra","uid":7769073,"size":1269973461,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:5a168e370bc493f2d8380e7c1c5feb51b73987bb&amp;dn=Casting+-+Petra&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"R0thschild","files":2,"time":1351466560,"description":"Gallery: \n &lt;a href=&quot;\nhttp://imagedomino.com/?g=233905&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imagedomino.com/?g=233905&lt;/a&gt;\n\nFormat...: MOV, 1920x1080\nGenre....: Amateur Girls, Reality Porn, Hardcore Sex\nWebsite..: http://www.casting.xxx\nReview...: http://www.thebestporn.com/review/castingxxx/\n\nPetra (37 mins) Petra's a real sweet heart with silky smooth hair and\na tight moist pussy. When she came into my office she looked kind of\nfamiliar and I was wondering to myself 'have I fucked this girl\nbefore'... There's been so many now that I have trouble keeping\ntrack, but anyway I was pleased with the situation because she was\nlooking hot. I told her straight away that I would delete the video\ntapes if I did not work with her, and she didn't seem to mind... I\nwas fantasising about getting her jeans off and seeing what she had\nunderneath the bonnet. When I asked her what she wanted to do she\nsaid that she wanted to be a photo model, but not just any photo\nmodel, a naked one... She was very interested in working in the adult\nindustry so that made my job a lot easier. She was 22 years old and\nwanted a change of profession because working in a restaurant was\ngetting her down and she wanted more money and more opportunities...\nShe told me that she had a boyfriend so this was a big secret for\nher... Ooof poor guy! I told her about the money and travelling to\nTokyo and she was getting as excited as my Johnson was under my\ndesk.... Aftter I took the photos of her I went over and started\nrubbing her pussy, and she was loving it. So I went down to finish\nthe job with my tongue... We were both really horny by this point so\nI went in for the 69 and things escalated from there... I finished\noff with a creampie which went slighty wrong because I came a bit too\nquick. Still it was an awesome afternoon. Nice one Petra.","torrent":{"xt":"urn:btih:5a168e370bc493f2d8380e7c1c5feb51b73987bb","amp;dn":"Casting+-+Petra","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a168e370bc493f2d8380e7c1c5feb51b73987bb","infoHashBuffer":{"type":"Buffer","data":[90,22,142,55,11,196,147,242,216,56,14,124,28,95,235,81,183,57,135,187]},"announce":[],"urlList":[]}}