{"title":"Searchdaimon enterprise search server for VMware, v2.6","uid":7627509,"size":715516611,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5a5090f67fa3e81a5b8d7ce745b1e63bb4b0b874&amp;dn=Searchdaimon+enterprise+search+server+for+VMware%2C+v2.6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"runarbu","files":3,"time":1347460022,"description":"Searchdaimon ES for VMware  &lt;a href=&quot;\nhttp://www.searchdaimon.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.searchdaimon.com/&lt;/a&gt;\n\n\n- Description\n\nES is a free enterprise search solution, suitable for corporate use, web search or adding search functionality to cloud applications.\n\n\nSearchdaimon ES is full future enterprise search solution with minimum setup requirements. It will let you search information from documents, e-mail, e-mail attachments, customer relation systems and other content sources. \n\nES supports many data sources and the possibility of attribute navigation and collection sorting. It will maintain existing permissions, prohibiting non-authorized users from reading documents. You may use it together with Microsoft Active directory to provide a secure search function for your enterprise, as a public available search engine for your webpage, or as a OEM to add search to your cloud or SaaS application. \n\nIn addition to the build-in data connectors you may write your own connectors to index other data source, or push data over http. You can also create your own search frontends and retrieve search results by xml and rss. \n\n\n\n- Features &amp; Benefits\n\nES integrates with Active Directory. Support indexing of file shares, Microsoft Exchange, intranet and external websites, Microsoft Sharepoint and the possibility to write your own connectors.\n\n\n* A powerful interface that can search across content sources.\n* Filtering and sorting functions where you can restrict your search to type of document, data source, date and meta-information such as contacts, customers, sales and projects. \n* Content federation where structured data can be presented as a table among the results.\n* Suggest function that suggests query words while you are typing.\n* Query spell checking.\n* Inflections and stemming so a search for &quot;car&quot; also shows documents containing &quot;cars&quot;, etc.\n* Index unlimited amount of data.\n\nThis version of ES also has the VMware Client Tools installed. We also have a version of ES without any vender specific tools installed. Please consider using that version if you are not on VMware.\n\n\n\n- Free\n \nThe free version comes with a license for 10 users. Except from the user limitation the free ES is exactly the same as the full version, and have no hard limits on document count or index size. \n\n\n\n- Geting started\n\nThe ES virtual appliance contains a striped down Linux operating system and our software fully configured, ready to run, without the need for any local installation. You will need a special program called a hypervisor to do this. One solution is to use VMware Player that can be downloaded free of charge from http://www.vmware.com/products/player/\n\nFull documentation, system requirements and &quot;how to get started&quot; manual is available at &lt;a href=&quot; http://www.searchdaimon.com/documentation/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.searchdaimon.com/documentation/&lt;/a&gt;\n\nA newer version of ES may be available at &lt;a href=&quot; http://www.searchdaimon.com/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.searchdaimon.com/download/&lt;/a&gt;  .\n\n\n \n- Support\n\nWe will be her for you, so don't hesitate to contact support or post in the community forum if you get stuck. We will try to help everyone, inclusive free members.\n\n\n\n- Tags &amp; Keywords\n\nenterprise search, free search, search, search engine, erp, corporate search\n\n\n\n- More information \n\nFor more information please visit &lt;a href=&quot; http://www.searchdaimon.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.searchdaimon.com/&lt;/a&gt;  or contact Runar Buvik by email  [rb at searchdaimon dot com].","torrent":{"xt":"urn:btih:5a5090f67fa3e81a5b8d7ce745b1e63bb4b0b874","amp;dn":"Searchdaimon+enterprise+search+server+for+VMware%2C+v2.6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a5090f67fa3e81a5b8d7ce745b1e63bb4b0b874","infoHashBuffer":{"type":"Buffer","data":[90,80,144,246,127,163,232,26,91,141,124,231,69,177,230,59,180,176,184,116]},"announce":[],"urlList":[]}}