{"title":"Wrong Turn(2003)DVDRip.AC3(ENG)-DROCK","uid":6806516,"size":733951443,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5cd6193fc4de0df4b4338761079dab5322606c0c&amp;dn=Wrong+Turn%282003%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1320882487,"description":"A turn down an uncharted dirt road leads six young people into a night of pure terror in this horror story. Chris (Desmond Harrington) is driving through West Virginia on his way to a job interview when an auto accident slows highway traffic to a near standstill. Afraid he'll be late, Chris takes a detour down an old dirt road; a distracted Chris doesn't see an SUV stuck in the middle of the road before it's too late, and he plows into the back after his tires suddenly blow. The driver of the SUV, Jessie (Eliza Dushku), was out on a camping trip with four of her friends -- Evan (Kevin Zegers), Francine (Lindy Booth), Carly (Emmanuelle Chriqui), and Scott (Jeremy Sisto) -- when their tires went out, and as Jessie and Chris compare notes on their accidents, they discover that the road has been sabotaged with barbed wire. With both parties in need of a telephone, Evan and Francine are left to look after the cars while the other four set out to find help. However, Evan and Francine soon discover they've been led into a horrible trap, and as Chris, Jessie, and their friends search for help, they find that they've fallen victim not to local pranksters, but a gang of inbred backwoods killers with a taste for blood. Wrong Turn was produced in part by Stan Winston, a legendary special-effects artist whose work has appeared in such films as Jurassic Park, Aliens, and Terminator 2: Judgment Day. \n\nRipped with Handbrake.\n\nLength: 1 Hour 24 Minutes\n\nFile Type: MP4\n\nFrame Width: 624\n\nFrame Height: 352\n\nFrame Rate: 29fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:5cd6193fc4de0df4b4338761079dab5322606c0c","amp;dn":"Wrong+Turn%282003%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cd6193fc4de0df4b4338761079dab5322606c0c","infoHashBuffer":{"type":"Buffer","data":[92,214,25,63,196,222,13,244,180,51,135,97,7,157,171,83,34,96,108,12]},"announce":[],"urlList":[]}}