{"title":"Link! 4.0 for iPhone","uid":7716286,"size":23327392,"categoryP":"applications","categoryS":"ios_(ipad_iphone)","magnet":"?xt=urn:btih:5db9cb196239edafa4a39cc3342251d9cd201d62&amp;dn=Link%21+4.0+for+iPhone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"haxmania1","files":-1,"time":1349939374,"description":"Description:\n\n*****\nVersion 4.0 contains improved physics simulation, and many updates to existing levels based on user feedback.\n*****\n\n&quot;Link&quot; is a modern take on the classic 80's game. Build bridges using wood and steel girders, and in more advanced levels with stone blocks and rope cables.\n\nAs a 19th-century industrialist, you're building trains across the great West. The expansion of America depends on the delivery of coal, lumber, crates, animals, and of course passengers across a variety of valleys, ditches, waterways, mountain passes, caves, and canyons. \n\nLink uses some of the principles of civil engineering to create stable structures. Creating bridges using randomly-connected girders, cables, and stone will probably result in a lot of casualties. Instead, you'll need to think like a designer. Will a rectangular or triangular girder structure provide less strain on the girder joints? Does it make more sense to attach cables near the beginning, end, or middle of the bridge? If there is no place to attach cables, what type of structure can you build on which to attach cables? \n\nYou should also consider the physical properties of wood versus steel. Steel is heavier and sturdier, while wood is lighter but probably not able to handle as much stress. Concrete is the heaviest and sturdiest of all construction elements, but you have a limited number of blocks to use and a limited number of places to put them. Cables provide some additional support from above, but they are also limited and faily weak, and in some cases you will need to build a support structure for them.\n\nAlso consider using the &quot;Tradin' Post&quot; (available in select advanced levels) to trade your materials and maximize your score.\n\nWith 100 level, Link will provide you with days of enjoyment and frustration. But in each level, you have a limited number of construction elements and structural anchors. On levels with concrete blocks, the tops of blocks also provide additional anchor points. Use these blocks carefully, though! An improperly placed anchor can make all the difference between success and failure.\n\nSeveral user controls are available, including zoom in/zoom out, grid overlay toggle, show/hide bottom controls, reset the entire level, undo, and delete (the &quot;X&quot; icon). This should be fairly obvious based on the icon. At the far right, bottom corner is an up/down arrow to toggle the bottom control bar display.\n\nMany of us have built bridges with toothpicks in school projects, or created a sturdy structure with a limited number of tools and materials. We all know how challenging - and rewarding - this can be. Now you can have that kind of fun in your pocket or purse all the time with Link!\n\nIf you believe that you have achieved an optimal bridge for the level, please take a screenshot of your bridge (or just a normal camera picture!), and post it to the Link Facebook wall at:\n\n\nThe makers of Link! try to reply to all queries within 24 hours.\n\nIf you're having difficulty finding a good solution for a particular level, check our Facebook page for ideas and comments from other Link users. This is also a good place to brag about your achievements! :)","torrent":{"xt":"urn:btih:5db9cb196239edafa4a39cc3342251d9cd201d62","amp;dn":"Link%21+4.0+for+iPhone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5db9cb196239edafa4a39cc3342251d9cd201d62","infoHashBuffer":{"type":"Buffer","data":[93,185,203,25,98,57,237,175,164,163,156,195,52,34,81,217,205,32,29,98]},"announce":[],"urlList":[]}}