{"title":"Ursa Software ScreenMon 2.35","uid":7799054,"size":2329779,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5dfa99c8c1ecf887d2279bc7f9d1faef2a12eed8&amp;dn=Ursa+Software+ScreenMon+2.35&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"wallpwallpapers","files":-1,"time":1352231881,"description":"ScreenMon a computer screen recorder and spy monitor software. It allows to secretly capture screen activities and mouse movement on your computer into WMV files uninterruptedly or schedule your recordings as you fixed; or you can choose to capture specified screen activity which is useful and important to your monitoring target. ScreenMon is just like a desktop camera. Every desktop and cursor activity, keystroke typing, some window or program opening or closing, website browsing, IM chatting and all other PC activity will be captured and all of these can display incessantly in the video files. This monitoring software was made in hidden when it works. It is an excellent spy software to monitor employees, child, cheating spouse.\n\nScreenMon - a computer screen recorder and spy monitor software. It allows to secretly capture screen activities and mouse movement on your computer into WMV files uninterruptedly or schedule your recordings as you fixed; or you can choose to capture specified screen activity which is useful and important to your monitoring target.\n\nScreenMon is just like a desktop camera. Every desktop and cursor activity, keystroke typing, some window or program opening or closing, website browsing, IM chatting and all other PC activity will be captured and all of these can display incessantly in the video files. This monitoring software was made in hidden when it works. It is an excellent spy software to monitor employees, child, cheating spouse.\n\nInstall:\n\n- run application\n- insert serial","torrent":{"xt":"urn:btih:5dfa99c8c1ecf887d2279bc7f9d1faef2a12eed8","amp;dn":"Ursa+Software+ScreenMon+2.35","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5dfa99c8c1ecf887d2279bc7f9d1faef2a12eed8","infoHashBuffer":{"type":"Buffer","data":[93,250,153,200,193,236,248,135,210,39,155,199,249,209,250,239,42,18,238,216]},"announce":[],"urlList":[]}}