{"title":"POtHS - Biblical Times - 04 - Paul and Peter","uid":7770870,"size":9007087833,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5e2969aef4d0febbed0165013f266cb47227828b&amp;dn=POtHS+-+Biblical+Times+-+04+-+Paul+and+Peter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"POtHS11","files":73,"time":1351525439,"description":"POtHS\nPouring Out the Holy Spiritruth\n\n\nBiblical Times\n\n\nPOtHS - Biblical Times - 04 - Paul and Peter\n\n\n\nPOtHS says: This is one of the Best Bible Movies I have seen. Omar is outstanding.\n\nDescription:\n\nSaint Peter:\n\nCategory Dramas DVDs, Christianity Movies, Epic\nStarring Omar Sharif, Daniele Pecci, Claudia Koll\nDirector Giulio Base\n\nAs a dedicated follower of Christ, Peter spreads the message of the Christians across the land, often staying only one step ahead of those determined to persecute him. But on the road to Damascus, Peter comes face-to-face with a stranger who shows him the only way - he must put himself on the cross in order to bring peace to Rome. Omar Sharif stars.\n\nPaul The Emissary:\n\nThe world-changing saga of Paul the Apostle.\n\nThe early first century followers of Jesus were a small, struggling group within Judaism who seemingly posed no threat to anyone, certainly not the mighty Roman empire. But there was one determined to see this fledging faith exterminated. His name was Saul and he became the greatest persecutor of the early church. But within a matter of a few years, the Christians fiercest opponent became its most effective advocate.\n\n\nPeter &amp; Paul\n\nAnthony Hopkins stars in this epic network television mini-series that brings to life the precarious existence of early Christianity. The new movement is beset by violent opposition from without and constant turmoil from within. Two key leaders emerge -- Peter and Paul -- who struggle to keep the faith alive. This dramatic presentation follows the pair, together and separately, through three epochal decades. Included are the stoning of Stephen, the road to Damascus, their encounter in Jerusalem, their conflicts over how the word of Christ should be spread.  \n\nPaul The Apostle:\n\nI was pleased with the High Quality of Film work and actors. The Story was very close to what the Bible says and I really enjoyed it. It was informative as it show, the persecution the Early Christians received from the Jews and The Romans.\n\n\nFrom the Emmy award-winning director of Joseph and Jesus comes the story of Paul the Apostle. This miniseries chronicles the life of Christ's most prolific messenger. Paul, originally known as Saul of Tarsus, was a persecutor of Christians until Jesus came to him in a vision. Forever changed, Paul withstood persecution and imprisonment and with unflagging determination he spread the word of Christ. Beautifully shot in the Moroccan desert, Paul the Apostle is a sweeping saga of a man whose story continues after the Passion of Christ.\n\n\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n\n                                           \n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n","torrent":{"xt":"urn:btih:5e2969aef4d0febbed0165013f266cb47227828b","amp;dn":"POtHS+-+Biblical+Times+-+04+-+Paul+and+Peter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e2969aef4d0febbed0165013f266cb47227828b","infoHashBuffer":{"type":"Buffer","data":[94,41,105,174,244,208,254,187,237,1,101,1,63,38,108,180,114,39,130,139]},"announce":[],"urlList":[]}}