{"title":"Maxprog iCash v7.4.8 with Key [iahq76]","uid":7801973,"size":12501742,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5f311c1b4cd5a6c8a0f80014907dc2a339202262&amp;dn=Maxprog+iCash+v7.4.8+with+Key+%5Biahq76%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TorDigger","files":3,"time":1352304754,"description":"iCash\n\niCash is a software intended to control your personal finances, keeping track of incomes, expenses, credits, debts and Banks transactions for you. As simple as creating the accounts you need and move money between them! You don't even need to know about accounting or even care about it! Your finances depend largely on good organization that lets you know where your money comes from and to where it goes\n\niCash is an easy-to-use, full featured and multi-purpose Personal Finance Manager tool for Macintosh and Windows intended to help you control all kinds of money issues. iCash can serve several small accounting needs for either private users, or clubs, associations, self-employed, small businesses or simply to be used at home, making keeping track of incomes, expenses and Banks transactions a snap. With a few clicks you can begin creating accounts and making transactions in minutes.\n\niCash is versatile and user-friendly. For this reason it doesn't use the principle of double-entry bookkeeping making it much easier to be used by people with very little or no accounting knowledge at all. Simply create accounts for all your expenses, incomes, Banks... and start moving money between them! iCash will then allow you to find out where all your money comes from and where it goes. All accounts are well organized according to user-defined categories and built-in types so reports can be tailored to include all records or only ones meeting specified criteria. iCash also allows you to have as many money manager documents as necessary so you can control almost anything from Clubs, associations, home and so on at the same time.\n\nKey Features\n\nDetects and use your language if available.\nNo accounting knowledge required, no double-entry bookkeeping.\nEasy-to-use, straightforward and user-friendly all-in-one interface.\nShare your documents between your Mac and your PC hassle free.\nUnlimited Accounts, Categories and Contacts.\nLogical Account classification by category and type.\nMultiple currencies support with exchange rate manager.\nTransaction auto-balance and reconciliation.\nScheduled and recurring transactions support.\nFull Budget support with customizable calculator.\nProject categorization of transactions for queries and reporting.\nPre-defined customizable Reports.\nAdvanced recordable Queries and Statistics.\nChart creation by account, type, category including Profit &amp; Loss.\nFast Import and Export of Categories, Accounts and Transactions. (OFX, QIF, CSV)\nPowerful SQL database engine with auto-backup protection.\nMulti-document interface with password protection.\nNative versions for Mac OS and Windows.\n\nSupported OS:\n\nAll Windows\n\nHomepage: http://www.maxprog.com/site/software/personal-finance/icash_sheet_us.php\n\nInstallation Instructions:\n\n1. Install program.\n2. Use given key to register application.\n3. Done, Enjoy.","torrent":{"xt":"urn:btih:5f311c1b4cd5a6c8a0f80014907dc2a339202262","amp;dn":"Maxprog+iCash+v7.4.8+with+Key+%5Biahq76%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f311c1b4cd5a6c8a0f80014907dc2a339202262","infoHashBuffer":{"type":"Buffer","data":[95,49,28,27,76,213,166,200,160,248,0,20,144,125,194,163,57,32,34,98]},"announce":[],"urlList":[]}}