{"title":"Giacomo C. #1-5","uid":7766608,"size":100392966,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:5fcb7f86a30aba8b0eb9af44e41e5568af9cdb0f&amp;dn=Giacomo+C.+%231-5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"blackcanary","files":5,"time":1351391485,"description":"English | CBR | 5 Issues\n\nGiacomo C. #1-5\nPublisher:  Glenat\n\nVenice. Place of splendor and darkness, satins and rags. Cornerstone of a society driven by poetry and philosophy, but also plagued by power, intrigue, jealousy\n\nNeeds no introduction yet of Mr. C, illustrates these seductive ladies constantly seeking freedom and money! But here he is the prey of his most persistent enemy, the Marquis San Vere. Their final confrontation will Venice theater disturbing a relentless hunt, outbursts of passions. Sinuous channels, sumptuous palaces and crannies of sinister tremble wrath of cuckolded husbands and palpitations of burning hearts of their wives. But the nobility of soul of Giacomo raise more terribly still stagnant and the plebs rampant. To the surprise and rage San Vere, awakening in him all the more ranc heart and determination. Outcome of an epic hit series, this album rejoices with the talent of its creators and their potential to let the characters they have created and which seem to have taken a life of its own. Griffo and Dufaux add to their epic, with undisguised pleasure, a pinch of humor and a touch of suspense.\n\nThe formula is successful: the magic happens!","torrent":{"xt":"urn:btih:5fcb7f86a30aba8b0eb9af44e41e5568af9cdb0f","amp;dn":"Giacomo+C.+%231-5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fcb7f86a30aba8b0eb9af44e41e5568af9cdb0f","infoHashBuffer":{"type":"Buffer","data":[95,203,127,134,163,10,186,139,14,185,175,68,228,30,85,104,175,156,219,15]},"announce":[],"urlList":[]}}