{"title":"The Ed Show 10-24-12.mp4","uid":7766097,"size":196873146,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6024545bce068e2c14f6dcc70fa3e92b84b8a872&amp;dn=The+Ed+Show+10-24-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1351378954,"description":"The Ed Show; October 24, 2012.\n\n Mitt Romney was dealing with a bombshell 10/24/12. Richard Mourdock, a Republican candidate for U.S. Senate in Indiana, says women should be forced to carry pregnancies resulting from rape to term because &quot;God intended to happen.&quot;\n\nEd welcomed Terry O'Neill (President of The National Organization for Women), to discuss Romney's endorsement of Mourdock\n\nWill Murdock's comments be a real wake-up call to Republican moderates?  Susan Del Percio (Republican Strategist and MSNBC Contributor), and Krystal Ball (Democratic Strategist and former candidate for U.S. Congress), weighed in on that.\n\nThen, with less than two weeks before the election, the crazies came out of the woodwork with Trump, Coulter and Palin all diving off the deep end. Michael Eric Dyson (Professor of Sociology at Georgetown University), joined Ed for that.\n\nThis election may all come down to the ground game in Ohio.  Larry Cohen (President of the Communications Workers of America), and James Hoffa (President of the International Brotherhood of Teamsters), laid out the game plan to deliver the Buckeye State for President Obama.\n\nWisconsin congresswoman Tammy Baldwin responded to Tommy Thompson's attack on her record, and has a new ad on how he profited off the 9-11 tragedy. Ed had the details.\n\nAnd in the Big Finish, Mitt Romney's Bain Capital threatens to close the Sensata plant ahead of schedule if workers continue protesting the company's outsourcing plans.  The Ed Show got the latest from Freeport, Illinois, from Leo Gerard (president of United Steel Workers International).\n","torrent":{"xt":"urn:btih:6024545bce068e2c14f6dcc70fa3e92b84b8a872","amp;dn":"The+Ed+Show+10-24-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6024545bce068e2c14f6dcc70fa3e92b84b8a872","infoHashBuffer":{"type":"Buffer","data":[96,36,84,91,206,6,142,44,20,246,220,199,15,163,233,43,132,184,168,114]},"announce":[],"urlList":[]}}