{"title":"Wasis Diop - Everything Is Never Quite Enough (2003)","uid":7781137,"size":108037685,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:630912957be92156fb83ce88a6453dd66d6c93ab&amp;dn=Wasis+Diop+-+Everything+Is+Never+Quite+Enough+%282003%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hllw2010","files":26,"time":1351777575,"description":"Wasis Diop (born 1950, Dakar, Senegal) is a Senegalese musician of international renown, known for blending traditional Senegalese folk music with modern pop and jazz. The son of a Senegalese high official and member of the Lebou ethnic group, Diop left Senegal in the 1970s to study engineering in Paris, but once there turned to music, joining a fellow Senegalese musician, Umban Ukset, in forming the band West African Cosmos. Diop left the band in 1979 to start a solo career, and over the next decade achieved some small success, particularly in partnerships with singer Marie-France Anglade of Black Heritage,[1] and jazz saxophonist Yasuaki Shimizu. It was not until the early 1990s that his career began to take off, with the success of his first album, the soundtrack to the film, Hyenes (which had been directed by his brother, Djibril Diop Mambety). Variety described his soundtrack to 2006's Daratt from Chad as &quot;outstanding&quot;. More albums followed: No Sant in 1995, Toxu in 1998, and the compilation album, Everything Is Never Quite Enough in 2004.\nHe lives in Paris and writes much of his lyrics in French. Among English speaking audiences, he is probably best known for &quot;African Dream&quot;, a single from No Sant which narrowly missed the Top 40 in the UK Singles Chart, and &quot;Everything is Never Quite Enough&quot;, which is featured on the soundtrack to the 1999 film, The Thomas Crown Affair. &quot;Yambo,&quot; his Wolof language cover of the Talking Heads song &quot;Once in a Lifetime&quot;, was included in a &quot;special markets&quot; CD, World is Africa, produced by Universal Music for Starbucks.","torrent":{"xt":"urn:btih:630912957be92156fb83ce88a6453dd66d6c93ab","amp;dn":"Wasis+Diop+-+Everything+Is+Never+Quite+Enough+%282003%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"630912957be92156fb83ce88a6453dd66d6c93ab","infoHashBuffer":{"type":"Buffer","data":[99,9,18,149,123,233,33,86,251,131,206,136,166,69,61,214,109,108,147,171]},"announce":[],"urlList":[]}}