{"title":"Scanner Radio Pro v3.8.3 Final By bobiras2009","uid":7657116,"size":1471189,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:63f5f36b8c691fc1f8e703ac16867024bd17a063&amp;dn=Scanner+Radio+Pro+v3.8.3+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1348189074,"description":"Follow my uploads here:                      &lt;a href=&quot;\nhttps://forum.suprbay.org/member.php?action=profile&amp;uid=311481&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/member.php?action=profile&amp;uid=311481&lt;/a&gt;    \n\nYou can make requests here:                       &lt;a href=&quot;\nhttps://forum.suprbay.org/forumdisplay.php?fid=4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/forumdisplay.php?fid=4&lt;/a&gt;\n                 \n\n                                By bobiras2009\t\t\n\n\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\nListen to live audio from over 3,300 police and fire scanners, weather radios, and amateur radio repeaters from around the world (primarily in the United States and Australia though, with more being added daily).\n\nFeatures:\n\n    Add scanners you listen to the most to your Favorites list for quick access.\n    View scanners that are located nearest you, sorted by distance, by clicking on &quot;Near Me&quot;\n    View the top 50 scanners that have the most listeners (updated every 5 minutes).\n    View list of scanners added most recently (new additions are being added all the time).\n    Browse the directory of scanner feeds by location or by genre (public safety, weather, railroad, etc).\n    Configure alerts to have the app notify you when lots of people are listening to a scanner (indicating that something big may be happening).\n    Add Scanner Radio widgets and/or shortcuts to your phone's home screen for quick access.\n    Add a &quot;Scanner Radio Favorite&quot; shortcut to your home screen to launch a scanner feed via an alarm clock app or automation app.\n    Allows you to listen to archived audio (from the past 30 days) if you have a RadioReference.com Premium Subscription. Their premium subscription is $15 for 6 months, without it you will not be able to access their audio archives using the app.\n\nIn addition to the above features, you also get the following features with this version of the app:\n\n    The ads are removed.\n    Allows you to specify what times of day you want to receive listener alerts.\n    Allows you to setup listener alerts for scanners located near you.\n    The play button at the top of the directory screens and on the widgets is functional.\n    Acts as a Tasker Plug-in, allows you to have Tasker launch the app and have one of your Favorites automatically begin playing based on one or more conditions or have the app stop playing. One use for this feature is to have a scanner feed begin playing when your phone connects to a specific Bluetooth device and then have it stop when the connection to that Bluetooth device is no longer present.\n\nThe audio is provided by volunteers using real scanner radios. If your area is not available, see the menu in the app for information on how to get it added.\n\nWhat's in this version : (Updated : Sep 20, 2012)\n\n    Fixed a bug which resulted in the listener count displayed on the player screen to not be updated for non-RadioReference.com scanners.\n    Fixed a bug which caused the &quot;Stream only over WiFi?&quot; setting to not work properly.\n    Added support for being able to enable in-app logging for support purposes.\n\nRequired Android O/S : 1.6+\n\n\n\n                                By bobiras2009\t\t\n","torrent":{"xt":"urn:btih:63f5f36b8c691fc1f8e703ac16867024bd17a063","amp;dn":"Scanner+Radio+Pro+v3.8.3+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63f5f36b8c691fc1f8e703ac16867024bd17a063","infoHashBuffer":{"type":"Buffer","data":[99,245,243,107,140,105,31,193,248,231,3,172,22,134,112,36,189,23,160,99]},"announce":[],"urlList":[]}}