{"title":"Longitude: The True Story of a Lone Genius Who Solved the Greate","uid":7643198,"size":271140,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:63f6825a3c25cd0387dd8981eb943edf0c11d247&amp;dn=Longitude%3A+The+True+Story+of+a+Lone+Genius+Who+Solved+the+Greate&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"seyer_21","files":1,"time":1347834200,"description":"Anyone alive in the eighteenth century would have known that &quot;the longitude problem&quot; was the thorniest scientific dilemma of the day-and had been for centuries. Lacking the ability to measure their longitude, sailors throughout the great ages of exploration had been literally lost at sea as soon as they lost sight of land. Thousands of lives, and the increasing fortunes of nations, hung on a resolution. The scientific establishment of Europe-from Galileo to Sir Isaac Newton-had mapped the heavens in both hemispheres in its certain pursuit of a celestial answer. In stark contrast, one man, John Harrison, dared to imagine a mechanical solution-a clock that would keep precise time at sea, something no clock had ever been able to do on land. Longitude is the dramatic human story of an epic scientific quest, and of Harrison's forty-year obsession with building his perfect timekeeper, known today as the chronometer. Full of heroism and chicanery, it is also a fascinating brief history of astronomy, navigation, and clockmaking, and opens a new window on our world.","torrent":{"xt":"urn:btih:63f6825a3c25cd0387dd8981eb943edf0c11d247","amp;dn":"Longitude%3A+The+True+Story+of+a+Lone+Genius+Who+Solved+the+Greate","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63f6825a3c25cd0387dd8981eb943edf0c11d247","infoHashBuffer":{"type":"Buffer","data":[99,246,130,90,60,37,205,3,135,221,137,129,235,148,62,223,12,17,210,71]},"announce":[],"urlList":[]}}