{"title":"Extreme Movie Manager 8.0.2.1","uid":7790477,"size":79724089,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:64199be88f036a7808dbfd8f460b11900e9cca3f&amp;dn=Extreme+Movie+Manager+8.0.2.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"arman258","files":3,"time":1352012020,"description":"Movie database manager that can take movie information from the Internet\nWritten by Bogdan Popa on January 24th, 2012\n\neXtreme Movie Manager is a powerful movie database manager that lets you organize your collection by letting you enter information manually or retrieve details from the Internet.\n\nBesides the fact that it works with the most popular video formats on the market, such as DivX, XviD, VHS, DVD, VCD, SVHS or DVD-R, eXtreme Movie Manager comes with dedicated tools to allow you to write down information about actors or import covers and photos.\n\nThere are multiple ways to add a new movie to the collection and the easy to navigate interface lets you do it with ease straight from the main window.\n\nYou can add boxsets, do it manually by title or automatically from the Internet, add movies from CD or DVD, scan the local disks for movies, add movies from TXT files or import movies UPC/EAN codes from a text file.\n\nThe number of features is absolutely amazing and you may need a few minutes to get used to the professional-looking interface, but you're also allowed to add shows manually by title, from a TXT list, from the hard disk or again, automatically from the Internet.\n\nThe download tool works quick and easy and retrieves details such as actors and crew, images, DVD details and even trailers.\n\nOf course, the application is able to scan the video files you choose and extract information to be saved in the collection, such as bitrate, audio and video quality, codecs and screen resolution.\n\nAdditionally, eXtreme Movie Manager has special utilities to cut frames from the movie and thus create a preview that can be attached to a certain title.\n\nJust as expected, the program boasts a powerful export tool, which means the whole collection can be saved in multiple formats, such as CSV, TXT and HTML.\n\nAll in all, eXtreme Movie Manager is a powerful and affordable way to organize your movie collection, offering a professional-looking interface and advanced tools to help your in this regard.\n\n\nÂ· Organize your Movie/DVD collection automatically, lookup your Hard Disks, CD/DVD, portable devices in search for files, import movies list directly from CSV, TXT files\nÂ· Organize your TV Shows collection automatically, lookup your Hard Disk, CD/DVD in search for Episodes files, download all data from internet, including all episode plot, images, cats with just a click!\nÂ· Read Codec data directly from movie files, like bitrate, audio, channels, codec used, screen resolution...\nÂ· Extract frames directly from your movie files, to have a preview of the video quality, take a look at film scene\nÂ· Download all data, images, trailers automatically from internet from many sources in many languages, including casts, crew, DVD details\nÂ· Browse your Movies and TV Shows collection on screen with a powerful interface, with rich search options\nÂ· Export all your collection in several format, including CSV, TXT, HTML and the exclusive (x)HTML-DATABASE technology\nÂ· Learn how to use eXtreme Movie Manager with a short and concise Video Tutorials, read our Quick Tour of XMM features and get support from our Forum\n\nRequirements:\n\nÂ· .NET Framework 4.0\nÂ· Windows Installer 3.1\n\n\n\nWhat's New in This Release: \n\nÂ· Fixed a bug in Template Selection (My Website Function)\nÂ· Fixed a bug in HTML Card (MovieFile)\nÂ· Fixed a bug in Loading Edit Window","torrent":{"xt":"urn:btih:64199be88f036a7808dbfd8f460b11900e9cca3f","amp;dn":"Extreme+Movie+Manager+8.0.2.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64199be88f036a7808dbfd8f460b11900e9cca3f","infoHashBuffer":{"type":"Buffer","data":[100,25,155,232,143,3,106,120,8,219,253,143,70,11,17,144,14,156,202,63]},"announce":[],"urlList":[]}}