{"title":"Un Pais Para Comerselo - 19 Castilla La Mancha [DVDRip][Spanish]","uid":6800443,"size":629190656,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:64770370bdfaf733acb1e55a7fe050e266359ae4&amp;dn=Un+Pais+Para+Comerselo+-+19+Castilla+La+Mancha+%5BDVDRip%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"virana","files":-1,"time":1320672663,"description":"castilla la mancha un pais para comerselo\n\nImanol y Juan recorren Castilla la Mancha a travÃƒÂ©s de las provincias de Ciudad Real y Toledo. La excusa para emprender este viaje es la frÃƒÂ¡gil flor del azafrÃƒÂ¡n que crece en los campos de Madridejos. Echanove aprende en el mismo campo, con las mujeres de esta localidad, el esfuerzo que cuesta obtener un kilo de azafrÃƒÂ¡n con 250.000 flores. Esfuerzo que se ve recompensado con un buen almuerzo de gachas. AdemÃƒÂ¡s, no se va de allÃƒÂ­ sin probar un receta muy conocida de la zona: las albÃƒÂ³ndigas de azafrÃƒÂ¡n.\nLos &quot;gigantes&quot; de Don Quijote\n\nLa estela de molinos de viento y los ecos del Quijote conducen a nuestros dos protagonistas entre Campo de Criptana y AlcÃƒÂ¡zar de San Juan. En la primera localidad aprendemos de manos de Lola Madrid cÃƒÂ³mo funciona un molino y cÃƒÂ³mo se llaman los vientos que mueven las aspas que Don Quijote confundiÃƒÂ³ con los brazos de los gigantes.\n\nMientras, Tonino conoce un juego tradicional de Campo de Criptana: el caliche. Sus compaÃƒÂ±eros de juego le descubren tambiÃƒÂ©n que los granos de almorta, ademÃƒÂ¡s de triturarse y servir de ingrediente fundamental para las gachas, se pueden consumir fritos a modo de aperitivo. Imanol, por su parte, va al Monasterio de las Monjas Concepcionistas donde estÃƒÂ¡ muy presente la tradiciÃƒÂ³n repostera monacal manchega.  Nos muestran uno de sus dulces mÃƒÂ¡s conocidos: los cordiales.\n\nPan y perdices\n\nAlcÃƒÂ¡zar de San Juan es otro eje del Quijote, donde se reproduce el guiso de las bodas de Camacho, una receta popular del acervo manchego que hizo perder la cabeza al propio Sancho Panza.\n\nLos campos cercanos a las tablas de Daimiel, parque en el que Juan e Imanol disfrutan de un paseo, ya eran nombrados y protegidos en tiempos de Felipe II. Y en esos mismos campos, Imanol se encontrarÃƒÂ¡ con pastores de la zona, degustando el autÃƒÂ©ntico queso manchego. En otros campos, cercanos a ValdepeÃƒÂ±as, Juan disfruta de una jornada de caza de perdices, asÃƒÂ­ como una buena receta de perdiz en escabeche.\n\nComo buena tierra de pastores, el pan es otro protagonista de este viaje. Imanol y Juan llegan a Tomelloso, punto de destino para saborear el pan de Cruz, un pan que se encuentra bendecido por la cruz de Calatrava y por las manos de sus artesanos panaderos, celosos de una receta y de un modo de trabajar que casi no ha cambiado en el tiempo.\n\nCelosos y orgullosos tambiÃƒÂ©n estÃƒÂ¡n los habitantes de Almagro. Orgullosos de su legado histÃƒÂ³rico, como su corral de comedias y de su Museo Nacional de Teatro (del cual Tonino nos descubre muchas curiosidades). Y orgullosos tambiÃƒÂ©n de su legado gastronÃƒÂ³mico, como son las berenjenas de Almagro.\nLa Mancha y el vino\n\nCasi la mitad de la superficie de viÃƒÂ±edos en EspaÃƒÂ±a se encuentra en Castilla la Mancha, dato que nos acerca la importancia del mundo del vino en esta Comunidad y que tambiÃƒÂ©n tiene mucha importancia a lo largo del programa. \n\nImanol conoce a los ÃƒÂºltimos artesanos elaboradores de botas de vino en ValdepeÃƒÂ±as y posteriormente se acerca a Malpica de Tajo donde el MarquÃƒÂ©s de GriÃƒÂ±ÃƒÂ³n y su hija SandrÃƒÂ¡ FalcÃƒÂ³ esperarÃƒÂ¡n a Imanol para contarle los secretos de su bodega.","torrent":{"xt":"urn:btih:64770370bdfaf733acb1e55a7fe050e266359ae4","amp;dn":"Un+Pais+Para+Comerselo+-+19+Castilla+La+Mancha+%5BDVDRip%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64770370bdfaf733acb1e55a7fe050e266359ae4","infoHashBuffer":{"type":"Buffer","data":[100,119,3,112,189,250,247,51,172,177,229,90,127,224,80,226,102,53,154,228]},"announce":[],"urlList":[]}}