{"title":"Ducati Challenge","uid":7785270,"size":47000715,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:64bcb07fd89392ddec4549d91aa74442d114494a&amp;dn=Ducati+Challenge&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1351877443,"description":"Speed and fun on two wheels, in the palm of your hand.\nDOWNLOAD DUCATI CHALLENGE NOW AND TAKE ADVANTAGE OF OUR LIMITED-TIME OFFER!!!\nTO CELEBRATE THE ANDROID LAUNCH, DIGITAL TALES WILL REWARD EARLY ADOPTERS WITH 3000 BONUS COINS TO GET A HEAD START IN CHAMPIONSHIP MODE, PLUS ALL THE TRACKS AND BIKE MODELS UNLOCKED IN QUICK CHALLENGE MODE!\nSpeed and fun on two wheels, in the palm of your hand.\nGet ready for breathtaking challenges and unique thrills riding official Ducati motorbikes in a graphically stunning 3D racing game. Wheelies, stoppies, overtaking, high speed and steering precision make Ducati Challenge a must-have game for Ducati and motorbike fans alike.\n---- Official Ducati bikes\nRide the most powerful standard models in Ducati's line, including Monster 1100 EVO, Hypermotard 1100 EVO SP, Diavel Carbon, Multistrada 1200 S, Streetfighter S, Superbike 1198 SP, Multistrada Pikes Peak, Diavel Cromo and Superbike 1199 Panigale S. The roar of every single engine was recorded live to offer all Ducati fans an immersive experience.\n---- Original and varied tracks\nFast race tracks, winding mountain roads, narrow medieval village streets, bustling metropolises and hot desert valleys will make the perfect locations for exciting challenges, where you can safely unleash all the power of Ducati's awesome bikes.\n---- CHAMPIONSHIP MODE\nTackle a series of challenges to become Champion. Earn points during races, unlock new goodies and circuits in Quick Challenge mode. Upgrade your bikes and crush your opponents. Use enhanced fuel to improve your performance.\n---- QUICK CHALLENGE MODE\nPick your ride, track, number of laps and difficulty level and just jump into the race. More tracks and bikes will be unlocked as you progress through the championship mode.\n---- Different camera angles\nIn-game camera angles convey all the thrills of high speed racing on two wheels. Opt for a standard third person view or the amazing first person view.\n---- Easy handling\nThanks to the customizable handling system (including steering sensitivity control based on your device leaning and the brake assist), Ducati Challenge offers user-friendly controls for players of all levels, ranging from beginners to experts.\nYou can choose between arcade and simulation settings to get your favourite driving experience.\n--- Graphic Quality \nThanks to the graphic quality customization, you can choose between 3 different settings to get the best performance out of your device: low quality (no effects), medium quality (anti-aliasing activated), high quality (anti-aliasing + motion blur + high quality particles activated).\n---- Image galleries and achievements\nThe rich game Extras, including unlockable achievements and exclusive Ducati images you can save on your device, will be the icing on the cake for all Ducati fans.\nPLEASE NOTE we are unable to reply to users feedback on Google Play - in case of any issues running the game, before posting a bad review, please ask for our support at &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;f692839597829fd8959e979a9a93989193db97989284999f92b69282979a9385d89f82d8&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; We'll be happy to help you!","torrent":{"xt":"urn:btih:64bcb07fd89392ddec4549d91aa74442d114494a","amp;dn":"Ducati+Challenge","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64bcb07fd89392ddec4549d91aa74442d114494a","infoHashBuffer":{"type":"Buffer","data":[100,188,176,127,216,147,146,221,236,69,73,217,26,167,68,66,209,20,73,74]},"announce":[],"urlList":[]}}