{"title":"Bagets 1984 FIlm","uid":7790531,"size":1169115968,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:656c1f15025030fe70a5af68942f07052b41858c&amp;dn=Bagets+1984+FIlm&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":2,"time":1352015857,"description":"Bagets is a 1984 2-part Philippine youth-oriented comedy film made by Viva Films about a group of high school teenagers.\n\n\nThe movie focuses on the lives of five young boys - boy next door Adie, &quot;overstaying&quot; Tonton, the geeky Gilbert, the martial arts buff Toffee, and rich guy Arnel - as they try to pass senior year in a different high school (they were kicked out from their previous school). Along the way, they encounter some of the typical adventures and misadventures common to adolescents - young love, family problems, and sexual hijinks.\nHowever, all does not go well, as their separate backgrounds generate problems of their own. Arnel is the only son whose parents want to take over the family business and his mother disapproves of his choice of girlfriend, Janice, who comes from a middle class background. Toffee seeks companionship in Christine, an older flight attendant, because his own mother, an actress, does not attend to his needs. Gilbert lives in a rented apartment where his mother is hard at work as a businesswoman and the father, a policeman, often hangs out at sauna baths when the rent is already months overdue. His situation is also the same as that of Tonton, who has stayed in senior year for four years. Adie's in love with Ivy, a girl next door who's actually married.\nReality hits the gang the hardest when Tonton loses his girlfriend, Rose, in a car accident while drag racing on the same night of the junior-senior prom. As graduation day draws near, it dawns on the gang that they will have to grow up to prepare for life after high school.\n\n\nCAST:\n\nWilliam Martinez as Tonton\nHerbert Bautista as Gilbert\nJ.C. Bonnin as Toffee\nRaymond Lauchengco as Arnel\nAga Muhlach as Adie\nJobelle Salvador as Melissa\nEula Valdez as Janice\nYayo Aguila as Rose\nIrma Alegre as Fe Alvarez\nChanda Romero as Christine\nHerminio Bautista as Butch Bautista\nBaby Delgado as Ivy\nBembol Roco as Buko Vendor\nRobert Campos as Arnel's father\nRodolfo 'Boy' Garcia as Tonton's father\nCelia Rodriguez as Adie's mother\nLuz Valdez as Gilbert's mother\nRosemarie Gil as Arnel's mother\nLiza Lorena as Toffee's mother\n\n\nfrom wikipedia.org\n\nThis is an avi file from a VCD rip\ni can't join the files so this is a two file video.","torrent":{"xt":"urn:btih:656c1f15025030fe70a5af68942f07052b41858c","amp;dn":"Bagets+1984+FIlm","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"656c1f15025030fe70a5af68942f07052b41858c","infoHashBuffer":{"type":"Buffer","data":[101,108,31,21,2,80,48,254,112,165,175,104,148,47,7,5,43,65,133,140]},"announce":[],"urlList":[]}}