{"title":"Countries and Their Cultures (4 Volume Set) ","uid":6802228,"size":108790300,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6615c5330017860d26d5cb6d8705f10597c539b3&amp;dn=+Countries+and+Their+Cultures+%284+Volume+Set%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"freaktorrent07","files":-1,"time":1320724297,"description":"Countries and Their Cultures (4 Volume Set)\n\n\nLike the ten-volume Encyclopedia of World Cultures (Macmillan, 1996), the four-volume Countries and Their Cultures is based on the collection of ethnographic information known as the Human Relations Area Files based at Yale University. Unlike World Cultures, which is organized by culture, the new work is organized by country. This work\\'s strength is that readers who know very little about a country can quickly obtain a good orientation to the major issues, history, and social structure of a nation. The 225 entries are between ten and 20 pages long and read like a cross between a well-written encyclopedia article, a travel guide, and a social science essay. They provide a good general overview of a country without greatly oversimplifying or distorting. All entries have the same structure, with sections on geography, history, demography, languages, food, economy, etiquette, politics, family, religion, and arts and humanities. A country\\'s degree of cultural unity as well as its cultural variations are described in the sections on national identity, ethnic relations, and social stratification. Each entry has a map with a regional insert, black-and-white photographs, and a bibliography of recent scholarly books.\n\n\n\nAuthor(s):\tMelvin Ember and Carol R. Embe\nDate:\t        2001-05-23\nPages:\t        2300\nFormat: \tpdf\nLanguage:\tEnglish\nISBN10: \t0028649508\nISBN13:         9780028649504","torrent":{"xt":"urn:btih:6615c5330017860d26d5cb6d8705f10597c539b3","amp;dn":"+Countries+and+Their+Cultures+%284+Volume+Set%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6615c5330017860d26d5cb6d8705f10597c539b3","infoHashBuffer":{"type":"Buffer","data":[102,21,197,51,0,23,134,13,38,213,203,109,135,5,241,5,151,197,57,179]},"announce":[],"urlList":[]}}