{"title":"Cronicas (2004) Retail DD 5.1 (nl subs) TBS","uid":6806000,"size":4639342453,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:665d6c5a7da244848c70fe465ac787314c45fdf5&amp;dn=Cronicas+%282004%29+Retail+DD+5.1+%28nl+subs%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Betty-Boop","files":-1,"time":1320865983,"description":"Cronicas (2004)\n\n\nAlternatieve titel: Chronicles \n\n\nLand: Mexico / Ecuador\nGenre: Drama / Thriller\nLengte: 108 minuten\n\nActeurs: John Leguizamo, Leonor Watling en Damian Alcazar\n\nWaardering:\nMoviemeter: 3,10\nIMDB: 7.0/10\n\nLiefhebbers van een avondje film, vergeet niet dat er naast de grote &quot;Hollywoodreleases&quot; nog tig &quot;andere&quot; (kwaliteits) films zijn. Kleinere filmparels uit alle hoeken van de wereld, films die zich onderscheiden van de massa door een eigenzinnige filmtaal en een rijke inhoud, films die je raken ....\n\n\nEen film geregisseerd door Sebastian Cordero, geproduceerd door Guillermo Del Toro. Cronicas was de inzending voor de Oscar: Beste Buitenlandse Film en won een Silver Ariel Award en een Golden India Catalina.\n\nSamenvatting:\nEen team van journalisten gaat op zoek naar een seriemoordenaar. Al snel hebben ze een mogelijke verdachte. Sterreporter Manolo Bonilla heeft echter meer oog voor zijn carriere dan voor de slachtoffers van de seriemoordenaar. De gevolgen zijn verschrikkelijk.\n\nRecensie:\nHoewel al snel duidelijk is wie hoogstwaarschijnlijk het monster van Babahoyo is, is dit geenszins reden om halverwege de film al af te haken. Wat Cronicas boeiend maakt is niet de speurtocht naar een seriemoordenaar maar de psychologische spelletjes die voortdurend worden gespeeld door de hoofdfiguren. Bonilla weet met zijn charme iedereen die hij voor zijn reportages wil gebruiken naar zijn hand te zetten. Hij is een eersteklas manipulator die zelfs zijn getrouwde collega Marisa weet te verleiden. Desondanks is Bonilla geen onsympathiek mens. Hij lijkt oprecht wroeging te hebben over de gevolgen van zijn daden en maakt aan het einde van de film ondanks het grote succes van zijn laatste reportage geen zelfvoldane indruk. \n\nRegisseur Cordero had voor de rol van Manolo Bonilla geen betere keus kunnen maken dan John Leguizamo. Hij is als Bonilla innemend en een tikje macho maar hij weet ook de kwetsbare kant van Bonilla goed uit te beelden. Een andere uitblinker in deze film is de Mexicaanse acteur Damian Alcazar. Hij weet Cepeda zo neer te zetten dat op bepaalde momenten toch even de twijfel toeslaat, is hij het monster van Babahoyo of heeft hij de seriemoordenaar toevallig ontmoet op ÃƒÂ©ÃƒÂ©n van zijn reizen, zoals hij zelf beweert.\n\nCordero haalde zijn inspiratie voor het script van Cronicas deels uit waargebeurde zaken, zoals die van het monster van de Andes en van Daniel Camargo, 2 Ecuadoriaanse psychopaten. Ook heeft hij voor zijn verhaal nader onderzocht waarom mensen zo een grote behoefte hebben aan sensationeel nieuws. De samenleving spreekt schande van de zogenaamde riooljournalistiek, maar de bestgelezen en bekeken media zijn nog altijd deze, die het meest sensationele nieuws brengen. Cordero concludeerde voor zichzelf dat de sensatiepers voor velen het enige medium is om op de een of andere manier hun verhaal te vertellen, aangezien de serieuze media veel zaken die mensen aan het hart gaan onbelicht laten.\n\nCronicas geeft inzicht in de manier waarop de media mensen manipuleert, en hoe mensen op hun beurt de media manipuleren. Tevens is het een sterke psychologische thriller. Een geslaagde combinatie, die zeker de moeite waard is om gezien te worden. Top!\n\nVerhaal:\nManolo Bonilla is verslaggever van een populair televisieprogramma gericht op de Latino bevolking in Miami. Samen met zijn filmploeg reist hij naar een klein stadje in Ecuador om verslag te doen van een serie gruwelijke kindermoorden, gepleegd door het monster van Babahoyo. Daar redt hij tijdens de opnames op de begrafenis van enkele slachtoffers de bijbelverkoper Vinicio, die per ongeluk een jongetje heeft aangereden, uit de klauwen van een woedende menigte. Vinicio wordt gearresteerd en Manolo bezoekt hem in de gevangenis. Daar blijkt Vinicio wel erg goed op de hoogte van de moorden. Manolo ruikt een primeur en belooft zich in te zetten voor de vrijlating van Vinicio. Maar in zijn zoektocht naar exclusieve informatie gaat de journalist wel erg ver.\n\n\nEnglish\n\nStoryline\n\nWhen the star of a sensationalistic Miami news show travels to the Ecuadorian coastal village of Babahoyo to cover the story of a serial killer who hunts children, his personal ambition gets out of hand, and his pursuit of a moment of glory carries tragic consequences. Written by\n\nTechnische specificaties:\nBron: Retail\nTaal: Spaans\nAudio: DD 5.1\nOndertitels: Nederlands\n\nMet dank en alle eer voor de originele poster\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/27220&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/27220&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0382621&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0382621&lt;/a&gt;\n\n@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\n\nKom ook eens kijken :\n       &lt;a href=&quot;\nhttp://black-sam.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://black-sam.org&lt;/a&gt;\n\nEnjoy\n\n\n@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@","torrent":{"xt":"urn:btih:665d6c5a7da244848c70fe465ac787314c45fdf5","amp;dn":"Cronicas+%282004%29+Retail+DD+5.1+%28nl+subs%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"665d6c5a7da244848c70fe465ac787314c45fdf5","infoHashBuffer":{"type":"Buffer","data":[102,93,108,90,125,162,68,132,140,112,254,70,90,199,135,49,76,69,253,245]},"announce":[],"urlList":[]}}