{"title":"Melissa Harris-Perry 10-6-12.mp4","uid":7707938,"size":359309467,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:66d68de602973e708f3a41700fc0e7e7f5c5434d&amp;dn=Melissa+Harris-Perry+10-6-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1349733328,"description":"Melissa Harris-Perry; Saturday, October 6, 2012.\n\nTo start off Saturday's show, Melissa offered her take on the debate, and Friday's positive jobs news. Other topics they got to today include Romney targeting Big Bird, the third grade (yes, literally), and what education researchers call the &quot;Matthew Effect.&quot; Melissa will also kick off another edition of This Week in Voter Suppression!(Trademark), one which will carry particular import for out-of-state college students looking to vote nearby their campuses. Oh, and Melissa offered her response to this nonsense George Will wrote, and delved into the &quot;angry black man&quot; stereotype which the Drudge/Carlson/Hannity triumvirate tried to bait America into buying about the President the day before the debate.\n\nHer guests included: \n\nDan Dicker (CNBC contributor and principal partner at MercBlog), Maya Wiley (founder and president of the Center of Social Inclusion), Raul Reyes (attorney and NBC Latino contributor), Ari Berman (contributing writer for The Nation and author of &quot;Herding Donkeys: The Fight to Rebuild the Democratic Party and Reshape American Politics&quot;) they discussed the debate, Friday's positive jobs news, and race.\n\n\nMatthew Segal (president of OurTime.org, a non-partisan youth empowerment organization) replaced Dan Dicker on the panel for &quot;This Week in Voter Suppression&quot;.\n\n\nU.S. Rep. Elijah Cummings (D- MD) joined via satellite to discuss his letter on 'True the Vote' and voter suppression.\n\nAnnie Murphy Paul (Time magazine contributor and author of &quot;Origins: How the Nine Months Before Birth Shape the Rest of Our Lives&quot;) replaced Ari Berman on the panel to discuss education.\n\nSaturday's Footsoldier is Delores Leonard who is connecting people and allowing low income people to connect to her internet.\n","torrent":{"xt":"urn:btih:66d68de602973e708f3a41700fc0e7e7f5c5434d","amp;dn":"Melissa+Harris-Perry+10-6-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66d68de602973e708f3a41700fc0e7e7f5c5434d","infoHashBuffer":{"type":"Buffer","data":[102,214,141,230,2,151,62,112,143,58,65,112,15,192,231,231,245,197,67,77]},"announce":[],"urlList":[]}}