{"title":"ABC Big Ideas: John Ralston Saul on Freedom and Globalisation - ","uid":7769320,"size":352143363,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:66e9897045065a2b2d14a4f22d2401cc8340a1bb&amp;dn=ABC+Big+Ideas%3A+John+Ralston+Saul+on+Freedom+and+Globalisation+-+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Temptation","files":1,"time":1351472072,"description":"[b]ABC - Big Ideas, June 8 2010: John Ralston Saul on Freedom and Globalisation[/b]\n\n[b]Summary[/b]\n\nTime Magazine calls him a &quot;prophet&quot;. Join Canadian thinker John Ralston Saul as he discusses globalisation's impact on freedom, writing and reading.\n\n[b]Detailed Program Description[/b]\n\nLongtime outspoken critic of globalism and what he calls the &quot;rationalist elite&quot;, John Ralston Saul argues it's time for a big shift in our political and corporate thinking. Despite the promise of a shiny new world order of globalism for the past forty years, he argues, 19th century European ideas of progress borne out in the industrial revolution continue to dominate the direction of the world.\n\nTo a packed house at Melbourne's RMIT Capitol Theatre, Ralston Saul argues that the worldwide reliance on and faith in globalism has led to war, financial meltdown and a failure to find solutions to important challenges such as climate change.\n\nAlong the way, he disputes some of the fundamental tenets of globalism such as the diminution of the nation state. He asks why, despite the promise of a global community, nations such as Australia and Canada have only survived the GFC on the back of national industries such as mining, and questions the culture of managerialism promulgated by universities worldwide.\n\nThe event was hosted by Melbourne Writers' Festival in association with The Sydney Writers' Festival and Melbourne PEN Centre.\n\n[b]John Ralston Saul[/b] is a Canadian essayist and novelist who is the current President of International PEN, a worldwide association of writers that promotes freedom of expression and intellectual cooperation. Saul has become increasingly influential as a writer of philosophical essays such as [i]Voltaire's Bastards: The Dictatorship of Reason in the West (1993)[/i] which argued that Voltaire's utopian vision had been usurped by the technocratic elite . In his 2005 novel [i]The Collapse of Globalism: And the Reinvention of the World[/i] he warned that, like it or not, globalism was already collapsing and that if we did not act quickly we would be caught in a crisis and limited to emergency reactions.\n\nDeclared a &quot;prophet&quot; by TIME magazine, his works have been translated into 22 languages in 30 countries. In his most recent novel, [i]A Fair Country: Telling Truths About Canada (2008)[/i], he suggests a rethinking of the penchant &quot;peace, order, and good government&quot; that supposedly defines Canada, arguing that it is a distortion of the country's true nature.\n\nFor more information on this episode, including information on the guests and various other resources and links, visit the episode webpage: &lt;a href=&quot;\nhttp://www.abc.net.au/tv/bigideas/stories/2010/06/08/2919936.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.abc.net.au/tv/bigideas/stories/2010/06/08/2919936.htm&lt;/a&gt;\n\n-----\n\nNote:  This is a MP4 video podcast that is available for free download from the website.  Quality is good.  Audio podcast (mp3 format) is also available for free download.  \n\nType: mp4 file\nSize: 335MB\nRuntime: 01:34:04\nVideo: MPEG4 Video (H264) 512x288\nAudio: AAC 44100Hz stereo 96Kbps \n\nDownload this episode using the attached torrent file or download it directly using this link: &lt;a href=&quot;\nhttp://mpegmedia.abc.net.au/tv/bigideas/mwf_johnralstonsaul_full.mp4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpegmedia.abc.net.au/tv/bigideas/mwf_johnralstonsaul_full.mp4&lt;/a&gt;\n\nYou can also watch a flash video of this lecture through your web-browser here: &lt;a href=&quot;\nhttp://www.abc.net.au/tv/bigideas/stories/2010/06/08/2919936.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.abc.net.au/tv/bigideas/stories/2010/06/08/2919936.htm&lt;/a&gt;\n\n-----\n\n[b]ABOUT THE SHOW[/b]\n\n[img]http://www.abc.net.au/tv/img/abc1_104x63.gif[/img][img]http://www.abc.net.au/tv/bigideas/images/logo_big_ideas.gif[/img]\n\n[b]ABC - Big Ideas[/b]\n\nBig Ideas is a screen space for intellectual, political, cultural and economic debate in Australia. Big Ideas broadcasts an eclectic and provocative selection of the most interesting, challenging and diverse talks events - everywhere from major writers festivals to tiny inner-city bookshops, to universities and institutes across Australia.\n\nBig Ideas brings you several TV shows a week on ABC1 and ABC News 24, hosted by Waleed Aly. On ABC1 tune in every Tuesday at 11am for shortcuts of the best talks of the week, and then tune in Wednesdays at 11am on ABC1 for one of the best of the talks in full. You can find more Big Ideas on ABC News 24, Saturday and Sunday at 1pm. Find out more about our TV schedule here. You can also visit this site anytime and browse our huge archive of talks that you can stream, pod or vodcast.\n\nBut it doesn't stop there...You can also catch Big Ideas on Radio National, on Sundays at 5pm and on Thursdays at 6pm.\n\nSo, if you're interested in ideas, arguments, current affairs, abstract thoughts, the arts, politics, writing, science, economics, technology or popular culture, now it doesn't matter where you live. With Big Ideas you can still be part of intellectual activity in your community and far, far beyond.\n\n[b]More about our host Waleed Aly:[/b]\n\n[b]Waleed Aly[/b] is a broadcaster, author, academic, and rock musician. He is a social and political commentator in newspapers such as The Guardian, The Australian, The Australian Financial Review, The Sydney Morning Herald and The Age. He has featured as an anchor for ABC News Breakfast and as a host on ABC Radio Melbourne Mornings. Aly is currently a lecturer in politics at Monash University, working in their Global Terrorism Research Centre.\n\nABC's [b]Big Ideas[/b] website:  &lt;a href=&quot;\nhttp://www.abc.net.au/tv/bigideas/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.abc.net.au/tv/bigideas/&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:66e9897045065a2b2d14a4f22d2401cc8340a1bb","amp;dn":"ABC+Big+Ideas%3A+John+Ralston+Saul+on+Freedom+and+Globalisation+-+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66e9897045065a2b2d14a4f22d2401cc8340a1bb","infoHashBuffer":{"type":"Buffer","data":[102,233,137,112,69,6,90,43,45,20,164,242,45,36,1,204,131,64,161,187]},"announce":[],"urlList":[]}}