{"title":"LastOS7 v5.2 x86 &amp; x64 - Nov 2011","uid":6796780,"size":7840651264,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:671ca87d591a976881e403284920974f7c16553f&amp;dn=LastOS7+v5.2+x86+%26amp%3B+x64+-+Nov+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LastOS","files":1,"time":1320485820,"description":"This is the latest LastOS7 available as of 5th Nov 2011.\n\n\nIt has the latest Driverpacks and Microsoft Updates (on top of Win 7 SP1 base).\n\nIt includes a large range of essential apps and runtimes (all optional via the ssWPI Installer).\n\nIncludes the Latest Online Free Mega Games Pack in the Games Installer (can be used on non LastOS machines).\n\nMany other things are tweaked, modded and added, but if your not familiar with LastOS then you will find it different to what &quot;others&quot; are calling modded windows, the theme, wallpaper, icons and resources are the least interesting thing in these releases, in fact many of them a standard, you really want to check out the Context Menu Extras for the real powerful stuff.\n\nThis release is 7.3GB so will not fit on a DVD5, USB will be the best experience, The AutoStart menu has a button for creating a bootable USB disk (formats the WHOLE disk, not just a partition).\n\nThe included LivePE is used to Install the OS or fix an existing one, but your also able to install the LivePE from the LastOS Settings screen (available after OS install and from the AutoStart menu).\n\nI wasn't planning on releasing any more LastOS7 releases, but as so many updates and changes were done, I thought people may wish to keep this on hand for future installs (until Windows 8 at least).\n\n* This release is NOT supported by LastOS.org and is not to be associated with the tools they offer there or that have been included, it is a concept of what the LastOS Builder can create and is not to be used in businesses or sold in any form *\n\nShare this, mod this, enjoy the ride.\n\nYou can find How To Install videos here: &lt;a href=&quot;\nhttp://www.lastos.org/team/Public/Docs/LastOS_Install.zip&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.lastos.org/team/Public/Docs/LastOS_Install.zip&lt;/a&gt;\n\nThey are for LastOS7 v3 but the process is still the same.","torrent":{"xt":"urn:btih:671ca87d591a976881e403284920974f7c16553f","amp;dn":"LastOS7+v5.2+x86+%26amp%3B+x64+-+Nov+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"671ca87d591a976881e403284920974f7c16553f","infoHashBuffer":{"type":"Buffer","data":[103,28,168,125,89,26,151,104,129,228,3,40,73,32,151,79,124,22,85,63]},"announce":[],"urlList":[]}}