{"title":"Tony.Hawks.Pro.Skater.HD-SKIDROW","uid":7672882,"size":1220606026,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6791c07ee6fc9aea36b4fa8a02eead37d88c6601&amp;dn=Tony.Hawks.Pro.Skater.HD-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jvarnell","files":-1,"time":1348621830,"description":"18-09-2012......Release Date - Protection.................Steam\nSkating............Game Type - Disk(s)....................1 DVD\n\nRELEASE NOTES\n\nTony Hawks Pro Skater HD takes the best elements of the classic THPS\ngames and gives them a fresh update to create an all new skateboarding\nexperience for PC. The gameplay in Tony Hawks Pro Skater HD focuses on\nthe satisfaction of linking sick tricks for maximum points. Combining\nsharp visuals with the best controls ever in a Tony Hawk game, the feel\nis cutting edge yet timeless.\n\nFeatures:\n\nTHPS and THPS2 gameplay comes to PC\n\nHD Upgrade: Game was rebuilt and polished by Robomodo using Neversofts\noriginal level models.\n\nClassic levels: The style and feel of the best 7 levels from THPS and\nTHPS2 (Warehouse, School 2, Mall, Hangar, Venice, Marseille and Phoenix\nDownhill Jam) refreshed for today. The levels are exactly the same\nspecs as the originals - every gap, SKATE Letter, etc is exactly where\nyou remember it but looks a hell of a lot better\n\nThe Top Pros: Todays biggest skate pros round out the cast including:\nNyjah Huston, Chris Cole, Eric Koston, Andrew Reynolds, Rodney Mullen,\nLyn-z Adams Hawkins Pastrana, Riley Hawk and, of course, Tony Hawk\nhimself. Each has 8 boards, 3 special moves, and an alternate outfit.\n\nRefined controls: The skaters animations, tricks and combos reflect\nthe evolution of the THPS games. Animations are improved, the tricks\nhave been redone (and some new special tricks added), even skater\ncelebrations have been added for big combos.\n\nManuals and Reverts: You can do manuals as part of trick combos in THPS\nHD. Given the fact that this game combines the best gameplay from THPS1\nand THPS2, Reverts will not work as part of trick combos in the initial\nlaunch of THPS HD as that mechanic was not introduced until THPS3.\nHowever, reverts will work in the post-release DLC for the THPS3\nlevels, as those levels were originally designed to accommodate this.\n\nEndlessly fun objectives: Players pursue the same global and\nlevel-specific goals as the original games, including S-K-A-T-E, Secret\nDVD (used to be VHS tape), and many more.\n\nIn-Game Soundtrack: It is about half classic THPS tracks and half new\nones. Includes Goldfingers Superman and the Anthrax/Public Enemy\ncollaboration Bring the Noise.\n\nDownloadable content: Coming post-release, The Tony Hawks Pro Skater\n3 HD Revert Pack DLC includes levels from THPS3 including Airport,\nCanada, and LA. New pros included are legends Steve Caballero and Geoff\nRowley.\n\nIn Game Map View: Pause and see the location of objectives and gaps.\n\nQuick Restart: Back button allows you to quickly restart their session.\nPerfect for the obsessive gamer who is looking to achieve the perfect\ncombo.\n\nINSTALL NOTES\n\n2. Mount or burn image\n3. Install\n4. Copy everything from the SKIDROW folder into the game installation\n5. Block the game in your firewall and mark our cracked content as\nsecure/trusted in your antivirus program\n6. Play the game\n7. Support the companies, which software you actually enjoy\t","torrent":{"xt":"urn:btih:6791c07ee6fc9aea36b4fa8a02eead37d88c6601","amp;dn":"Tony.Hawks.Pro.Skater.HD-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6791c07ee6fc9aea36b4fa8a02eead37d88c6601","infoHashBuffer":{"type":"Buffer","data":[103,145,192,126,230,252,154,234,54,180,250,138,2,238,173,55,216,140,102,1]},"announce":[],"urlList":[]}}