{"title":"Breakin.Em.In.17.XviD-PORNOLATiON","uid":7619915,"size":1465458688,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:67a367744fab1ef5482ebff7f2b8e9c1156cf674&amp;dn=Breakin.Em.In.17.XviD-PORNOLATiON&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"chkm8te","files":2,"time":1347301183,"description":"Breakin Em In 17 XviD - PORNOLATiON\n\nStarring\tRiley Reid, Charlie Moore, Andrea Acosta, Caroline Munroe, Zoey Nixon\n\n5 Horny Newbies Ready For The Porno Plunge!\n\n21 Year Old Riley Reid - Cum Bubbles!\n\nCarolina Munro - Imported from Norway!\n\nZoey Nixon - Video Virgin! Andrea Acosta - Very First Anal!\n\n21 year old Riley Reid Needs No Introduction. This natural born nymph finally meets up with Vince Vouyer's cock! Riley's sexual experience and know how is that of an experienced woman. Riley truly knows what a cock is for and knows how to use it. She gags on it enough to create enough saliva to blow saliva bubbles on the head of Vince's cock before mounting up and riding that cock like she has not seen one in months. Riley is in a sexual league of her own!\n\n20 Year old Charley Monroe is one of the hottest Newbies I've seen in some time. This Hispanic beauty has the biggest blue eyes and perky tits with a nice round ass not to mention her always wet sweet spot. This only being Charley's 2nd scene in Porn her nervousness still shows in her talking, but when Charley saw how big Chris Strokes cock was she forgot about her nervousness and did what every 20 year old girl does naturally and put it in her mouth, sucked it, and bounced her pussy on it and took his load on her pretty face. Welcome to porno Charley!\n\n18 Year Old Red Head Zoey Nixon Gets her Porno Cherry Popped by Chris Strokes. Go big or go home is the theme of this pussy pounding. Zoey's voice and eager attitude is priceless not to mention her all natural rack and tiny pussy. Zoey comments that she just likes to get people off! And let me tell you when you see this newbie taking the cock you will rub one out. Zoey is a must see!\n\nVenezuelan Slut Andrea Acosta is fairly new to porn and decides to take the Anal Plunge via Vince Vouyer's Cock. At 31 years old Andrea is no stranger to cock. Her sexual appetite was amazing this woman was on the cock from start to finish spreading all her holes with an ear to ear smile. Andrea also loves to lick man ass and does so several times along with tasting her own ass. Anal Virgin no more!\n\nImported from Norway, Carolina Monro celebrates her 1st week in porn with only 1 scene on record, so I have her come over to shoot scene number 2. Talon takes on this 5' 10&quot; Viking with Huge Boobs, Long Ass Legs, and one of the tiniest pussies I have ever seen. Watching Carolina spread her long legs exposing her sweet spot is quite the treat. Carolina says her favorite is sucking cock from around the world. Welcome to America Carolina!\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=wf3gidinlionnbiuu8i8.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=wf3gidinlionnbiuu8i8.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=rzrmshe9a3vxiph2oqai.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=rzrmshe9a3vxiph2oqai.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=dxmezt2ud0ln9m1q1bml.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=dxmezt2ud0ln9m1q1bml.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:67a367744fab1ef5482ebff7f2b8e9c1156cf674","amp;dn":"Breakin.Em.In.17.XviD-PORNOLATiON","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67a367744fab1ef5482ebff7f2b8e9c1156cf674","infoHashBuffer":{"type":"Buffer","data":[103,163,103,116,79,171,30,245,72,46,191,247,242,184,233,193,21,108,246,116]},"announce":[],"urlList":[]}}