{"title":"Lynne Olsen - Citizens of London [96] Unabridged","uid":7623759,"size":773975826,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:687c5972115b3f96e5218914281a8dfd9327f2cf&amp;dn=Lynne+Olsen+-+Citizens+of+London+%5B96%5D+Unabridged&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rambam1776","files":-1,"time":1347387216,"description":"Lynne Olsen - Citizens of London: The Americans Who Stood with Britain in Its Darkest, Finest Hour [2011]\n\nRead by Arthur Morey; 96 kbps, Unabridged\n\nOverview\n&quot;In Citizens of London, Lynne Olson has written a work of World War II history. Here is the behind-the-scenes story of how the United States forged its wartime alliance with Britain, told from the perspective of three key American players in London: Edward R. Murrow, Averell Harriman, and John Gilbert Winant. Drawing from a variety of primary sources, Olson depicts the dramatic personal journeys of these men who, determined to save Britain from Hitler, helped convince a cautious Franklin Roosevelt and a reluctant American public to support the British at a critical time.&quot; Citizens of London, however, is more than just the story of these Americans and the world leaders they aided and influenced. It's an account of the transformative power of personal diplomacy and, above all, a rich, panoramic tale of two cities: Washington, D.C., a lazy Southern town slowly growing into a hub of international power, and London, a class-conscious capital transformed by the Blitz into a model of stoic grace under violent pressure and deprivation.\n\nEditorial Reviews\n\nPublishers Weekly\nThe Anglo-American alliance in WWII was not inevitable, writes former Baltimore Sun correspondent Olson (Troublesome Young Men). In this ingenious history, he emphasizes the role of three prominent Americans living in London who helped bring it about. Best known was Edward R. Murrow, head of CBS radio's European bureau after 1937. His pioneering live broadcasts during the blitz made him a celebrity, and Olson portrays a man who worked tirelessly to win American support for Britain. Most admirable of the three was John Winant, appointed American ambassador in 1941. A true humanitarian, he skillfully helped craft the British-American alliance. And most amusing was Averell Harriman, beginning a long public service career. In 1941, FDR sent the wealthy, ambitious playboy to London to oversee Lend-Lease aid. He loved the job, but made no personal sacrifices, living a luxurious life as he hobnobbed with world leaders and carried on an affair with Churchill's daughter-in-law. Olson, an insightful historian, contrasts the idealism of Winant and Murrow with the pragmatism of Harriman. But all three men were colorful, larger-than-life figures, and Olson's absorbing narrative does them justice.\n\nTable of Contents\n\n1 &quot;There's No Place I'D Rather Be Than in England&quot; 3\n2 &quot;You Are the Best Reporter in All of Europe&quot; 27\n3 The Opportunity of a Lifetime 53\n4 &quot;He Seems to Get Confidence in Having Us Around&quot; 75\n5 Members of the Family 95\n6 &quot;Mr. Harriman Enjoys My Complete Confidence&quot; 114\n7 &quot;I Want to Be in it with You-From the Start&quot; 126\n8 &quot;Pearl Harbor Attacked?&quot; 138\n9 Creating the Alliance 147\n10 &quot;An Englishman Spoke in Grosvenor Square&quot; 163\n11 &quot;He'll Never Let Us Down&quot; 176\n12 &quot;Are We Fighting Nazis or Sleeping with Them?&quot; 185\n13 The Forgotten Allies 205\n14 &quot;A Caul of Privilege&quot; 227\n15 &quot;A Chase Pilot-First, Last, and Always&quot; 248\n16 &quot;Crossing the Ocean Doesn't Automatically Make You a Hero&quot; 272\n17 &quot;You Will Find Us Lining Up with the Russians&quot; 293\n18 &quot;Would the Damn Thing Work?&quot; 311\n19 Crisis in the Alliance 335\n20 &quot;Finis&quot; 354\n21 &quot;I Shall Always Feel That I Am a Londoner&quot; 365\n22 &quot;We All Lost a Friend in ?Im&quot; 378","torrent":{"xt":"urn:btih:687c5972115b3f96e5218914281a8dfd9327f2cf","amp;dn":"Lynne+Olsen+-+Citizens+of+London+%5B96%5D+Unabridged","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"687c5972115b3f96e5218914281a8dfd9327f2cf","infoHashBuffer":{"type":"Buffer","data":[104,124,89,114,17,91,63,150,229,33,137,20,40,26,141,253,147,39,242,207]},"announce":[],"urlList":[]}}