{"title":"Image Filter Pro 100 1.1","uid":7790877,"size":7385737,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:68d6d9dc6ecb8e1bf605e501ed0b79243f327b10&amp;dn=Image+Filter+Pro+100+1.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"wallpwallpapers","files":-1,"time":1352022897,"description":"Just imagine -- you've been tasked with maintaining a website that's laden with images, and you need a way to be able to capture those images quickly so that you can work on them. Well, how would you like the ability to capture all of the images on any website, in just a few clicks of your mouse? Even better, how great would it be to wield the power to apply multiple filters and special effects to entire libraries of images, automatically?\n\nImage Filter Pro will instantly streamline your workflow when it comes to acquiring and editing digital images. With Image Filter Pro, you can save all of the images off of any website, then apply multiple filters to your images, condensing hours of toil into just a few minutes of effort.\n\nWith Image Filter Pro, you'll be able to store collections of filters in Filter Groups, with the power to apply them all in a single click, either to individual images or entire folders using batch processing. With over 100 filters to choose from, including a vast selection of color filters, transforms, HSL filters, and edge detectors, you'll be able to implement site-wide changes to your images using just a few clicks!","torrent":{"xt":"urn:btih:68d6d9dc6ecb8e1bf605e501ed0b79243f327b10","amp;dn":"Image+Filter+Pro+100+1.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68d6d9dc6ecb8e1bf605e501ed0b79243f327b10","infoHashBuffer":{"type":"Buffer","data":[104,214,217,220,110,203,142,27,246,5,229,1,237,11,121,36,63,50,123,16]},"announce":[],"urlList":[]}}