{"title":"Universal Soldier 2012 Cam MP4 GLOBE.mp4","uid":7765457,"size":792369576,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:696255e98ee90714850212a8fc3c82e009488ff6&amp;dn=Universal+Soldier+2012+Cam+MP4+GLOBE.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"globeplus","files":1,"time":1351360567,"description":"* MP4 CAM  * 01H53M20S    * + 1500 Bitrate    * Worked with the Dub plugins\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n* Plot :\n\nJohn (Scott Adkins) awakens from a coma to discover his wife and daughter were slaughtered in a brutal home invasion. Haunted by images of the attack, he vows to kill the man responsible: Luc Deveraux (Jean-Claude Van Damme). While John tries to piece his reality back together, things get more complicated when he is pursued by a relentless UniSol named Magnus (Andrei Arlovski). Meanwhile, Deveraux and surviving UniSol Andrew Scott (Dolph Lundgren) are preparing to battle anarchy and build a new order ruled by Unisols without government oversight. They are weeding out the weak and constantly testing their strongest warriors in brutal, life-and-death combat. Luc has emerged operating the Unisol Church of Eventualism, taking in wayward Unisols whom the government has been secretly operating as remote-controlled sleeper agents. His mission is to liberate these Unisols from the implanted memories and the lies the government has inserted in them. As John gets closer to Deveraux and the rogue army of genetically enhanced warriors, he discovers more about himself and begins to call into question everything he believed to be true.\n\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n* GLOBE FILES 2012","torrent":{"xt":"urn:btih:696255e98ee90714850212a8fc3c82e009488ff6","amp;dn":"Universal+Soldier+2012+Cam+MP4+GLOBE.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"696255e98ee90714850212a8fc3c82e009488ff6","infoHashBuffer":{"type":"Buffer","data":[105,98,85,233,142,233,7,20,133,2,18,168,252,60,130,224,9,72,143,246]},"announce":[],"urlList":[]}}