{"title":"Daniella Sacordoti - Watch Over Me - ePub, MOBI - Barbie1710","uid":7799385,"size":743638,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:69c8326dda09eebeee3c4271a7c3041d8d720005&amp;dn=Daniella+Sacordoti+-+Watch+Over+Me+-+ePub%2C+MOBI+-+Barbie1710&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Barbie1710","files":6,"time":1352240363,"description":"Debut Novel - Daniella Sacordoti - Watch Over Me - ePub, MOBI - Barbie1710\n\nEilidh Lawson's life has just been turned upside down. Her marriage is ending and she's lost her much longed-for baby. Mentally and physically exhausted, she's not sure what to do but feels oddly compelled to return to Glen Avich, a small village in the Scottish Highlands, where her family has lived for generations. Here, she meets her best friend from childhood, Jamie McAnena, who is raising his daughter alone. Following the death of his mother, Elizabeth, Jamie has resigned himself to being a family of two, closing himself off and devoting his life to his daughter, Maisie. What none of them can know is that it is Elizabeth who has called Eilidh back to Glen Avich. Though dead for three years, she has not been able to leave Jamie behind in his lost and lonely state. Now, she starts working behind the scenes for Jamie and Eilidh to get close again, but both are scared of repeating the past and Elizabeth's influence can only reach so far. An ethereal tale narrated from several different perspectives, &quot;Watch Over Me&quot; is a beautifully written debut novel. It is a poignant yet subtle story about letting go and moving on - with a little bit of help from beyond the grave.\n\n\nThis is a multi-tracker torrent.  Please check your Bit-Torrent client for the true number of seeds.  Enjoy &amp; Please Seed","torrent":{"xt":"urn:btih:69c8326dda09eebeee3c4271a7c3041d8d720005","amp;dn":"Daniella+Sacordoti+-+Watch+Over+Me+-+ePub%2C+MOBI+-+Barbie1710","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69c8326dda09eebeee3c4271a7c3041d8d720005","infoHashBuffer":{"type":"Buffer","data":[105,200,50,109,218,9,238,190,238,60,66,113,167,195,4,29,141,114,0,5]},"announce":[],"urlList":[]}}