{"title":"POtHS - Biblical Times - 08 - Esther - Jeremiah - Solomon","uid":7774101,"size":4809113207,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6add5a612fb809877eba006ba69d168691973588&amp;dn=POtHS+-+Biblical+Times+-+08+-+Esther+-+Jeremiah+-+Solomon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":59,"time":1351612861,"description":"\n\nPOtHS\nPouring Out the Holy Spiritruth\n\n\nBiblical Times\n\n\n\n\nPOtHS - Biblical Times - 08 - Esther - Jeremiah - Solomon\n\n\n\nPOtHS says: 3 More Outstanding Movies\n\nDescription:\n\nJeremiah:\n\nThe young Jeremiah grows up in a priest's family in the village of Anathoth, near Jerusalem. God appears to Jeremiah in different human guises on several occasions, and makes it clear to him that he has been selected to announce God's message to the people of Jerusalem: a mighty ruler from the north will attack the Kingdom of Judah if the people there continue to worship false idols, and fail to remember the One God. No-one in Anathoth believes Jeremiah's prophecy, however. Instead, he is accused\n\nSolomon:\n\nDavid, now an old man, is still king of Israel. Among his sons, the ambitious Adonijah and the clever Solomon. The two young men are fierce rivals, since both are prospective heirs to the throne and only one can be successful. During a hunting expedition, Adonijah challenges his younger brother Solomon to a chariot race. While Solomon, though brave, still retains a modicum of caution, the daredevil Adonijah is eager to win at all costs -- and loses control of his chariot. Solomon takes the seriously injured Adonijah back to Jerusalem. \n\nEsther:\n\nAhasuerus (Xerxes I), King of the Persians, whose empire now extends from India to Egypt after the defeat of the Babylonians, is holding a celebratory banquet for his people in the citadel of Susa to display his wealth and splendor. When he summons his attractive wife Vashti, to show off her beauty to the guests, the proud queen refuses to come. The king promptly bans her from ever entering his presence again, and gives orders for the most beautiful young virgins in the land to be brought to him. The young Jewess Esther, adopted daughter of her uncle Mordecai, is among the girls selected; they are told to beautify themselves in the royal harem and prepare to spend the night with the king. \n \nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n\n                                           \n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n","torrent":{"xt":"urn:btih:6add5a612fb809877eba006ba69d168691973588","amp;dn":"POtHS+-+Biblical+Times+-+08+-+Esther+-+Jeremiah+-+Solomon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6add5a612fb809877eba006ba69d168691973588","infoHashBuffer":{"type":"Buffer","data":[106,221,90,97,47,184,9,135,126,186,0,107,166,157,22,134,145,151,53,136]},"announce":[],"urlList":[]}}