{"title":"SMPlayer 0.6.9 portable multilang. by tsopperas  (ZIP)","uid":6826354,"size":38976914,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6b15f53ce3020fcc576c1687e3d1a92bbb05c9db&amp;dn=SMPlayer+0.6.9+portable+multilang.+by+tsopperas++%28ZIP%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tsopperas","files":4,"time":1321578336,"description":"SMPlayer 0.6.9 portable multilang. ZIP\n\nSMPlayer intends to be a complete front-end for MPlayer, from basic features like playing videos, DVDs, and VCDs to more advanced features like support for MPlayer filters and more.\n\nOne of the most interesting features of SMPlayer: it remembers the settings of all files you play. So you start to watch a movie but you have to leave... don't worry, when you open that movie again it will resume at the same point you left it, and with the same settings: audio track, subtitles, volume...\n\nOther additional interesting features:\n\n    * Configurable subtitles. You can choose font and size, and even colors for the subtitles.\n    * Audio track switching. You can choose the audio track you want to listen. Works with avi and mkv. And of course with DVDs.\n    * Seeking by mouse wheel. You can use your mouse wheel to go forward or backward in the video.\n    * Video equalizer, allows you to adjust the brightness, contrast, hue, saturation and gamma of the video image.\n    * Multiple speed playback. You can play at 2X, 4X... and even in slow motion.\n    * Filters. Several filters are available: deinterlace, postprocessing, denoise... and even a karaoke filter (voice removal).\n    * Audio and subtitles delay adjustment. Allows you to sync audio and subtitles.\n    * Advanced options, such as selecting a demuxer or video &amp; audio codecs.\n    * Playlist. Allows you to enqueue several files to be played one after each other. Autorepeat and shuffle supported too.\n    * Preferences dialog. You can easily configure every option of SMPlayer by using a nice preferences dialog.\n    * Possibility to search automatically for subtitles in opensubtitles.org.\n    * Translations: currently SMPlayer is translated into more than 20 languages, including Spanish, German, Greece, French, Italian, Russian, Chinese, Japanese....\n    \n    * SMPlayer is under the GPL license.\n\n\n\n\n\n\n                =\n        =         =\n                    =\n       = =  ======   = =\n      =   =         =   =\n       = =           = = \n..............................by: tsopperas!\n\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/tsopperas&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/tsopperas&lt;/a&gt;","torrent":{"xt":"urn:btih:6b15f53ce3020fcc576c1687e3d1a92bbb05c9db","amp;dn":"SMPlayer+0.6.9+portable+multilang.+by+tsopperas++%28ZIP%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b15f53ce3020fcc576c1687e3d1a92bbb05c9db","infoHashBuffer":{"type":"Buffer","data":[107,21,245,60,227,2,15,204,87,108,22,135,227,209,169,43,187,5,201,219]},"announce":[],"urlList":[]}}