{"title":"Melissa Harris-Perry 9-30-12.mp4","uid":7697485,"size":417583702,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6c7e84e32db69b295954a828765b48103055689d&amp;dn=Melissa+Harris-Perry+9-30-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":-1,"time":1349401900,"description":"Melissa Harris-Perry; Sunday, September 30, 2012.\n\nSunday, Melissa and her guests got technical in a number of ways, including an examination of technology in our politics, how early voting is going and will go whether people are voting on paper or using a computer and the upcoming debates. She also took the mess Scott Brown has made for himself with race-baiting Elizabeth Warren to look at race as a social construct. They also discussed sex trafficking and slavery, which also has a disturbing online aspect they explored.\n\nKeep an eye out also for another sterling Footnote, and Melissa's daughter making a cameo! They also invited these folks into #nerdland:\n\nJonathan Capehart (opinion writer at the Washington Post), Victoria DeFrancesco Soto (NBC Latino contributor, director of communications for Latino Decisions, and fellow at the LBJ School at the University of Texas), Jamal Simmons (democratic consultant at the Raben Group), Katon Dawson (former South Carolina GOP chair, and former senior advisor to Gov. Rick Perry's presidential campaign) discussed the debate Romney would later win.\n\nAmy Jo Martin (founder and CEO of Digital Royalty, and author of the upcoming &quot;Renegades Write the Rules&quot;) replaced Johnathan Capehart on the panel that discussed social media and the campaign.\n\nJohnathan Capehart replaced Amy Jo Martin on the panel that discussed race as a factor in the 2012 Mass. senate race (Brown).\n\nKevin Gover (director of the Museum of the American Indian, civil rights attorney, and member of the Pawnee tribe) joined via satellite on native reaction.\n\nAsia Graves (survivor of human trafficking, and case manager at Fair Girls) replaced Jamal Simmons. Andrea Powell (executive director and co-founder of Fair Girls) replaced Katon Dawson. The panel discussed sex-trafficking in America.\n\nFootnote: A woman was ridiculed on the web but responded with an olive branch.","torrent":{"xt":"urn:btih:6c7e84e32db69b295954a828765b48103055689d","amp;dn":"Melissa+Harris-Perry+9-30-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c7e84e32db69b295954a828765b48103055689d","infoHashBuffer":{"type":"Buffer","data":[108,126,132,227,45,182,155,41,89,84,168,40,118,91,72,16,48,85,104,157]},"announce":[],"urlList":[]}}