{"title":"POtHS - Gov Assassins - 02 - James Holmes JFK Conspiracies - Why","uid":7754330,"size":4625390962,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6d12d026afd026a83d01509eaa1c34c0af576733&amp;dn=POtHS+-+Gov+Assassins+-+02+-+James+Holmes+JFK+Conspiracies+-+Why&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"POtHS11","files":112,"time":1351048516,"description":"\n\nPOtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - Gov Assassins - 02 - James Holmes JFK Conspiracies - Why It Matters Today\n\n\n\n\n\n\nPOtHS says:  Who done it???   It is always the Banksters that did it..\n\nDescription:\n\nIt's time to wise up to the societal manipulation and government/elite puppet show to control the masses in a vast multifaceted deception.  This secret government network of assassins, brainwashing tactics and intricate web of deceptions invovling disinformation of the media centers, education systems and entertainment outlets to control, manipulate, dumb-found, and enslave the people to further their efforts to bring about the global New World Order and One World Religion.  All who oppose them, place themselves and loved ones in jeporady on the front-lines in the battle.  Do you have what it takes to make a stand against these evils and do you the right thing?\n\n\nThe James Holmes Conspiracy 2012:\nFor those who do not believe the story we are being told by the government and media. The James Holmes Conspiracy. Several witness testimonies, news reports, theories and ideas behind the motives of the crime. Topics discussed include the second suspect, weapons, police audio analysis, James Holmes education and bio, LIBOR scandal, MK Ultra, Project Gunrunner, and several other important elements. Several new pieces of evidence and testimonies all in one video.\n\nDocumentary made by Mark Howitt\nVideo published on August 14th 2012\n\nThis video has been blocked in these locations:\nGuernsey, Ireland, Isle of Man, Italy, Jersey, United Kingdom\n-------------------------------------------------------------\n\nJFK Assassination Videos:\nJFK\nJFK-ASSASSINATED by the US Government\nWhat Happened To JFK &amp; Why It Matters Today - Jim Fetzer\nBill Cooper on JFK death\nConspiracy Theory Jesse Ventura on JFK Assassination Deathbed Confession\n\n \nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n\n                                           \n\n      :thankyou:    :thankyou:    Thank You JESUS  \n \n","torrent":{"xt":"urn:btih:6d12d026afd026a83d01509eaa1c34c0af576733","amp;dn":"POtHS+-+Gov+Assassins+-+02+-+James+Holmes+JFK+Conspiracies+-+Why","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d12d026afd026a83d01509eaa1c34c0af576733","infoHashBuffer":{"type":"Buffer","data":[109,18,208,38,175,208,38,168,61,1,80,158,170,28,52,192,175,87,103,51]},"announce":[],"urlList":[]}}