{"title":"Rifftrax - Halloween.avi","uid":7630583,"size":800304128,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6db1e39a2b57b3ad82269711a78056d2f2da9f6e&amp;dn=Rifftrax+-+Halloween.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jose1337","files":1,"time":1347524649,"description":"As with all Rifftrax movies if you want the original theatrical, or DVD version's of this movie then this is not the torrent you are looking for...\n*******************************************************************************\nThe most shocking Halloween-related thing ever -- with the possible exception of the joke about Mrs. Ghost not being able to get pregnant because Mr. Ghost had a hollow weenie. But in a respectable 2nd place, anyway, is Halloween, the horrifying tale of an evil madman named Mike Myers (as if his Simon character wasn't chilling enough) who terrorizes a babysitter by putting on a jumpsuit and hiding in the hedge. (A technique now widely used by custodians the world over.)\n\nFeaturing the blood curdling theme song by director John Carpenter in which he hits a G on a piano key 900 times, then a C about 738 times and then hammers on the G for a time before hitting a G# and then starting the process over again and repeating it several hundred thousand times. Because he was too chicken to sit in the dark and watch it by himself, Mike enlisted the help of his old pal Kevin Murphy for this hilarious RiffTrax. You'll scream, you'll laugh, you'll jump out of your seat! (And then you should probably start watching the movie).\n\n*******************************************************************************\nAs always donate or purchase the MP3's fromto keep these coming...","torrent":{"xt":"urn:btih:6db1e39a2b57b3ad82269711a78056d2f2da9f6e","amp;dn":"Rifftrax+-+Halloween.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6db1e39a2b57b3ad82269711a78056d2f2da9f6e","infoHashBuffer":{"type":"Buffer","data":[109,177,227,154,43,87,179,173,130,38,151,17,167,128,86,210,242,218,159,110]},"announce":[],"urlList":[]}}