{"title":"Slackel Linux Live KDE 4.9.2 (64-bit)","uid":7784194,"size":1059954688,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:6dc27f8a03dbf2b20154a8bca3e45e3fe62ff2df&amp;dn=Slackel+Linux+Live+KDE+4.9.2+%2864-bit%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"JRepin","files":-1,"time":1351854698,"description":"Slackel is a Linux distribution and LiveCD based on Slackware and Salix. It is fully compatible with Slackware and Salix but the difference is that it includes the current version of Slackware and the latest version of KDE in the repository. Thus users of Slackware and Salix can benefit from the Slackel repositories, to use the latest version of KDE. Slackel disc images are offered in two different forms, Installation disc image and Live disc image.\n\nSlackel Live kde-4.9.2 includes the current tree of Slackware and KDE 4.9.2 accompanied by a very rich collection of KDE centric software. Linux kernel 3.2.29,  Firefox 16.0.2, KMail, Ktorrent, Akregator, Kopete, OpenJRE-7u9 (OpenJDK-7u9 is on repos), rhino, icedtea-web, Pidgin and Gftp, gparted, Wicd, slapt-get and its graphical frontend Gslapt, sourcery.\n\nIn the multimedia section Bangarang 2.1, Clementine 1.0.1, K3b 2.0.2 included. The Salix codecs installer application can be used, to quickly and easily install patent encumbered codecs to your system.\n\nA wide variety of office applications are included. Calligra Words, Calligra Stage, Calligra Tables are the main office applications present while there are many more like KOrganizer, KAddressBook and the Okular document viewer.\n\nIn the graphics section  Krita, Karbon, Gwenview, KColorChooser, KSnapshot.","torrent":{"xt":"urn:btih:6dc27f8a03dbf2b20154a8bca3e45e3fe62ff2df","amp;dn":"Slackel+Linux+Live+KDE+4.9.2+%2864-bit%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6dc27f8a03dbf2b20154a8bca3e45e3fe62ff2df","infoHashBuffer":{"type":"Buffer","data":[109,194,127,138,3,219,242,178,1,84,168,188,163,228,94,63,230,47,242,223]},"announce":[],"urlList":[]}}