{"title":"Homicidios 1x08 DVB Spanish by tony","uid":6793237,"size":578999334,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6fe8f461eeac0b692da723d9821fa334d0b78e23&amp;dn=Homicidios+1x08+DVB+Spanish+by+tony&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"carambolas","files":3,"time":1320349680,"description":"Si quieres mas series, peliculas, juegos, etc... tanto por descarga directa como por torrent. visitanos:\n      &lt;a href=&quot;\nhttp://www.tonytorrent.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tonytorrent.com&lt;/a&gt;\n\nUn experto conocedor de la conducta, TomÃƒÂ¡s SÃƒÂ³ller (Eduardo Noriega) y una eficaz inspectora jefe, Eva HernÃƒÂ¡ndez (Celia Freijeiro) suman fuerzas para investigar complejas tramas delictivas en Homicidios.\nLa colaboraciÃƒÂ³n entre SÃƒÂ³ller y la unidad de Eva comienza cuando tienen que enfrentarse a un peligroso asesino en serie.\nSÃƒÂ³ller y HernÃƒÂ¡ndez -que se reencuentran tras una relaciÃƒÂ³n en el pasado- simbolizan dos visiones diferentes, aunque complementarias, de resolver un mismo caso: SÃƒÂ³ller encarna la investigaciÃƒÂ³n basada en el profundo conocimiento del comportamiento del ser humano, mientras que Eva representa la investigaciÃƒÂ³n tradicional de la policÃƒÂ­a, basada en el anÃƒÂ¡lisis de pruebas fÃƒÂ­sicas y la declaraciÃƒÂ³n de testigos y acusados.\nEl equipo multidisciplinar de investigaciÃƒÂ³n criminal estÃƒÂ¡ supervisado por un comisario de la vieja escuela, AndrÃƒÂ©s Ramos (Mariano Venancio) e integrado por un astuto subinspector curtido en la Brigada de Estupefacientes, Alonso Izquierdo (Carlos GarcÃƒÂ­a); un disciplinado subinspector que se mueve como pez en el agua en la Brigada de Homicidios, Pablo Montero (Enrique Berrendero); una subinspectora novata reciÃƒÂ©n llegada a la unidad, MarÃƒÂ­a Losada (Vicky Luengo); y una sarcÃƒÂ¡stica forense que adora su trabajo, Susana Rota (Marian Aguilera).\nAdemÃƒÂ¡s, la serie contarÃƒÂ¡ con otros personajes fijos como Lorenzo SantamarÃƒÂ­a (Mingo RÃƒÂ fols), inspector jefe antagonista de Eva; Carlos GarcÃƒÂ­a-Aranda (Miguel de Miguel), un juez honesto y polÃƒÂ­ticamente correcto; Helena Cuevas (Esmeralda Moya), una atractiva camarera; y Patricia Vega (RocÃƒÂ­o MuÃƒÂ±oz), una ambiciosa periodista de un diario nacional.","torrent":{"xt":"urn:btih:6fe8f461eeac0b692da723d9821fa334d0b78e23","amp;dn":"Homicidios+1x08+DVB+Spanish+by+tony","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fe8f461eeac0b692da723d9821fa334d0b78e23","infoHashBuffer":{"type":"Buffer","data":[111,232,244,97,238,172,11,105,45,167,35,217,130,31,163,52,208,183,142,35]},"announce":[],"urlList":[]}}