{"title":"Thief and the Cobbler Color Test Reel","uid":7694814,"size":1002151236,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:70cd82ffb703a364d10532f0729c30f2b9f5e66f&amp;dn=Thief+and+the+Cobbler+Color+Test+Reel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tygerbug","files":1,"time":1349326829,"description":"Here's a curio for Thief and the Cobbler fans. 32 minutes of color\ntests shot on video at Richard Williams Studios. The PAL VHS video\nis clear and clean and we get a good look at details of various\nshots from the film, including the edges of the cels and things\nwe're not supposed to see. Some shots appear without backgrounds.\nThe entire reel is without sound.\n\nIt's like a pencil test reel, except this isn't pencils - the video camera is\nshooting the fully-colored cels for testing purposes.\n\nNOTE: This has a smaller file size and better quality than the previous torrent\nof the same name! It's in its original DVD format.\n\n Rare original footage from this lost animation classic, written and \ndirected by three-time Academy Award winning animator Richard Williams \n(animation director of Who Framed Roger Rabbit).\n\n  On a certain Tube video site, [TheThiefArchive] you can see The Thief and the \nCobbler: Recobbled Cut, an unofficial restoration of the film by Garrett \nGilchrist. (orangecow.org)\n\n   Nearly 30 years in the making, a labor of love by a team of animation greats,\n this was to be the masterpiece of Williams' career, perhaps the most ambitious \nindependent animated film ever conceived. Williams funded the film over the \nyears with his millions of dollars of his own money, until after Roger Rabbit, \nWarner Brothers decided to fund the film. The Thief was the inspiration for \nDisney's film Aladdin, which proved to be its undoing. After over two decades of \nwork, the film was taken away from Williams when he couldn't meet his deadline. \nIt was eventually recut and destroyed, bought by Disney and destroyed further.\n\nAlso known (in horrifically butchered form) as Arabian Knight and The Princess \nand the Cobbler.\t\t\t\t\n\n","torrent":{"xt":"urn:btih:70cd82ffb703a364d10532f0729c30f2b9f5e66f","amp;dn":"Thief+and+the+Cobbler+Color+Test+Reel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70cd82ffb703a364d10532f0729c30f2b9f5e66f","infoHashBuffer":{"type":"Buffer","data":[112,205,130,255,183,3,163,100,209,5,50,240,114,156,48,242,185,245,230,111]},"announce":[],"urlList":[]}}