{"title":"The Black Star by Johnston McCulley [republicV]","uid":7795945,"size":1087433,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:71e9397d3a7d88f0ea2c474df644072a248b0288&amp;dn=The+Black+Star+by+Johnston+McCulley+%5BrepublicV%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"republicV","files":-1,"time":1352144556,"description":"The Black Star was a master criminal who took great care to never be identifiable, always wore a mask so nobody knew what he looked like, rarely spoke to keep his voice from being recognized, and the only mark left at the scenes of the crimes which he and his gang committed were small black stars which were tacked as a sign of their presence, and an occasional sarcastic note to signify his presence and responsibility. Even those who worked for him knew nothing of him, all of which were making his crimes virtually unsolvable. The police were at a complete loss as to his identity and at a method of stopping his criminal activities. He seemed to have the perfect strategic setup and all advantages were in his favor. He even somehow knew where the wealthy kept their jewels and money, and knew when they would remove valuable items from their safes and deposit boxes. Thus Roger Verbeck decided to take on the case of the Black Star using his own methodology. The Black Star will keep you guessing from beginning to end, just as he kept the police and Verbeck guessing.\n\nJohnston McCulley was a prolific writer in the pulp fiction vein, and his Zorro series would become immensely popular. However, prior to Zorro, the Black Star was among his first repeating characters which kept readers of the day in continual suspense until his next appearance. McCulley also wrote mysteries and detective stories using various pseudonyms, including Harrison Strong.","torrent":{"xt":"urn:btih:71e9397d3a7d88f0ea2c474df644072a248b0288","amp;dn":"The+Black+Star+by+Johnston+McCulley+%5BrepublicV%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71e9397d3a7d88f0ea2c474df644072a248b0288","infoHashBuffer":{"type":"Buffer","data":[113,233,57,125,58,125,136,240,234,44,71,77,246,68,7,42,36,139,2,136]},"announce":[],"urlList":[]}}