{"title":"Never Say No to Panda!","uid":7676573,"size":10598875,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:72315ad5c30130ee50260e5a9525f8e03f9a2da7&amp;dn=Never+Say+No+to+Panda%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"YahSoft","files":-1,"time":1348710655,"description":"[Enjoy and Seed - YahSoft]\n\nNever Say No To Panda\n\nLength: 02min45s\nResolution: 462x320\nFormat: .mp4\nFPS: 25\nAudio Channels: 2\nAudio Power: 44kHz\t\n\n\n\nNever Say No to Panda is a 2010 series of television commercials produced in Egypt by Advance Marketing for Arab Dairy, manufacturers of Panda Cheese. The commercials, which feature a giant panda who terrorizes people for not wanting to try the cheese, have become a viral Internet hit.\n\n\nPremise\n\nIn each commercial, a person is offered to try Panda cheese, to which he declines. This causes a giant panda to suddenly appear in front of him while the Buddy Holly song &quot;True Love Ways&quot; plays in the background. The panda stares at the person for a few seconds before it goes into a violent outburst and destroys everything around them, whether it is wrecking an office computer or pouring marinara sauce all over an unprepared pizza. One example is a pair of commercials featuring a father and son at the grocery store. The son suggests they buy Panda cheese, but the father says their shopping cart is full. The panda appears and stares at the father before tipping over the shopping cart and stomping on the spilled merchandise. On the second commercial where the father and son return to the grocery, the father is intimidated by the panda enough to buy two boxes of Panda cheese before everyone walks away peacefully.\nAwards\n\nThe commercials won two grands prix at the 2010 Dubai Lynx","torrent":{"xt":"urn:btih:72315ad5c30130ee50260e5a9525f8e03f9a2da7","amp;dn":"Never+Say+No+to+Panda%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72315ad5c30130ee50260e5a9525f8e03f9a2da7","infoHashBuffer":{"type":"Buffer","data":[114,49,90,213,195,1,48,238,80,38,14,90,149,37,248,224,63,154,45,167]},"announce":[],"urlList":[]}}