{"title":"Dinosaur War","uid":7785183,"size":16541030,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:726517423f0b6fd05f94a104ec4e28553a3b63d7&amp;dn=Dinosaur+War&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Honda1890","files":1,"time":1351876492,"description":"Dinosaur War brings you back to the most fierce prehistoric battles!\nDark force overwhelmed the lost land, destroying the homeland where men and dinosaurs have lived in harmony for so long. Survivors are determined to unite with dinosaur allies and expel the evil off the land.\n- Build mines, pastures, stone quarries to prepare resources;\n- A variety of dinosaurs and ancient beasts wait for your recruitment;\n- Build Prey Fences, Terror Swamps, etc, to accommodate and recruit troops;\n- Win battles to obtain equipment strengthening your power;\n- Choose your weapons and armor to get equipped before fighting;\n- Jurassic Shop provides extra options of equipment for you;\n- Use crystals smartly to accelerate production, resurrect dead soldiers, etc.;\n- Increase population limit with decorations;\n- Log in often to win gold eggs;\n- Complete daily goals to win extra rewards;\n- Challenge other players online at Arena to improve your troop force.\n- Watch out &quot;Overpower Rules&quot; in central base.\n==========================\nDroidhen is the name behind Defender, Defender II, Dinosaur War, Miracle City, Basketball Shot, DH Texas Poker, Turbo Kids, Gun of Glory and many other top popular games. Droidhen is also marked as top developer by google.","torrent":{"xt":"urn:btih:726517423f0b6fd05f94a104ec4e28553a3b63d7","amp;dn":"Dinosaur+War","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"726517423f0b6fd05f94a104ec4e28553a3b63d7","infoHashBuffer":{"type":"Buffer","data":[114,101,23,66,63,11,111,208,95,148,161,4,236,78,40,85,58,59,99,215]},"announce":[],"urlList":[]}}