{"title":"Frosted Faces.iso","uid":7781421,"size":8298463232,"categoryP":"porn","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:746620f9df334b167a650ca7a6940b8d75c095ef&amp;dn=Frosted+Faces.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"jokersmoker","files":1,"time":1351785112,"description":"Frosted Faces.iso 7.73 GB \n\nDescription\nFrosted Faces\n\nFifth Element\n\nGenre: Oral \n\nCondoms: None\n\nDirector: Robert F. Lee\n\nLength: 130 Minutes\n\nDate Of Production: 12/15/03 \n\nCast: Bailey (cover), Tyla Wynn, Roxxxy Rush, Kaiya Lynn, &amp; Missy Monroe\n\n\nScene 1 ï¿½ Missy: First up is Missy, a short-haired blonde with a great natural body. Her scene begins with some quick masturbation before four well-hung guys surrounded her and demand oral. Missy drops to her knees and feverishly sucks all their cocks. The action was never over-the-top gonzo, but it was still intense and enjoyable. The guys violate her mouth for nearly 25 minutes before covering her face in a thick layer of man gravy. \n\nScene 2 ï¿½ Kaiya: I've always sbeen a huge fan of Kaiya's. Not only is she damn cute, but she has a really playful attitude that works well for porn. After showing off her petite body, Kaiya sets about the task of orally satisfying four guys. She proceeds to give them some very rough oral (often gagging and deepthroating). She showed all the energy and enthusiasm you could hope fore before the guys dump their loads on Kaiya's smiling face. \n\nScene 3 ï¿½ Roxxxy: Roxxxy is an incredibly hot brunette with a tall slender body. Roxxxy is being kept after school with five other guys. One thing leads to another and soon Roxy is on her knees sucking off all five guys. She did a great job of dividing her time between the guys. She had no trouble handling everything the guys through at her ï¿½ some gagging included. The scene ends with the guys jerking off onto Roxxxy's face. She was so covered in cum she looked like a glazed donut. \n\nScene 4 ï¿½ Bailey: The fourth scene stars another blonde cutie named Bailey. While she might not have the best body you'll ever see, it does have a very natural appeal. As soon as the camera rolls, Bailey is getting violated by four well-hung guys. They really gave it to her good and often forced to her deep throat, gag, and suck two cocks at once. Despite the rough treatment Bailey put on a good show ending with her face getting covered in nut juice. \n\nScene 5 ï¿½ Tyla: This scene has a very strange start ï¿½ four guys find Tyla crammed into an upside-down shopping cart. Once freed, Tyla rewards the guys with some incredibly oral action. Tyla is a very talented girl and she always had one cock in her mouth and one in each hand. The action stays hard and heavy until the guys end it by gibing her the obligatory cumshots to the face. \n\nFinal Thoughts: I've never been a huge fan of purely oral titles - I often find myself craving to see the girls get fucked. Despite that inherent flaw, I found all the scenes very enjoyable. The girls all showed plenty of enthusiasm and gusto, were never intimidated, and most importantly loved getting showered in cum. If you're a fan or oral DVD, you'd be hard pressed to find a better one than this. \n\n\n\nEnjoyyyyyy and Seed ....","torrent":{"xt":"urn:btih:746620f9df334b167a650ca7a6940b8d75c095ef","amp;dn":"Frosted+Faces.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"746620f9df334b167a650ca7a6940b8d75c095ef","infoHashBuffer":{"type":"Buffer","data":[116,102,32,249,223,51,75,22,122,101,12,167,166,148,11,141,117,192,149,239]},"announce":[],"urlList":[]}}