{"title":"Oliver! - Broadway Deluxe Collector's Edition [flac] 1962","uid":7698305,"size":378779459,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7571c48cc697f0ed521810539a4a7fb523d0e928&amp;dn=Oliver%21+-+Broadway+Deluxe+Collector%27s+Edition+%5Bflac%5D+1962&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"rambam1776","files":-1,"time":1349428707,"description":"Lionel Bart's wonderful musical adaptation of the Charles Dickens classic was the first London stage musical to be transplanted to Broadway with the same kind of sensation it received in Britain-- something that is now common in these post-Cats/Les Miserables times. Although no one from this British cast ever became enormously famous (future Monkee Davy Jones was in the Broadway cast)--and Sir Carol Reed's film version receives all the critical accolades--this remains the better recording, featuring all the songs cut from the film, while excluding the film's musical interludes that simply seem annoying without the visuals. Just compare Bruce Brochnik to the film's Mark Lester in the title role. Or Clive Revill to Ron Moody's Fagin. Or any of the principals, for that matter--and the differences are remarkable. --Bill Holdship\n\n\n1. Overture/Food Glorious Food\n2. Oliver!\n3. I Shall Scream\n4. Boy for Sale/Where Is Love?\n5. Consider Yourself\n6. You've Got to Pick a Pocket or Two\n7. It's a Fine Life\n8. I'd Do Anything\n9. Be Back Soon\n10. Oom-Pah-Pah\n11. My Name\n12. As Long as He Needs Me\n13. Who Will Buy?\n14. Reviewing the Situation\n15. As Long as He Needs Me (Reprise)\n16. Reviewing the Situation (Reprise)\n17. Finale\n\n2003 Deluxe Edition:\n18. Oliver!, musical: Finale\n19. Oliver!, musical: That's Your Funeral (Bonus Track)\n20. Oliver!, musical: You've Got to Pick a Pocket or Two (Bonus Track)\n21. Oliver!, musical: Reviewing the Situation (Bonus Track)\n22. Oliver!, musical: As Long As He Needs Me (Bonus Track)\n23. Interview with Donald Pippin (Spoken Word): Getting the job\n24. Interview with Donald Pippin (Spoken Word): The recording sessions\n25. Interview with Donald Pippin (Spoken Word): What a musical director has to know with children in the cast; Shirley Temple\n26. Interview with Donald Pippin (Spoken Word): Differences between the London and New York productions\n27. Interview with Donald Pippin (Spoken Word): The pit and the producer; winning the Tony Award ","torrent":{"xt":"urn:btih:7571c48cc697f0ed521810539a4a7fb523d0e928","amp;dn":"Oliver%21+-+Broadway+Deluxe+Collector%27s+Edition+%5Bflac%5D+1962","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7571c48cc697f0ed521810539a4a7fb523d0e928","infoHashBuffer":{"type":"Buffer","data":[117,113,196,140,198,151,240,237,82,24,16,83,154,74,127,181,35,208,233,40]},"announce":[],"urlList":[]}}