{"title":"ThePossession-2012-CamRip-Xvid-PORsub.avi","uid":7635920,"size":1059679696,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:75a9ae621a5569ec249eba91d16cdf3ef3b0c5b9&amp;dn=ThePossession-2012-CamRip-Xvid-PORsub.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1347643823,"description":"* CamRip XVID    * 01H26M21S    * + 1500 Bitrate    \n\n\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n\n\n* Plot :\n\nIn the opening of the film a woman tries to open a strange box, attempting to protect herself with holy water and a hammer. She starts being thrown violently around the room and having seizures. When her son enters, she is unconscious on the floor.\n\nNext the audience is introduced to couple Clyde (Jeffrey Dean Morgan) and Stephanie Brenek (Kyra Sedgwick) who are in the process of divorce, which is having an effect on their children, Em (Natasha Calis), and Hannah, (Madison Davenport). When the children move into Clyde's new house, they take time to adjust to the new split in their lives.\n\nThe next day, they stop by at a yard sale, initially to buy more dishes, but then Em becomes intrigued by an old box which has Hebrew inscriptions engraved on it. The box fascinates Em, and she asks her father if she can have it. Clyde agrees while he is talking on the phone. Clyde is busy with his ongoing job at the local university.\n\nThey hear an animalistic noise in their kitchen one night, but when the intruder escapes through their dog flap, Clyde assumes it was a raccoon.\n\nEm becomes solitary and spends all her spare time staring at the box. Em's behavior increasingly grows more sinister, with Clyde and Hannah freaking out when they see her sitting in her room surrounded by moths one night.\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n* GLOBE FILES 2012\t\t","torrent":{"xt":"urn:btih:75a9ae621a5569ec249eba91d16cdf3ef3b0c5b9","amp;dn":"ThePossession-2012-CamRip-Xvid-PORsub.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75a9ae621a5569ec249eba91d16cdf3ef3b0c5b9","infoHashBuffer":{"type":"Buffer","data":[117,169,174,98,26,85,105,236,36,158,186,145,209,108,223,62,243,176,197,185]},"announce":[],"urlList":[]}}