{"title":"ESET Smart Security 5.0.94.0 (32+64 Bit) with TNOD Licenser 1.4.","uid":6816040,"size":123738062,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:764d3ee92d4b3f01bc222e1f88c11dcf3073ce95&amp;dn=ESET+Smart+Security+5.0.94.0+%2832%2B64+Bit%29+with+TNOD+Licenser+1.4.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pestilence2k","files":-1,"time":1321210930,"description":"This torrent contains the 32-bit and 64-bit versions of ESET Smart Security 5.0.94.0, downloaded from the ESET website.  This is the best kind of fast, lean Firewall/Antivirus software to use if you don\\'t wish to use resource-consuming-hogs like Norton or AVG.\n\nAlso included is the TNOD Licenser 1.4.1.0 Final.  This program automatically searches major websites that upload ESET keys, and injects the latest valid key into ESET for you!  \n\nI have used TNOD for over a year and a half with **zero** issues, bugs, viruses, malware, etc.  ESET does not (and should not) detect TNOD as malicious.\n\n\n***Instructions:***\n\n1.) Install ESET (nt32.msi for 32-bit, nt64 for 64-bit), select options of your choice.\n2.) When asked to Register/Activate the product, select Activate Later.  Do NOT input a username and password just yet!\n3.) When ESET is installed, copy the \\&quot;TNOD-1.4.1.0 Final\\&quot; folder to a location of your choice.  Personally, I like to move it to the ESET Installation folder for easy access.\n4.) Run TNODUP.exe.  This will automatically search for and inject the latest valid license to ESET (shown by the taskbar balloons).\n5.) Run the ESET Update from within the program, and ENJOY ESET!!\n6.) If ESET tells you the license key is invalid, just run TNODUP.exe and the next available valid license will be injected.\n\n\n***Info/Notes, READ THIS!!!***\n--If the TNOD Licenser is displaying tooltips in Spanish (\\&quot;Descargando licensias...\\&quot;) or any other language, run \\&quot;Config.bat\\&quot; in the TNOD Folder.  As soon as the window opens, there is a dropdown selection for Language (\\&quot;Idioma\\&quot;).  Select English, and hit OK.  Now, when TNOD runs, it\\'ll be in English =)  At the same time, the menu options will also be in English the next time you run \\&quot;Config.bat\\&quot;.  \n\n--TNOD has a lot of available options for you to choose from. Take a look especially at the selection for \\&quot;Run at Windows Startup\\&quot;.  If you want TNOD to inject the latest license every time you startup, ensure this is checked.\n\n--There shouldn\\'t be any issues.  If there is, make sure you followed these instructions carefully.  If you still have issues, feel free to make a post here (TPB) and I\\'ll try to answer them for you.\n\n--THERE IS NO VIRUS/MALWARE! I wouldn\\'t be posting this stuff for everyone to share if it was total crap!  Any positives found should be regarded as false.\n\n--Thank you for your download, and please, SEED =)\n\n\nCheers,\n--Pestilence2k\n\n\n\n***INFO:***\n\nESET Smart Security-is an integrated product that includes anti-virus engine to \na well-known antivirus NOD32, firewall, anti-spyware module and filter for spam \nprotection. All functions ESET Smart Security is made from a single graphical \nenvironment, providing ease of setup and use program. Anti-Virus together with \nthe search function spyware will detect and remove a variety of types of \nmalicious applications. Built-in firewall actively opposes the various network \nattacks, and anti-spam filter using high-quality algorithms to recognize spam, \nget rid of unwanted mail.","torrent":{"xt":"urn:btih:764d3ee92d4b3f01bc222e1f88c11dcf3073ce95","amp;dn":"ESET+Smart+Security+5.0.94.0+%2832%2B64+Bit%29+with+TNOD+Licenser+1.4.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"764d3ee92d4b3f01bc222e1f88c11dcf3073ce95","infoHashBuffer":{"type":"Buffer","data":[118,77,62,233,45,75,63,1,188,34,46,31,136,193,29,207,48,115,206,149]},"announce":[],"urlList":[]}}