{"title":"The Ultimate Vacation collection. dvd  rip.","uid":7718442,"size":4699691576,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:76938db57381c8ca80d4d1fb368b1e45c9c03bec&amp;dn=The+Ultimate+Vacation+collection.+dvd++rip.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Msh80","files":-1,"time":1349999342,"description":"            Christmas Vacation (1989)\n\n\n\n \nThe Griswold family's plans for a big family Christmas predictably turn into a big disaster. \n\n\n\n             Christmas Vacation 2: Cousin Eddie's Island Adventure (2003)\n\n\nThough Eddie's fired right at Christmastime, his boss sends him and his family on a South Pacific vacation, hoping Eddie won't sue him after being bitten by a lab monkey. When the Tuttle family winds up trapped on a tropical island, however, Eddie manages to provide for everyone and prove himself a real man.\n\n\n\n             European Vacation (1985) \n\n\n\nThe Griswalds win a vacation tour across Europe where the usual havoc ensues.\n\n\n\n              Vacation (1983) \n\n\n\nThe Griswold family's cross-country drive to the Walley World theme park proves to be much more arduous than they ever anticipated.\n\n\n\n              Vegas Vacation (1997)\n\n\nWhen Clark Griswold puts his mind to something, we soon realize he hasn't got one. Still, nothing stops him when the vacation bug hits. This time, he's chosen Las Vegas, the new family entertainment capital of America! Chevy Chase returns as bubbly, bumbling Clark in Vegas Vacation, a jokers-are-wild laugh fest including two other stars from past Vacations. Beverly D'Angelo is back as wife Ellen, doting on the guy she calls &quot;Sparky,&quot; and Randy Quaid again delights as grubby goof ball Cousin Eddie. Ethan Embry (That Thing You Do!) and screen-debuting Marisol Nichols are Griswold teens who love the round-the-clock nightlife - as long as they don't share it with Mom and Dad! From Seigfried and Roy's extravaganza to a Hoover Dam tour, from cruising to losing (Wallace Shawn as a shifty blackjack dealer) to amorous crooning (Wayne Newton falls for Ellen): watch Clark try to keep family and wallet together.\n\n\n\n\n                    ENJOY....................................................\n\n\n\n\n\n\n\n\n\n                    SEED PLEASE!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n \n\n","torrent":{"xt":"urn:btih:76938db57381c8ca80d4d1fb368b1e45c9c03bec","amp;dn":"The+Ultimate+Vacation+collection.+dvd++rip.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76938db57381c8ca80d4d1fb368b1e45c9c03bec","infoHashBuffer":{"type":"Buffer","data":[118,147,141,181,115,129,200,202,128,212,209,251,54,139,30,69,201,192,59,236]},"announce":[],"urlList":[]}}