{"title":"POtHS - SIN-ister Secrets - 98 - Consuming Kids","uid":7802066,"size":4765882726,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:78c0c69371b6b7b058fd5132948d0be37a2821ea&amp;dn=POtHS+-+SIN-ister+Secrets+-+98+-+Consuming+Kids&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"POtHS11","files":-1,"time":1352306363,"description":"POtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - SIN-ister Secrets - 98 - Consuming Kids\n\n\nPOtHS Comment: Watch it and Weep\n\nDescription:\n\nConsuming Kids The Commercialization of Childhood:\n\nConsuming Kids throws desperately needed light on the practices of a relentless multi-billion dollar marketing machine that now sells kids and their parents everything from junk food and violent video games to bogus educational products and the family car. Drawing on the insights of health care professionals, children's advocates, and industry insiders, the film focuses on the explosive growth of child marketing in the wake of deregulation, showing how youth marketers have used the latest advances in psychology, anthropology, and neuroscience to transform American children into one of the most powerful and profitable consumer demographics in the world. Consuming Kids pushes back against the wholesale commercialization of childhood, raising urgent questions about the ethics of children's marketing and its impact on the health and well-being of kids.\n-----------------------------------------------------\n\n&quot;Death by Pedagogy&quot; A Teacher's Polemic Against Inst. Learning&quot; John Taylor Gatto:\n\nA recent lecture by John Taylor Gatto given at The Institute for Theological and Interdisciplinary Studies, February 4, 2011 at Macalester College, St. Paul, MN.  This is one of John's last public appearances prior to his multiple strokes in late 2011; this lecture features John presenting material from his yet-to-be-published book.\n--------------------------------------------------\n\nPowerful Pedophile Ring Linked to British Parliament:\n\nA British MP claims there is 'clear intelligence suggesting a powerful pedophile network linked to Parliament and No 10'\nThere is &quot;clear intelligence&quot; suggesting a historic pedophile ring may be linked to Downing Street and a former prime minister, MPs have been told.\n\n\n--------------------------------------------------\n\nThe Dumbing Down of Society by Scientific Design:\n\nJT Gatto is, along with Charlotte Iserbyt, one of the most prominent researchers on the subject of global education. In this interview, Mr. Gatto summarizes the origins and purposes of the modern (UNESCO-run) educational apparatus.\nThe current system is meant to create a dumbed down, apathetic, easily manageable, global population; one that will not oppose being enslaved, under a world UN-corporate system, for the benefit of the dominant global hierarchy of world bankers and 'establishment' families.\n\n\n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n","torrent":{"xt":"urn:btih:78c0c69371b6b7b058fd5132948d0be37a2821ea","amp;dn":"POtHS+-+SIN-ister+Secrets+-+98+-+Consuming+Kids","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78c0c69371b6b7b058fd5132948d0be37a2821ea","infoHashBuffer":{"type":"Buffer","data":[120,192,198,147,113,182,183,176,88,253,81,50,148,141,11,227,122,40,33,234]},"announce":[],"urlList":[]}}