{"title":"Robin and Linda Williams - Stonewall Country [V2] tpb","uid":7701270,"size":65069779,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:78d6f6d50dbe252d9eb39a3af74a549c38654284&amp;dn=Robin+and+Linda+Williams+-+Stonewall+Country+%5BV2%5D+tpb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rambam1776","files":-1,"time":1349528633,"description":" &lt;a href=&quot;http://www.robinandlinda.com/stonewall.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.robinandlinda.com/stonewall.html&lt;/a&gt;\n\nIn 1984 Robin and Linda Williams were asked to write a musical based off the life and times of General Thomas `Stonewall' Jackson. After thoroughly researching their subject the music for Stonewall Country came into fruition. The musical was intended to be a thoughtful, entertaining yet factual story about this historic Confederate general who lived and taught in Lexington, VA before the Civil War. Performed at the Lime Kiln Theater in Lexington, Stonewall Country went on a 20 year run before it was retired in 2005. In 2009 Robin and Linda revived Stonewall Country and continue to perform this popular musical. Stonewall Country the album, captures the songs from the musical that tell the life-story of one of the Confederacy's most iconic generals. Stonewall Country is about as catchy as a history lesson can get, tracing a story-arch that takes you from Jackson's pre-war life in Virginia's Shenandoah Valley (&quot;Stone Wall Country&quot;) to one of Jackon's finest moments during &quot;The Valley Campaign&quot; of 1862 (&quot;Proud Valley Boys&quot;). Beautifully capturing the courage that defined Jackson and ultimately brought him to his fate, &quot;Let Us Cross Over the River&quot; is based on Jackson's final words and is the album's stunning closer. In time for the 150th anniversary of the beginning of the Civil War, Stonewall Country offers a fresh musical take of this period while shedding light on one of the war's great figures. Folk, bluegrass and roots fans as well as history buffs will be happy to own Stonewall Country. For those unfamiliar with the musical Stonewall Country, the songs feature Robin and Linda's signature harmonies and have the makings of a classic folk album that can stand alone. However, if you have been lucky enough to see the stage performance, Stonewall Country only enhances your musical experience.\n\n1 Stonewall Country (3:30)\n2 Duty (3:38)\n3 Exile (3:22)\n4 Battling Anthems (2:09)\n5 Burying Day (3:58)\n6 Proud Valley Boys (4:01)\n7 Seven Day Freak Out (2:57)\n8 Here Comes Jeb (3:06)\n9 Somebody's Someone (3:48)\n10 Ap's Blues (3:16)\n11 Hardtack's All We Eat (3:04)\n12 The War's Gone Bad On Me (3:43)\n13 Don't Let Me Come Home a Stranger (3:53)\n14 Let Us Cross the River (3:55)","torrent":{"xt":"urn:btih:78d6f6d50dbe252d9eb39a3af74a549c38654284","amp;dn":"Robin+and+Linda+Williams+-+Stonewall+Country+%5BV2%5D+tpb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78d6f6d50dbe252d9eb39a3af74a549c38654284","infoHashBuffer":{"type":"Buffer","data":[120,214,246,213,13,190,37,45,158,179,154,58,247,74,84,156,56,101,66,132]},"announce":[],"urlList":[]}}