{"title":"Saints Row The Third XBOX360-xSwT [Region-Free/Action/2011]","uid":6808517,"size":7950095324,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:78da095dce04e7a3a904ef686f2175fa3fdc6026&amp;dn=Saints+Row+The+Third+XBOX360-xSwT+%5BRegion-Free%2FAction%2F2011%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xSwT","files":-1,"time":1320957022,"description":"Saints Row The Third XBOX360-SPARE\n\n\nGame Description:\n\nYears after taking Stilwater for their own, the Third Street Saints have\nevolved from street gang to household brand name, with Saints sneakers,\nSaints energy drinks and Johnny Gat bobblehead dolls all available at a store near you\nThe Saints are kings of Stilwater, but their celebrity status has not gone\nunnoticed. The Syndicate, a legendary criminal fraternity with pawns in\nplay all over the globe, has turned its eye on the Saints and demands tribute\n\nRefusing to kneel to the Syndicate, you take the fight to Steelport,\na once-proud metropolis reduced to a struggling city of sin under Syndicate\ncontrol. Take a tank skydiving, call in a satellite-targeted airstrike\non a Mexican wrestling gang, and defend yourself against a highly-trained\nmilitary force using only a sex toy in the most outlandish gameplay\nscenarios ever seen, igniting a city-wide war that will set Steelport on fire\n\nSaints Row: The Third gives you control of the Saints at the height of their\npower, and you live the life to show for it. Now Steelport is ripe for the\ntaking, and it\\\\\\'s up to you to make the city your own. Mold the skyline based\non your choices, outfit your crew in classy gangster gear or furry costumes,\nand make life-or-death decisions that will change Steelport, and the Saints,\nforever. This is now your city. These are now your rules. Strap it on\nOver The Top - Like a lapdance from a porn star, the action is naughty, fun,\nand better than anything you\\\\\\'re getting at home.\nCity of Sin - Disrupt and dismantle the Syndicate stranglehold on weapons,\ncybercrime, and sex trades. Discover the secrets of Steelport, where there\nis action on every street corner, for better or, more likely, worse.\nWeapons of Crass Destruction - It\\\\\\'s one thing to defeat your enemies\nIt\\\\\\'s another to humiliate them. Hover jets, human cannonball cars and\nsex-toy warfare are all part of the fun.\nCo-op Madness - Give naked skydiving a try, landing in your partner\\\\\\'s flaming\npickup as you make a suicide run toward a heavily armed Syndicate brothel\nSteelport is more fun with a friend.\nInitiation Station - Create, share, and download the most outlandish\ncharacters every seen, from washed-up celebrities to naked ninja pirates.\n\nInside every sinner, there is a Saint.\n\n\nGame Notes:\n\nSYSTEM XBOX360\nFORMAT ISO - XGD3\nREGiON/COUNTRY Region Free\nRELEASEDATE 09/11/2011\nGAMEGENRE Action\nLANGUAGE ENGLISH\nSiZE xx x 100MB\nRIPPED Nothing\nPublisher THQ\n","torrent":{"xt":"urn:btih:78da095dce04e7a3a904ef686f2175fa3fdc6026","amp;dn":"Saints+Row+The+Third+XBOX360-xSwT+%5BRegion-Free%2FAction%2F2011%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78da095dce04e7a3a904ef686f2175fa3fdc6026","infoHashBuffer":{"type":"Buffer","data":[120,218,9,93,206,4,231,163,169,4,239,104,111,33,117,250,63,220,96,38]},"announce":[],"urlList":[]}}