{"title":"Pushy v1.1.0","uid":7650886,"size":2821007,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:796bdea219bfa25f3d30d2f67d5410b8d5b806ee&amp;dn=Pushy+v1.1.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Waiting55","files":-1,"time":1348019474,"description":"The #1 TOP GAME App Store Germany now for Android!\nMeet Pushy, a small, friendly character who wants to be in his home. Before he can get there, however, there is a puzzle to solve. You move Pushy step by step and, through trial and error, determine how the different elements of the puzzle operate, and what tasks need to be done. For example, Pushy must move obstacles and dump a red ball into a red hole. After completing all relevant tasks, move Pushy to his home. If you solved everything correctly, you will advance to the next level!\nFeatures:\nâ˜‘ more than 100 built-in levels\nâ˜‘ More than 40 different game elements\nâ˜‘ Collect all coins and become Pushy Meister\nâ˜‘ Skip levels (using your coins)\nâ˜‘ Graphics optimized for phone displays\nâ˜‘ Easy two-in-one touch control\nâ˜‘ Unlimited player accounts\nâ˜‘ More features like LEVEL EDITOR and MORE LEVELS with the next update!\nThe first few levels can be solved very quickly. However, as new elements are added, you will encounter very demanding puzzles that may take many attempts to figure out. There are 99 different built-in levels, with varying degrees of difficulty. Each level must be solved in order to advance to the next one. After only a few levels you'll come to appreciate what Pushy really is: a logic game that is a lot of fun! Each level will create new challenges to your intelligence. In advanced levels, Pushy will be able to move heavy stone blocks out of the way, cleverly bypass electrical spots to get through the sliding doors and free up a path through offices littered with bullets. But, watch out for trap doors and other alarms you may trigger!\n(protected by Market Licensing)","torrent":{"xt":"urn:btih:796bdea219bfa25f3d30d2f67d5410b8d5b806ee","amp;dn":"Pushy+v1.1.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"796bdea219bfa25f3d30d2f67d5410b8d5b806ee","infoHashBuffer":{"type":"Buffer","data":[121,107,222,162,25,191,162,95,61,48,210,246,125,84,16,184,213,184,6,238]},"announce":[],"urlList":[]}}