{"title":"Wrong.Turn.1-5.PACK.720p.BRRip.XviD.AC3-MAJESTiC","uid":7762062,"size":12212119976,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:7a217d59eac2946581a20641bf000de8a9ee29a5&amp;dn=Wrong.Turn.1-5.PACK.720p.BRRip.XviD.AC3-MAJESTiC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"R0thschild","files":18,"time":1351260113,"description":"Posters :\n &lt;a href=&quot;\nhttp://imagedomino.com/?g=152095&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imagedomino.com/?g=152095&lt;/a&gt;\n\nGallery: \n &lt;a href=&quot;\nhttp://imagedomino.com/?g=320990&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imagedomino.com/?g=320990&lt;/a&gt;\n\nWrong Turn\n\nGenre: Horror, Thriller\nYear: 2003\nCountry: USA, Germany\nRuntime: 84 min\nDirector: Rob Schmidt\nCasts: Eliza Dushku, Jeremy Sisto, Emmanuelle Chriqui and etc.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0295700/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0295700/&lt;/a&gt;\n\n.: Plot :.\nChris Flynn is driving his car for a job interview in another city. However, an accident with a trunk transporting chemical products blocks the highway and Chris looks for an alternative route through the mountains of West Virginia to accomplish his schedule. Due to a lack of attention, he crashes another car parked in the middle of the road with flat tires. Chris meets a group of five friends, who intended to camp in the forest, and they decide to leave the couple Francine and Evan on the place, while Chris, Jessie, Carly and her fiance Scott tries to find some help. They find a weird cabin in the middle of nowhere, where three violent cannibalistic mountain men with the appearance of monsters live. The two couples try to escape from the mountain men while chased by them.\n\nWrong Turn 2: Dead End\n\nGenre: Action, Horror, Thriller\nYear: 2007\nCountry: USA\nRuntime: 96 min\nDirector: Joe Lynch\nCasts: Erica Leerhsen, Henry Rollins, Texas Battle and etc.\n\n.: Plot :.\nRetired military commander Colonel Dale Murphy hosts the simulated post-apocalyptic reality show where participants are challenged to survive a remote West Virginia wasteland. But the show turns into a nightmarish showdown when each realizes they are being hunted by an inbred family of cannibals determined to make them all dinner!\n\nWrong Turn 3: Left for Dead \n\nGenre: Horror, Thriller\nYear: 2009\nCountry: USA\nRuntime: 92 min\nDirector: Declan O'Brien\nCast: Tom Frederic, Janet Montgomery, Tamer Hassan, Gil Kolirin, Tom McKay, Emma Clifford, Mike Straub and etc.\n\n.: Plot :.\nA group of people find themselves trapped in the backwoods of West Virginia, fighting for their lives against a group of vicious and horribly disfigured inbred cannibals.\n\n\nWrong Turn 4: Bloody Beginnings\n\nGenre: Action, Horror, Thriller\nYear: 2011\nCountry: USA, Germany\nRuntime: 95 min\nDirector: Declan O'Brien\nCasts: Dean Armstrong, Blane Cypurda, Tenika Davis and etc.\n\n.: Plot :.\nFollows a group of friends that decide to go snowmobiling during their winter break. They make a &quot;wrong turn&quot;, getting lost in a storm, and seek shelter in an abandoned sanatorium. They are completely isolated by the storm and are thankful they can get out of the elements. But the sanatorium has a troubled past, and some of its former patients still reside there and are not happy about the intrusion. In a deadly game of cat and mouse, the college kids must fight to survive the night.\n\nWrong Turn 5\n\nGenre: Horror, Thriller\nYear: 2012\nCountry: USA\nRuntime: 90 min\nDirector: Declan O'Brien\nCasts: Camilla Arfwedson, Roxanne McKee, Doug Bradley and etc.\n\n.: Plot :.\nA small West Virginia town is hosting the legendary Mountain Man Festival on Halloween, where throngs of costumed party goers gather for a wild night of music and mischief. But an inbred family of hillbilly cannibals kill the fun when they trick and treat themselves to a group of visiting college students.","torrent":{"xt":"urn:btih:7a217d59eac2946581a20641bf000de8a9ee29a5","amp;dn":"Wrong.Turn.1-5.PACK.720p.BRRip.XviD.AC3-MAJESTiC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a217d59eac2946581a20641bf000de8a9ee29a5","infoHashBuffer":{"type":"Buffer","data":[122,33,125,89,234,194,148,101,129,162,6,65,191,0,13,232,169,238,41,165]},"announce":[],"urlList":[]}}