{"title":"Zero Day - David Baldacci,epub,mobi,KK","uid":6818537,"size":2231766,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7aed6a69b5dee0fcc69af30525f1c38c6b69145d&amp;dn=Zero+Day+-+David+Baldacci%2Cepub%2Cmobi%2CKK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"karaokeking123","files":-1,"time":1321309271,"description":"Zero Day - David Baldacci,epub,mobi\n\n'Zero Day' Description \nJohn Puller is a former war hero and now the best military investigator in the U.S. Army's Criminal Investigative Division. He is a loner with few possessions by preference, but he has an indomitable spirit and an unstoppable determination for finding the truth. His father was the most decorated U.S. Marine in history, but now resides in a nursing home far from his battlefield glory. Puller's older brother, also a military vet, is serving a life sentence in Leavenworth Penitentiary. Puller is called out to a remote, rural area far from any military outpost to investigate into the brutal murder of a family in their home. The dead husband was in the army and the wife worked for a Pentagon contractor. The local homicide detective, a woman with personal demons of her own, clashes with Puller over the investigation. What neither of them knows is what is waiting for them across the street from the murdered family's home. It is something that will turn an already complicated case on its head. As Puller digs through deception after red herring, he realizes that absolutely nothing, and nobody, he's so far seen in this small town, are what they seem. He is truly one man against an overwhelming force.\n\nEnjoy!","torrent":{"xt":"urn:btih:7aed6a69b5dee0fcc69af30525f1c38c6b69145d","amp;dn":"Zero+Day+-+David+Baldacci%2Cepub%2Cmobi%2CKK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7aed6a69b5dee0fcc69af30525f1c38c6b69145d","infoHashBuffer":{"type":"Buffer","data":[122,237,106,105,181,222,224,252,198,154,243,5,37,241,195,140,107,105,20,93]},"announce":[],"urlList":[]}}