{"title":"American Pie (All 8 Movies) 720p","uid":7771297,"size":6686595432,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:7afa18eef8a891f09996644a0ef5d96d64da0d4b&amp;dn=American+Pie+%28All+8+Movies%29+720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jak8907","files":8,"time":1351537912,"description":"American Pie (1999)\nFour teenage boys enter a pact to lose their virginity by prom night.\n\n\nAmerican Pie 2 (2001)\nThe continuing bawdy adventures of a group of friends reuniting after their first year of college.\n\n\nAmerican Wedding (2003)\nIt's the wedding of Jim and Michelle and the gathering of their families and friends, including Jim's old friends from high school and Michelle's little sister.\n\n\nAmerican Pie Presents Band Camp (2005)\nMatt Stifler wants to be just like his big bro, making porn movies and having a good time in college. After sabotaging the school band, he gets sent to band camp where he really doesn't like it at first but then learns how to deal with the bandeez.\n\n\nAmerican Pie Presents The Naked Mile (2006)\nWhen Erik Stifler gets a free pass to do whatever he wants from his girlfriend, he and his two best friends head to see his cousin Dwight for the Naked Mile and a weekend they will never forget.\n\n\nAmerican Pie Presents Beta House (2007)\nErik, and Cooze start college and pledge the Beta House fraternity, presided over by none other than legendary Dwight Stifler. But chaos ensues when a fraternity of geeks threatens to stop the debauchery and the Betas have to make a stand for their right to party.\n\n\nAmerican Pie Presents The Book Of Love (2009)\nTen years after the first American Pie movie, three new hapless virgins discover the Bible hidden in the school library at East Great Falls High. Unfortunately for them, the book is ruined, and with incomplete advice, the Bible leads them on a hilarious journey to lose their virginity.\n\n\nAmerican Reunion (2012)\nJim, Michelle, Stifler, and their friends reunite in East Great Falls, Michigan for their high school reunion.","torrent":{"xt":"urn:btih:7afa18eef8a891f09996644a0ef5d96d64da0d4b","amp;dn":"American+Pie+%28All+8+Movies%29+720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7afa18eef8a891f09996644a0ef5d96d64da0d4b","infoHashBuffer":{"type":"Buffer","data":[122,250,24,238,248,168,145,240,153,150,100,74,14,245,217,109,100,218,13,75]},"announce":[],"urlList":[]}}