{"title":"Confessions of A Porn Addict (Spencer &quot;Spenny&quot; Rice) (","uid":7707993,"size":4492197888,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:8012f4c6fc26dabb4b8f806c644d89e230842215&amp;dn=Confessions+of+A+Porn+Addict+%28Spencer+%26quot%3BSpenny%26quot%3B+Rice%29+%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"paynebrain","files":38,"time":1349735643,"description":"Plot: (which seems to have been written by the director himself on imdb)\n\nA repentant porn addict enlists the aid of his filmmaker friend and his Porn Addicts Anonymous sponsor in hopes of convincing both the judge and his ex-wife that he's given up smut once and for all in this mockumentary featuring Kenny Vs. Spenny star Spencer Rice. Once upon a time, Mark Tobias (Rice) had a loving wife and a good job - but that all went away thanks to his all-consuming addition to hardcore pornography. Abandoned by his wife Felicity (Lindsey Cornell), who eventually got fed up with the competition, Mark subsequently fell into a downward spiral that culminated with his arrest for indecent exposure at a local video store. These days Mark is a member of Porn Addicts Anonymous. With the help of his sponsor Bob (Mark Breslin) and his filmmaker friend Dunx (Duncan Christie), Mark is doing his best to convince the judge that he's finally free from the grip of addiction. In order to conquer his demons once and for all, Mark sets his sights on the San Fernando Valley - the throbbing epicenter of the entire pornography industry. Later, an unlikely porn star dispatches Mark on an undercover mission into this porn paradise, where he comes face to face with not only his personal demons, but notorious smut peddler Rob Black as well.\n\nDVD Extras:\n\nTrailer\nFeature Commentary with Spencer Rice and Director Duncan &quot;Dunx&quot; Christie\nDeleted Scenes\n&quot;Where Are They Now?&quot;: Follow-up Interviews with The Characters","torrent":{"xt":"urn:btih:8012f4c6fc26dabb4b8f806c644d89e230842215","amp;dn":"Confessions+of+A+Porn+Addict+%28Spencer+%26quot%3BSpenny%26quot%3B+Rice%29+%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8012f4c6fc26dabb4b8f806c644d89e230842215","infoHashBuffer":{"type":"Buffer","data":[128,18,244,198,252,38,218,187,75,143,128,108,100,77,137,226,48,132,34,21]},"announce":[],"urlList":[]}}