{"title":"POtHS - Super Natural Realms - UFOs Angels Spirits Witches and D","uid":7798860,"size":6015607213,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8024f707f1aa0f820a4c0a9ff515f69fd351e657&amp;dn=POtHS+-+Super+Natural+Realms+-+UFOs+Angels+Spirits+Witches+and+D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":-1,"time":1352225728,"description":"\n\nPOtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - Super Natural Realms - UFOs Angels Spirits Witches and Demons Vol 32 - The URZI UFO Case 2010 - Hidden Truth Alien Agenda\n\n\n\n\n\nPOtHS says: Yahweh the Creator needs NO SPACESHIP or Mechanical device to do what He does. There are 2 types of inter-dimensional travelers. Yahweh, Jesus, The Holy Spirit obviously and the unfallen (HEAVENLY) angels that require nothing mechanical to dimension travel, however, The Fallen Angels seem to have lost some of their power and need artificial means to manipulate the different dimensions. EVERYTHING coming in a spaceship is of Satan not The Holy Yahweh.\n\nDescription:\n\nAngels Demons Nephilim and Aliens (Parts 1-4) by Rev. Jim Wilhelmsen:\nAre angels physical beings? What are demons? How do the two relate to the Nephilim or Aliens. This video will answer these questions and more from the Bible using the Bible and not man made rhetoric.  Demons what are they and what do they have to do with the returning Nephilim from Genesis 6 Everything you need to know from the Bible.\n\n\nThe Truth About Nephilim Giants - Steve Quayle:\nAnd it came to pass, when men began to multiply on the face of the earth, and daughters were born unto them, That the sons of God saw the daughters of men that they were fair; and they took them wives of all which they chose. And the LORD said, My spirit shall not always strive with man, for that he also is flesh: yet his days shall be an hundred and twenty years. There were giants in the earth in those days; and also after that, when the sons of God came in unto the daughters of men, and they bare children to them, the same became mighty men which were of old, men of renown.\n~ Genesis 6:1-4 KJV\n\nCern, Stargates, Krakatao, Nephilim and Fallen Angels.... Steve Quayle presents archeological discoveries,\n\n\n------------------------------------------------------------\n\nGiant Skeletons:\nAs you can read in the bible there were giants on earth.  Evidence of the Nephilim, the offspring of the Giants, the Fallen Angeles, Anunnaki, Giants Skulls of Cro Magnon from Atlantis, Rhesus Negative Blood Type, Same DNA Genetics as the Pharoahs of Egypt, the God kings of Sumerian Mythology, the Maya, Inca, all civilizations that had pyramids, all go back to Atlantis. Periodic global cataclysm, climate change, pole shift, earth changes, planet X nibiru, biblical prophecy, conspiracy, nwo, cia, nsa, mk ultra, moutak, 2012, reptilian, human, homo sapian.\n\n-------------------------------------------------------------\n\nPrometheus Movie May be Real - Lost Civilisations:\nThe movie Prometheus has recently usurped the fundamental story plot from ... in ancient civilisations and duplicated its connection to human origins. This is the real story here.  it's time to learn more about this phenomena in depth.\n-------------------------------------------------------------\n\nGiants by Charles Lawson:\nCharles Lawson 07/22/12 (SS) Genesis 6:9 The Historicity and Archaeological Evidence of Giants Past, Reports of Giants Present, and a Hint at What It Portends.\n-------------------------------------------------------------\n    \n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n","torrent":{"xt":"urn:btih:8024f707f1aa0f820a4c0a9ff515f69fd351e657","amp;dn":"POtHS+-+Super+Natural+Realms+-+UFOs+Angels+Spirits+Witches+and+D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8024f707f1aa0f820a4c0a9ff515f69fd351e657","infoHashBuffer":{"type":"Buffer","data":[128,36,247,7,241,170,15,130,10,76,10,159,245,21,246,159,211,81,230,87]},"announce":[],"urlList":[]}}