{"title":"POtHS - Super Natural Realms - UFOs Angels Spirits Witches and D","uid":7689314,"size":6884567266,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:831128f55dbe846fa8cb55ef976a4e8afab010e3&amp;dn=POtHS+-+Super+Natural+Realms+-+UFOs+Angels+Spirits+Witches+and+D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":-1,"time":1349045384,"description":"\n\nPOtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - Super Natural Realms - UFOs Angels Spirits Witches and Demons Vol 24 - Transhumanism or Genetics\n\n\n\nDescription:Alternative 3 - Mars Coverup Exposed:\nWhat is &quot;ALTERNATIVE-THREE?&quot; Recent whistle-blowers have come forward and given renewed credence to the myth of &quot;ALTERNATIVE-THREE,&quot; that planet Mars is being populated by scientists and prepared as a SURVIVAL COLONY in the face of imminent catastrophic events that will decimate the population of planet Earth. Get the facts about this amazing and enduring story in this UFOTV documentary.\n\n\nUFOTV Presents: Alternative 4 - i,ROBOT - Transhuman Invasion:\nThis program examines A relentless series of programs to refashion the human species to serve the ruling elite's cunning ambitions that has been underway since the time of Charles Darwin. The science of EUGENICS seeks to deliberately control the direction of human evolution following the rule of &quot;Social Darwinism&quot; and &quot;survival of the fittest.&quot; Armed now with spectacular advancements in cybernetics, nano-technology, and robotics, this menacing science has spawned the &quot;Age of Transitions&quot;, when artificial intelligence will ultimately replace and make obsolete humans as the dominant life-form of planet Earth!\nUFOTVÂ® Cat# U1125 - For More Information Go to http://www.UFOTV.com\n\n\nMain Show Only - Transhumanism - Coast to Coast AM:\nTom Horn discussed the blistering pace of genetics and transhumanism, and how the technology could usher in a new genetic arms race. Over the last 2 years, statements by the Pentagon have described the &quot;human enhancement revolution&quot; as being right around the corner. He expressed concern over how biotech and robotics are transforming today's military, comparing the development to a new era of the Nephilim-- the beings written about in the Bible, who were involved in what he called the &quot;contamination of human genetics.&quot;\n\nHorn cited the work of the late Terence McKenna who foresaw a technological singularity in which human brains would be altered, creating a permanent pathway for contact with other-dimensional beings. A war is coming between &quot;a new species of unrecognizably superior humans&quot; and the current humans, as well as havoc created by the building of synthetic deities, known as artilects, he added.  Tranhumanism classes or coursework is now being offered at various universities to prepare students for the coming transgenetic age which some have scheduled to began by years end in 2012.  This brainwashing is effecting our children and we must prepare them and others not to be deceived and what the global govt's future agenda entails.\n\n\nMain Show Only - Genetic Manipulation &amp; Prophecy - Coast to Coast AM:\nDate: 02-20-12\nHost: George Noory\nGuests: Douglas Hamp\n\nHebrew scholar and expert in biblical prophecy, Douglas Hamp, warned that we're \n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n","torrent":{"xt":"urn:btih:831128f55dbe846fa8cb55ef976a4e8afab010e3","amp;dn":"POtHS+-+Super+Natural+Realms+-+UFOs+Angels+Spirits+Witches+and+D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"831128f55dbe846fa8cb55ef976a4e8afab010e3","infoHashBuffer":{"type":"Buffer","data":[131,17,40,245,93,190,132,111,168,203,85,239,151,106,78,138,250,176,16,227]},"announce":[],"urlList":[]}}