{"title":"Up with Chris Hayes 9-29-12.mp4","uid":7690434,"size":343721954,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:866b0e073d740877309e6b564892d8c56faf2d1c&amp;dn=Up+with+Chris+Hayes+9-29-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"liberal42","files":-1,"time":1349072129,"description":"Up with Chris Hayes; Saturday, September 29, 2012.\n\nOn Up with Chris Hayes, they discussed the Republican bubble trap, highlighted by the recent spate of GOP politicians dismissing national polls showing President Obama ahead of Mitt Romney. They also dove into what's behind those poll numbers, and look at evidence that the Obama recovery may be much stronger than the political establishment has realized. And they examined the NFL referees debacle in the larger context of the state of organized labor in America.\n\nJoining Chris were:\n\n\nSheila Bair (author of &quot;Bull by Horns: Fighting to Save Main Street from Wall Street and Wall Street from Itself,&quot; former chair of the FDIC (2006-2011), former assistant secretary for financial institutions at the Treasury Department (2001-2002), and former senior vice president for government relations of the NYSE), Joe Weisenthal (deputy business editor at BusinessInsider.com), Joy Reid (MSNBC contributor and managing editor of TheGrio.com), and Josh Barro (lead writer for Bloomberg View's &quot;The Ticker&quot;). They discussed the bubble the conservatives constructed around themselves.\n\nRo Khanna (author of &quot;Entrepreneurial Nation: Why Manufacturing is Still Key to America's Future,&quot; former deputy assistant secretary at the Department of Commerce, former member of the White House Business Council) replace Josh Barro on the panel to discuss the underrated recovery.\n\nOhio Democratic Senator Sherrod Brown, who's currently locked in a closely watched re-election battle joined via satellite to discuss\n\n\nThe new Panel: Jamilah King (news editor for colorlines.com), Joe Weisenthal stayed, Mike Pesca (sports correspondent for National Public Radio, Bill Fletcher, Jr. (co-founder of the Center for Labor Renewal and author of &quot;They're Bankrupting Us! And 20 Other Myths about Unions&quot;) joined to discuss the NFL refs lockout and unions in general.\n\nThe latest panel stayed for 'Now We Know'.","torrent":{"xt":"urn:btih:866b0e073d740877309e6b564892d8c56faf2d1c","amp;dn":"Up+with+Chris+Hayes+9-29-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"866b0e073d740877309e6b564892d8c56faf2d1c","infoHashBuffer":{"type":"Buffer","data":[134,107,14,7,61,116,8,119,48,158,107,86,72,146,216,197,111,175,45,28]},"announce":[],"urlList":[]}}