{"title":"Circus Maximus (2010) 720p BrRip x264 CLOWNSEC (PhreakyFlix)","uid":9354287,"size":2186782474,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:87972593c7a99122d45a938ace4c31bfb8290ae8&amp;dn=Circus+Maximus+%282010%29+720p+BrRip+x264+CLOWNSEC+%28PhreakyFlix%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clownsec","files":-1,"time":1387193474,"description":"Circus Maximus (2010) 720p BrRip x264 CLOWNSEC (PhreakyFlix)\n\nWith a pending deadline looming and multiple obstacles mounting, established screenwriter, Cal Neros (Julian McCullough) must complete an entire screenplay within a solitary weekend! Threatened with disastrous consequences for failure, he is instructed by an irate Producer (Mario Cantone) to write 3 twisted short stories within a feature-length film. Circus Maximus progressively unfolds as all characters within the script come to life in their respective stories. Story #1, &quot;Look Out Below,&quot; tells the tale of Steve, (Sal &quot;the stockbroker&quot; Governale) an average guy who's looking for love and is unknowingly set up on a blind date - with a dwarf (Alli Chapman). With absolutely nothing in common, besides the desire to escape each other's company, can these 2 opposites complete the date before they kill each other? Story #2, &quot;Unfortunate Son,&quot; is the ongoing saga of a local Therapist (Bianca Hunter) and a colorful patient (Joe D'onofrio) who remain deadlocked in a comedic, psychological cold war. But, will any progress be made in this exhaustive battle of the wills before somebody gets hurt? Story #3, &quot;The Misadventures of Captain Cool &amp; Sergeant Suave&quot; is the chronicle of 2 bumbling detectives (Kevin Corrigan) who are hired to recover a fetus in a formaldehyde jar. After developing an unnatural fraternal bond with the item, they hatch a plan to keep it. But, can they successfully deceive their employer before the job is over?\n\nBROUGHT TO YOU BY CLOWNSEC * HONK *","torrent":{"xt":"urn:btih:87972593c7a99122d45a938ace4c31bfb8290ae8","amp;dn":"Circus+Maximus+%282010%29+720p+BrRip+x264+CLOWNSEC+%28PhreakyFlix%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87972593c7a99122d45a938ace4c31bfb8290ae8","infoHashBuffer":{"type":"Buffer","data":[135,151,37,147,199,169,145,34,212,90,147,138,206,76,49,191,184,41,10,232]},"announce":[],"urlList":[]}}