{"title":"Tibia iBot 1.1.1 cracked by Anj0","uid":7669582,"size":5672960,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:88a44abc2abf169fe6a837a81cfac18bb0976b60&amp;dn=Tibia+iBot+1.1.1+cracked+by+Anj0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1348530771,"description":"New version of Tibia iBot, the most complete bot in this MMORPG game. 100% working.\n\niBot blocks some internet packages to prevent illegal copies, so if the program isn't working, you can ask me for another cracked version at &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;3a5c485f5e5e434957534e5249517a52554e575b53561459555714&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; If you liked my job you can colaborate in PayPal.\n\n\n\n\nFEATURES (copyied from the official page)\n\n     Simulate key presses and mouse clicks so that you are still free to use your mouse and keyboard.\n-    Built for both simplicity and flexibility in mind to let you do even the more advanced things at the press of a few buttons or writing of a few words.\n-    A basic integrated Alerts system that lets you know many things player on screen, player attacking, some creature on screen, items counts, messages, status info like capacity, stand time and disconnect.\n-    Advanced integrated healing/mana restore system that lets you heal with multiple spells, potions and runes, and can use exact values or percentages.\n-    Advanced integrated friend healer system to use spells, potions and runes in yours friends.\n-    Script system that lets you do actions at the press of a button or automatically, based on certain conditions.\n-    Displays practical information on screen for convenience and to assist you in taking choices during your gameplay.\n-    Many features in the iBot are implemented in script so you can just enabled them if you want but you may also adjust them to your liking.\n-    All the basic things such as equipping ammunition, rings, amulets, picking up loot into backpacks, moving things around inventory, using items, saying things, casting spells, buying and selling items, etc. \n-    Goes up and down ramps, ladders, stairs, rope spots, shovel spots, opens doors, uses sewer grates, etc.\n-    Deposits gold and items, refills potions, talks with NPCs and travels with just a few simple script commands.\n-    Has different ways of walking accross caves that may save time by avoiding areas with no monsters spawned.\n-    May be set up to kill different monsters with a different approach, attack, equipment, spell.\n-    Advanced looting system, you can choose which items you wanna take and where you wanna put then.\n-    Many good options for save and load scripts, like Slots and Favorites.\n-    May be customized and expanded in many ways using small scripts while also providing support for complex and powerful scripts.\n-    And more! With more to come!","torrent":{"xt":"urn:btih:88a44abc2abf169fe6a837a81cfac18bb0976b60","amp;dn":"Tibia+iBot+1.1.1+cracked+by+Anj0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88a44abc2abf169fe6a837a81cfac18bb0976b60","infoHashBuffer":{"type":"Buffer","data":[136,164,74,188,42,191,22,159,230,168,55,168,28,250,193,139,176,151,107,96]},"announce":[],"urlList":[]}}