{"title":"Joel Goldman - Jack Davis Series - epub","uid":9353529,"size":1179166,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:88c7d7e48f7b33211e4ea66f39c6c7323a9e1fba&amp;dn=Joel+Goldman+-+Jack+Davis+Series+-+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"7","files":3,"time":1387184678,"description":"Joel Goldman - Jack Davis 01 - Shakedown.epub\n\nIf you like the knockout suspense of Michael Connelly and the gritty &quot;who done its&quot; by Linda Fairstein, you'll love Joel Goldman's Shakedown!\n\n&quot;Goldman tells a story at a breakneck pace...&quot;\nKansas City Star\n\n&quot;A killer identified via a fleeting facial expression and behavioral cues turns a middle-agend FBI agent dealing with a disruptive disability into an unexpected hero in Goldman's latest terrific thriller.&quot;\nPublisher's Weekly\n\nWhen FBI Agent Jack Davis investigates a mass murder, a leak of crucial information and his imploding personal life throw him into the ultimate danger zone - where truth lies at the heart of betrayal.\n\nNeed a thrill pill? Take Shakedown and stay up all night!\n\n&quot;Shakedown is a really fine novel. Joel Goldman has got it locked and loaded and full of the blood of character and the gritty details that make up the truth. Page for page, I loved it.&quot;\nMichael Connelly, NYT Bestselling Author\n\n&quot;Shakedown is a chillingly realistic crime novel - it's fast-paced, smartly plotted, and a gripping read to the very last page. Joel Goldman explores - with an insider's eye - a dark tale of murder and betrayal.&quot;\nLinda Fairstein, NYT Bestselling Author\n\nJames Patterson fans - take off on a rocket-fueled suspense ride with Shakedown, the first book in the Jack Davis Thriller series by Joel Goldman.\n\nAfter you catch your breath, grab The Dead Man, the second book in the series. Jack Davis crosses paths with a serial killer inside one of the most advanced research facilities in the world when people start to die exactly as they dreamed they would.\n\nAnd don't miss The Lou Mason Thriller series by Joel Goldman, featuring trial lawyer, Lou Mason.\n\nWhen two of his partners are killed, corruption, sex and murder fill trial lawyer Lou Mason's docket as he tracks the killer. Will Lou be the next victim? Found out in Motion To Kill, the action-packed, can't-put-it-down first book in the Lou Mason thriller series!\n\nLou Mason is back in The Last Witness and this time it's personal when his surrogate father, Homicide Detective Harry Ryman, arrests his best friend, Wilson &quot;Blues&quot; Bluestone, Jr., for murder. Mason unearths secrets someone will do anything to keep as he closes in on a desperate killer, setting himself up as the next target.\n\nJoel Goldman - Jack Davis 02 - No Way Out.epub\n\nIf you like Lee Child's non-stop action and Harlan Coben's stomach twisting suspense, you'll love No Way Out, the third book in the Jack Davis Thriller series by Joel Goldman!\n\n&quot;Sleek and sassy, No Way Out is a page-turner that keeps going full speed until the very end.&quot;\nFaye Kellerman, New York Times Bestselling author\n\n&quot;Goldman spins his latest yarn into a clever, complex tangle of chain reactions between six families of characters whose lives are intertwined by blood, greed, lust, desperation and even love.&quot;\n435 South Magazine\n\nMeeting ex-FBI agent Jack Davis in the middle of a shootout is the best thing that could have happened to Roni Chase. As Jack follows Roni into a lethal web of deceit, years in the making, the only thing that can save them - time - is running out.\n\nThink James Patterson meets Michael Connelly and you've got Joel Goldman in No Way Out!\n\n&quot;This is the third book in the Jack Davis series. I loved it! It's fast paced and provides an edge-of-your-seat intensity that doesn't let up. It starts off with a bang and goes right to the end with hardly a break.&quot;\nDaisy's Book Journal\n\n&quot;No Way Out has a most compelling main character. He's driven by his own demons and past mistakes. He has what would seem to be an insurmountable flaw. When he develops the shakes and crashes to one knee, he pulls himself up and you, the reader, with him.&quot;\nHelen Ginger\n\nJump on Now Way Out and hang on for a rockin' ride!\n\nThen grab Shakedown, the first book in the Jack Davis Thriller series. When FBI Agent Jack Davis investigates a mass murder, a leak of crucial information and his imploding personal life throw him into the ultimate danger zone - where truth lies at the heart of betrayal.\n\nAfter you catch your breath, pick up The Dead Man, the second book in the Jack Davis Thriller series. Jack crosses paths with a serial killer inside one of the most advanced research facilities in the world when people start to die exactly as they dreamed they would.\n\nAnd don't miss the Lou Mason Thriller series by Joel Goldman featuring trial lawyer, Lou Mason!\n\nJoel Goldman - Jack Davis 03 - The Dead Man (v5.0) (epub).epub\n\n\nDeath comes for all of us. But it comes like a thief in the night. Not how we dreamt it. Right?\nThe Dead Man is the riveting second book in the bestselling Jack Davis thriller series that will grab you from the shocking first pages and won't let go until the breathtaking finale.\nFormer FBI Special Agent Jack Davis takes on a serial killer murdering participants in a pioneering dream study exactly as they dreamed they would die, raising ghosts better left dead and marking Jack as the next victim.\nIf you like Lee Child's twists and turns and James Patterson's suspense, you'll love The Dead Man.\nTake a thrill ride with The Dead Man today!\n&quot;A masterful blend of rock-solid detective work and escalating dread. The Dead Man is both a top-notch thriller and a heart-rending story of loss, courage and second chances. I loved it.&quot; Robert Crais, bestselling author.\nGet The Dead Man today and don't forget to pick up Shakedown, the explosive first book in the Jack Davis thriller series as Jack's world explodes with murder and betrayal.\nAnd grab Stone Cold, the knockout first book in Joel Goldman's Alex Stone thriller series as Public Defender Alex Stone risks her career and her life to stop a stone cold killer.\n\n","torrent":{"xt":"urn:btih:88c7d7e48f7b33211e4ea66f39c6c7323a9e1fba","amp;dn":"Joel+Goldman+-+Jack+Davis+Series+-+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88c7d7e48f7b33211e4ea66f39c6c7323a9e1fba","infoHashBuffer":{"type":"Buffer","data":[136,199,215,228,143,123,51,33,30,78,166,111,57,198,199,50,58,158,31,186]},"announce":[],"urlList":[]}}