{"title":"Crysis 2 - MaLDoHD 4.0 BETA - Graphic Mod","uid":7710608,"size":15718,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8920c0758a38f61062498687f1cda5a06063aa9f&amp;dn=Crysis+2+-+MaLDoHD+4.0+BETA+-+Graphic+Mod&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Nomad_2nd","files":1,"time":1349797992,"description":"Here we go, BETA dudes!\n\nImportant things:\n\n    IT IS A BETA.\n\n    Before use this BETA, I recommend run Crysis 2, select standard Extreme graphics settings. Select DX9 or DX11 (I recommend DX11 for this mod, all changes have been made to shine in DX11). Select your resolution, you can use downsampling for better results. Disable HiRes Textures if you want save some memory or leave them turned on if you have a good amount of memory. Exit game.\n\n    Download, unrar, and execute MaLDoHD_C2_Setup to run installer.\n\n    Select your Crysis2 game root folder if installer can't find the path.\n\n    When installer finish, run Config Tool (shortcut in your desktop).\n\n    Please, I know you maybe have a super highend computer, but take a look to Recommended Settings in Config Tool. Mod has been tweaked for use those settings. You can add Reflections, Penumbra Shadows and those candy effects over Recommended Settings using checkboxes. I recommend you do NOT check Particles Shadows. If you miss some important graphic effect using this config, ask me using this blog before try standard Ultra preset. I want you can play this mod with higher framerate possible.\n\n    Don't use ingame graphics options. Using could break mod configuration.\n\n    Use DXOverrider or twice ALT+TAB to enable Triplebuffering. DX11 have Triplebuffering disabled by default. If you use multigpu you don't need it (remember to check Multigpu option in Config Tool in your case).\n\n    When you play the mod for the first time, you must start a new campaign or restart a level. Savegames from original levels checkpoints DON'T WORK. It's because this mod uses updated versions of maps and savegames have map info inside that don't match with the updated versions. Using old checkpoints from original maps in updated maps produces invisible objects and broken gameplay, so you can't resume your old campaign checkpoint. Start new campaign to play whole game or use Mod campaign menu for map selection. If you want reset your nanopoints, create a new profile.\n\n    Known issues: Maple tree leaves texture is not done. TOD changes are not finished (config tool option is disabled and some levels have edited TOD at this time), Reduced textures option is not finished (more reduced textures in final version) but you can use it, two marble textures in Terminal level are not finished. And some brick walls textures are finished but not applied.\n\n    If you find bugs you can post here. Write a new comment like &quot;BUG: bug description&quot;. White elements, flickering, etc.\n\n    If someone reads a bug that he does not suffer, can add a reply in bug comment like &quot;NOT IN MY SYSTEM: computer description.&quot;\n\n    If you have an &quot;easy to implement&quot; idea (add ammo crate in a place, remove ammo crate, add weapon, add a barrier for cover somewhere, etc) you can write a comment such as &quot;SUGGESTION: idea description&quot;. If this petition gets some +1 replies I can include it in the final version.\n\n    I hope you enjoy this BETA.\n","torrent":{"xt":"urn:btih:8920c0758a38f61062498687f1cda5a06063aa9f","amp;dn":"Crysis+2+-+MaLDoHD+4.0+BETA+-+Graphic+Mod","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8920c0758a38f61062498687f1cda5a06063aa9f","infoHashBuffer":{"type":"Buffer","data":[137,32,192,117,138,56,246,16,98,73,134,135,241,205,165,160,96,99,170,159]},"announce":[],"urlList":[]}}