{"title":"Bashar - The Span 2010-2015 Part1","uid":7686734,"size":1871253330,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:896f2f6327d9fab4fbcff4db44a4bb90b304a9d8&amp;dn=Bashar+-+The+Span+2010-2015+Part1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"awakeperson","files":2,"time":1348969516,"description":"Part 1:\n\n&quot;BEING A WHOLE PERSON&quot;\nStrengthening the Link between Physical Mind and Higher Mind\n\nPart 2:\n&quot;THE SPAN: 2010-2015&quot;\nThe Next Phase of the Agenda\nLos Angeles, CA 6-21-09\n\nPart 1:Being a Whole Person: Bashar explains the importance of recognizing and strengthening the connections with your Higher Mind in order to function in the world as a complete person. Part 2: &quot;The Span: 2010-2015. In the afternoon, Bashar shares with us the next phase of the agenda for ET contact to occur and forcasts the expansion and acceleration of consciousness to come to the planet during this time.\n\nQ&amp;A: How is the ego helpful or obstructive in allowing you to follow your excitement. How does one balance the energy between physical mind and higher mind? Will the ego try to sabotage the person? Discussion of certain permission slips that help a person be more of their True Self. Negotiating with your ego in order to have balance between spirituality and earthly pursuits. How can we be sure our inner dialogs with ourself are not just made up? Using careful observation of rality and nature around us to gain understanding. What is meant by the term 'Old Soul&quot; when all realities are simultaneous? Clarifying the distinction between what is the physical mind and what is the higher mind. Do members of Bashar's civilization often interact with beings much more evolved than they are and if so, what are they like? What has Bashar learned from them? Is our society moving toward an economic sysem without currency? How do extraterrestrial beings observe us? How can one use feedback from others to enhance life? Is the ego a being with a consciousness? Wha part of me decides to put me in distress? When referring to &quot;frequency&quot;, what is te medium that is vibrating?How does Bashar make use of harmonics in vibrations? A Father's Day tribute to Bashar including music by Kim Ricelli on the hang and LeAnn and Carlos with the crystal bowls and flute. A discussion of the Shalinaya, the first ET civilization to have open contact with earth. Does living in nature elevate your frequency? Should sex only be used for purposes of procreation? How does orgasm relate to high frequency energy? A discussion of money problems. How many human/extraterrestrial hybrid races exist? What civilization created the &quot;Phoenix Lights&quot; event that happened in Arizona in 1996? Extraterrestrial contact with our government. Do Greys who abduct people have &quot;control issues&quot;? The inability of the Grey's to express emotion. The acclimatization of extraterrestrials to Earth. How many generations of hybrids have been created?\n\n_________________________________________________________________________________\n\nKnowledge is free!\nShare it, seed it, grow it!\n\nMake earth a better place! :)\n","torrent":{"xt":"urn:btih:896f2f6327d9fab4fbcff4db44a4bb90b304a9d8","amp;dn":"Bashar+-+The+Span+2010-2015+Part1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"896f2f6327d9fab4fbcff4db44a4bb90b304a9d8","infoHashBuffer":{"type":"Buffer","data":[137,111,47,99,39,217,250,180,251,207,244,219,68,164,187,144,179,4,169,216]},"announce":[],"urlList":[]}}