{"title":"POtHS - Super Natural Realms - UFOs Angels Spirits Witches and D","uid":7745571,"size":8103645613,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:898a434491fe39c5cd713ed5cfe442c2c10ef9e2&amp;dn=POtHS+-+Super+Natural+Realms+-+UFOs+Angels+Spirits+Witches+and+D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":-1,"time":1350756146,"description":"POtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - Super Natural Realms - UFOs Angels Spirits Witches and Demons Vol 29 - Dulce Alien Confrontation\n \n\nPOtHS says: Yahweh the Creator needs NO SPACESHIP or Mechanical device to do what He does. There are 2 types of inter-dimensional travelers. Yahweh, Jesus, The Holy Spirit obviously and the unfallen (HEAVENLY) angels that require nothing mechanical to dimension travel, however, The Fallen Angels seem to have lost some of their power and need artificial means to manipulate the different dimensions. EVERYTHING coming in a spaceship is of Satan not The Holy Yahweh. I am told that there are 11 different dimensions needed for The Creator to do his thing. Passing from one Dimension to the other is a mere thought for the Holy Ones. What that means is, they can move around the Universe as fast as they can think about it. This is what Faith is about. Believing something with all your Heart and Soul without having a shred of Four Dimensional evidence. (Evidence as we know of within this reality) There is another form of Evidence out there that secular man cannot understand or measure. It comes from outside this cursed dimension that us Pilgrims are stranded on or in. The real world, the eternal HOLY Spirit World, the world along side the Father, Son and Holy Spirit is The Real Reality that I seek. \n\nDescription:\nDulce Alien Confrontation - Phil Schneider:\nPhil Schneider, one of three people to survive the 1979 fire fight between the large Greys , US intelligence and military at the Dulce underground base.was found dead January 1996, due to what appears to be an execution style murder. He was found dead in his apartment , a rubber catheter hose wrapped three times around his neck and half-knotted in front. According to sources, it appeared that he repeatedly suffered torture before he was finally killed. Seven months prior to his death , Schneider did a lecture on the forces he had discovered at Dulce.\n\n \nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n\n                                           \n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n","torrent":{"xt":"urn:btih:898a434491fe39c5cd713ed5cfe442c2c10ef9e2","amp;dn":"POtHS+-+Super+Natural+Realms+-+UFOs+Angels+Spirits+Witches+and+D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"898a434491fe39c5cd713ed5cfe442c2c10ef9e2","infoHashBuffer":{"type":"Buffer","data":[137,138,67,68,145,254,57,197,205,113,62,213,207,228,66,194,193,14,249,226]},"announce":[],"urlList":[]}}