{"title":"Up with Chris Hayes 10-06-12.mp4","uid":7704981,"size":347506216,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8c26ab483a91857e269b6037212f3fb688b30758&amp;dn=Up+with+Chris+Hayes+10-06-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"liberal42","files":1,"time":1349661920,"description":"Up with Chris Hayes; Saturday, October 6, 2012.\n\nJoining Chris MSNBC were:\n\nJoseph Stiglitz (Nobel Prize winning economist, a professor at Columbia University, and author of the book &quot;The Price of Inequality: How Today's Divided Society Endangers Our Future&quot;), Joy Reid (MSNBC contributor and managing editor of TheGrio.com, a division of NBC News), Dedrick Muhammad (Senior Economic Director at the NAACP), Karen Hunter (MSNBC Contributor, distinguished Lecturer at the Film and Media department at Hunter college, formerly of the Pulitzer Prize-winning New York Daily News editorial board) they discussed the debate and then the 7.8% unemployment rate.\n\nJoseph Stiglitz and Avik Roy (a member of Mitt Romney's Health Care Policy Advisory Group, Senior Fellow at The Manhattan Institute and author of &quot;The Apothecary&quot;, the Forbes blog on health care and social insurance reform) were the panel to discuss taxes and other policy.\n\nAlexis Goldstein, (a former vice president at Merill Lynch and now an Occupy Wall Street activist) and Dedrick Muhammad joined and rejoined respectively, they talked about Wall Street.\n\nRep. Maxine Waters (D-CA), (currently serving her 11th term in Congress, senior member of the House Committee on Financial Services, ranking member of the Subcommittee on Capital Markets &amp; Government Sponsored Enterprises, chief deputy whip) joined via satellite to discuss regulations of Wall Street.","torrent":{"xt":"urn:btih:8c26ab483a91857e269b6037212f3fb688b30758","amp;dn":"Up+with+Chris+Hayes+10-06-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c26ab483a91857e269b6037212f3fb688b30758","infoHashBuffer":{"type":"Buffer","data":[140,38,171,72,58,145,133,126,38,155,96,55,33,47,63,182,136,179,7,88]},"announce":[],"urlList":[]}}