{"title":"Infernal Restraints----No Dignity  Alicia Adams","uid":7660021,"size":1471440456,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:8d8925fcf96d7335a1f6c96dad93997e414bd399&amp;dn=Infernal+Restraints----No+Dignity++Alicia+Adams&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1348276039,"description":"\nNo Dignity | Alicia Adams\n\nSeptember 21, 2012\n\n\nMP4 and WMV + Pics.\n\n\nIt is almost comical how much these models think alike sometimes. They come in expecting some kind of glamorous shoot and invariably don't see that something is wrong the second PD decides to put them into bondage. \n\nSome of them take it better than Alisha Adams, though. She starts complaining the second she sets eyes on PD. It's almost like she doesn't recognize that she has no power in this situation. The cold iron locked around her neck and wrists should have given her a clue. It looks like he'll just have to be less subtle. \n\nHe strips her down and locks her back up, not just to expose her but also to show her exactly how much control he has over her life right now. Whether she feels pain or pleasure is a matter of how she feels at the moment. One second he's whipping her to tears and the next she is cumming at his command. She has no modesty or dignity left, so she may as well learn to love it. \n\nShe is going to have a long time to think about that. The chair that PD straps her into she thinks is a temporary arrangement. Between the uncomfortable arm and leg bondage, the constricting posture collar and the vicious medical gag in her mouth, Alisha believes that he will set her free at any moment. He couldn't possibly expect her to endure this for long. When he sets up the fucking machine for her cunt she is sure he will be done with her soon. It isn't until he turns out the lights and closes the door that the truth finally dawns on her. \n\nScreens &lt;a href=&quot;\nhttp://www.infernalrestraints.com/device/bondage/2012/09_21aadams/InfernalRestraints-Alicia-Adams-PD-No-Dignity.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.infernalrestraints.com/device/bondage/2012/09_21aadams/InfernalRestraints-Alicia-Adams-PD-No-Dignity.php&lt;/a&gt;\n\n8000 uploads and counting, if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)   \n \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:8d8925fcf96d7335a1f6c96dad93997e414bd399","amp;dn":"Infernal+Restraints----No+Dignity++Alicia+Adams","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d8925fcf96d7335a1f6c96dad93997e414bd399","infoHashBuffer":{"type":"Buffer","data":[141,137,37,252,249,109,115,53,161,246,201,109,173,147,153,126,65,75,211,153]},"announce":[],"urlList":[]}}