{"title":"The Ed Show 10-1-12.mp4","uid":7694255,"size":202528112,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9090a0a9460e6b70716a082271ee27a77d269e8e&amp;dn=The+Ed+Show+10-1-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1349309703,"description":"The Ed Show; October 1, 2012.\n\nRepublicans are hoping for a game changer with Wednesday's debate in Denver, but The Republican ticket can't even get Fox News on board with their vision for America.\n\n Ed (who is live from Denver Monday and Tuesday!) welcomed Howard Fineman (NBC News Political Analyst and Editorial Director of the Huffington Post Media Group), for the latest from the Republican &quot;rolling calamity.&quot;\n\nThen, New Jersey Gov. Chris Christie predicted Mitt Romney will turn the presidential race &quot;upside down&quot; with his debate performance.  Susan Del Percio (Republican Strategist and MSNBC Contributor), and Chris Kofinis (Former Edwards Campaign Comm Director), joined Ed for a preview.\n\nIt was debate night in Massachusetts and Virginia, Democrats have Scott Brown and  Eric Cantor on the ropes.  \n\nFelix Arroyo (Boston City Councilor At-Large) offered reaction and analysis on the Elizabeth Warren-Scott Brown debate and Wayne Powell commented on his debate with House Majority Cantor.\n\nAnd on the eve of early-voting in Ohio activists were sleeping overnight at the polling places. They went live to Cleveland where state Sen. Nina Turner (D-OH) was camping out.","torrent":{"xt":"urn:btih:9090a0a9460e6b70716a082271ee27a77d269e8e","amp;dn":"The+Ed+Show+10-1-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9090a0a9460e6b70716a082271ee27a77d269e8e","infoHashBuffer":{"type":"Buffer","data":[144,144,160,169,70,14,107,112,113,106,8,34,113,238,39,167,125,38,158,142]},"announce":[],"urlList":[]}}