{"title":"Joboshare Video Converter 3.3.2.1012","uid":7721528,"size":6499626,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:90c7b57eb5b771eef8b4a832c59a4514d400b1ec&amp;dn=Joboshare+Video+Converter+3.3.2.1012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"wallpwallpapers","files":-1,"time":1350081408,"description":"Joboshare Video Converter is easy-to-use, fast and stable total video converter software especially designed to meet all your needs of converting between various video and audio file formats such as converting AVI to MPEG, WMV to AVI, WMV to MPEG or H.264/MPEG-4 AVC video, converting AVI files to iPod formats, etc.\n\nJoboshare Video Converter can convert almost all popular video formats, such as AVI, MPEG, WMV, DivX, MP4, H.264/MPEG-4 AVC, RM, MOV, XviD, 3GP, FLV, VOB (the video format used in DVD), DAT (the video format used in VCD, SVCD), and so on. The Total Video Converter can also convert audio formats including MP2, MP3, WMA, WAV, RA, M4A, AAC, AC3, OGG, etc.\n\nJoboshare Video Converter can convert videos and audios for playback on most popular multimedia players including iPod, iPhone, Apple TV, Zune, PSP, Pocket PC, Creative Zen, and Archos and so on. Enjoy your favorite video clips on any devices!\n\nConvert between AVI, MPEG, WMV, DivX, MP4, MPEG-4 AVC, RM, MOV, XviD, 3GP, FLV, etc.\nConvert between audio formats, such as MP3, WMA, WAV, AAC, etc.\nConvert videos and audios for iPod, iPhone, Apple TV, PSP, PS3, NDS, Wii, BlackBerry, iRiver, Creative Zen, etc.\n\nJoboshare Video Converter is an ideal choice as a video converter and a audio converter.\n\nKey Functions\nTotal Video Converter\nConvert almost all popular video formats, such as AVI, MPEG, WMV, DivX, MP4, H.264/MPEG-4 AVC, RM, MOV, XviD, 3GP, FLV, VOB, DAT, etc.\nConvert audio formats\nThe Total Video Converter can convert audio formats including MP2, MP3, WMA, WAV, RA, M4A, AAC, AC3, OGG, etc.\nHigh speed video conversion\nMultithreading and batch conversion provide super fast video conversion speed due to multi-core CPU support. Faster than any other video conversion software.","torrent":{"xt":"urn:btih:90c7b57eb5b771eef8b4a832c59a4514d400b1ec","amp;dn":"Joboshare+Video+Converter+3.3.2.1012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90c7b57eb5b771eef8b4a832c59a4514d400b1ec","infoHashBuffer":{"type":"Buffer","data":[144,199,181,126,181,183,113,238,248,180,168,50,197,154,69,20,212,0,177,236]},"announce":[],"urlList":[]}}