{"title":"SmartDiarySuite v4.7.3.0 with Key [iahq76]","uid":7802910,"size":14057074,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:92e60860a70ac422f4017df998ca301abf311012&amp;dn=SmartDiarySuite+v4.7.3.0+with+Key+%5Biahq76%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TorDigger","files":3,"time":1352326360,"description":"Smart Diary Suite\n\nlets you quickly &amp; easily see what's happening in your life. \n\nSee upcoming Schedule appointments and Tasks, as well as most recent Diary and Notes entries. Never miss anything important coming up again!\n\nSmart Diary Suite Features\n\nThe Right Choice for Taking Control of Your Life\nSmart DiaryÂ® Suite delivers everything you'd expect to find in a professional personal information manager (PIM) and so much more. Our Life Factors, graphs, medical tracking and the way they're integrated seamlessly together makes Smart Diary Suite the right choice for taking control of your life.\n\nSmart Diary Suite's components work together to help you keep track of your life (select a specific feature below to learn more about it or click on an image to zoom in):\n\nQuickly see what's coming up.\nSee Diary, Schedule, Tasks and Notes entries at a glance using the Overview feature. Quickly know about upcoming events and things you have to do.\n\nKeep everyday records and see your life.\nWant to keep an everyday journal and describe memorable events of your life in your own words? Save and browse your personal records in the Diary protected by a password and encryption. Are you curious how your diet, sleep or life style influence your performance or relationship? Keep a regular record with the help of our life factors and see the results on a color Graph.\n\nBe organized and ready.\nWould you like to be reminded of your important appointment or your kid's baseball on Thursday? Schedule puts a fully featured calendar at your fingertips to make sure you never miss anything important in your life!\n\nStay focused and determined.\nWant to set short and long-term goals, like a New Year's resolution? Use Tasks to set items you want to accomplish and monitor their progress.\n\nNever lose anything and find information quickly.\nSaw something interesting, but now cannot remember where to find it? Notes will take care of that by providing a powerful way to organize any bits of information.\n\nEat healthy and tasty.\nDo you want to eat healthy and tasty food? Nutrition will let you create and share recipes, at the same time helping you to understand and plan your dietary needs.\n\nStay healthy and relaxed.\nNeed to remember what medication to take and when? Medication will remind you - it can even send you an e-mail, if you are away from your computer.\n\nBe in touch with others.\nDid you forget that anniversary your friend had? Just enter the date once in the Contacts and you will be reminded of it when due.\n\nTalk to us and others.\nJoin our online community to interact with other people, share life factors and ingredients, suggest features, provide feedback and help grow SDS further!\n\nSmartest Diary Suite Offers So Much More...\n\nTry Smart Diary Suite today and see how it will help you organize and stay on top of your life! Some of the additional benefits of using Smart Diary Suite include:\n\nEncryption of your data using industry-standard methods for your privacy and all your entries are protected by an optional password.\nRun it directly off a USB or flash drive without installing on any machine.\nOptional password and auto-lock on inactivity settings.\nMultiple skins (visual styles) included.\nFully resizable and customizable interface.\nFast and reliable.\nFree support.\n\nSystem Requirements\n\nSmart Diary Suite 4 runs on:\n\nMicrosoft Windows 2000/XP/Vista/7\n\nHomepage: http://www.sdiary.com/\n\nInstallation Instructions:\n\n1. Install Program.\n2. Use given key to register application.\n3. Done, Enjoy.","torrent":{"xt":"urn:btih:92e60860a70ac422f4017df998ca301abf311012","amp;dn":"SmartDiarySuite+v4.7.3.0+with+Key+%5Biahq76%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92e60860a70ac422f4017df998ca301abf311012","infoHashBuffer":{"type":"Buffer","data":[146,230,8,96,167,10,196,34,244,1,125,249,152,202,48,26,191,49,16,18]},"announce":[],"urlList":[]}}