{"title":"PS3 3.55 CEX to DEX Conversion Guide and Links","uid":7635836,"size":289,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:92f156c1de7ba5630c7f211cffc083c9a277c600&amp;dn=PS3+3.55+CEX+to+DEX+Conversion+Guide+and+Links&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"fauzan18","files":1,"time":1347641379,"description":"ALL FILES LINKED IN TORRENT! UPDATED, PLEASE USE THIS GUIDE NOT THE EARLIER ONE!\n\n\n1.Download the three files below\n. Memdump v 1.01\n. eid_root_key\n.Multiman or MMOS anything above 4.0.3 will work (Link Updated - with mode to allow flashing)\n\n\n\n\n1.Extract the 3 pkgs and place them in the root of your usb, remove the usb from your computer and install the .pkg files\n\n2.Run Memdump v 1.01 use the option to &quot;Dump Flash Storage&quot;-Usb on side closer to blu ray player (last usb port)\n3.Remove all Usb devices from the ps3\n\n4. Run eEID_RKDumper next should give a black screen and 5-10 seconds later beep and shut down by it self.\n5. Now reboot the ps3 and open multiman file manager and put your usb back in the ps3 and navigate to /dev_hdd0/tmp/eid_root_key and copy this file to the root of your usb.\n5. Now you have all files from your ps3, i suggest you backup the files at least in two different places\n6.your usb should have two files eid_root_key and flash_stor_35500.bin. Copy both to your desktop.\n\n7. download Cex2Dex.exe and place it on your desktop load the flash_stor_35500.bin for the top and rename eid_root_key to dump and load that for the bottom, next click on cex to dex.\n\n8. If all went to plan then it will ask you to save your converted flash as my-DEX-flash.EID0.NORBIN\n9. place that file on your usb (I suggest removing other files to avoid accidental flash) so you have my-DEX-flash.EID0.NORBIN on the usb.\n10.Open multiman file manager and locate the my-DEX-flash.EID0.NORBIN on your usb and click it it will go through 3 pages of verification just press x on each page\n11. Reboot ps3, and you will be able to install any Dex Firmware\nCredit to all the Devs that have worked hard coding these applications all I did was put them together in a easy guide \t\t","torrent":{"xt":"urn:btih:92f156c1de7ba5630c7f211cffc083c9a277c600","amp;dn":"PS3+3.55+CEX+to+DEX+Conversion+Guide+and+Links","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92f156c1de7ba5630c7f211cffc083c9a277c600","infoHashBuffer":{"type":"Buffer","data":[146,241,86,193,222,123,165,99,12,127,33,28,255,192,131,201,162,119,198,0]},"announce":[],"urlList":[]}}