{"title":"Mirillis Action! 1.12.0.0","uid":7788617,"size":34908164,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:93f70b4831544b8021cd2b8ea4421cf4389ede08&amp;dn=Mirillis+Action%21+1.12.0.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"arman258","files":3,"time":1351962954,"description":"Action! allows real-time recording / capture of Windows Aero desktop in a superb HD video quality. With Action! you can benchmark and display game framerates, record your gameplay, add live audio commentary to create high quality tutorials.\nimage\nAction! is compact, stylish and user friendly. With outstanding performance and sleek design Action! defines a new standard of user experience for real-time gameplay and desktop recording software.\n\nYou can use Action! to capture your gameplay, your desktop activity or a selected desktop area, but also screenshots.\n\nHere are some key features of &quot;Action!&quot;:\n\nRecord your gameplay in HD - benchmark games performance:\nÂ· Action! outstanding performance and GPU utilization allows the smoothest real-time HD gameplay video recording ever!Display current and average game framerate (FPS) during gameplay and save your benchmark results.\n\nSmooth Windows Aero HD desktop recording, easy tutorial creation:\nÂ· Action! defines a new standard of performance and user experience for real-time desktop recording software. Record smooth high framerate HD videos of your dekstop and applications activity, add microphone audio commentary and create great tutorials with ease!\n\nReal-time web videos recording - record what you see:\nÂ· Record videos from websites and other applications in real-time. Action! allows to record videos from defined display region, selected application window or in fullscreen mode. With Action! you can record videos from ANY web player, no matter which video service you are using!\n\nExport your recordings to popular formats and devices:\nÂ· Select one of many predefined profiles and push\nÂ· a button to export your recordings to popular formats, favorite multimedia devices, Facebook or YouTubeâ„¢. Save energy and time using optimized and hardware accelerated video exporting with NVIDIA CUDA or Intel Quick Sync Video technologies.\n\nUpload to YouTube or Facebook:\nÂ· Export and upload your recordings to popular services and social networks like YouTube and Facebook. Action! provides predefined exporting profiles for YouTube and Facebook, just push a button to export and automatically upload your recordings to your favorite service fast and easy.\n\nCapture screenshots:\nÂ· With Action! you can capture multiple screenshots of your games or desktop. Just press a hotkey and screenshot will be saved directly to a file on your hard disk without interrupting your work or gameplay.\n\nRecord live audio commentary:\nÂ· Action! allows to record additional live audio commentary during gameplay or dekstop recording making easy creation of tutorials and game walk-through videos. Microphone settings provide full control of microphone input volume and mixing level with system sounds.\n\nUser friendly and stylish interface:\nÂ· Action! is compact, stylish and user friendly.\nÂ· Built-in managers for recordings, benchmarks and screenshots allow to browse, delete selected items and export recordings to popular formats and devices. With outstanding performance and sleek design Action! defines new standard of user experience for games benchmarking, gameplay and desktop real-time recording software.\n\nRecord what you hear:\nÂ· Action! can record everything you hear on your PC. Audio recording function allows to record all sounds, music and game audio. Using microphone you can easily create podcasts. Additionaly Action! can encode in real-time the recorded audio in M4A format, making the recorded audio files small and compact.\n\nPlay in HD - record in SD:\nÂ· Ultra-efficient video recording!\nÂ· With Action! ultra-efficient 480p video recording you can record your HD gameplay or HD desktop for a very long time, saving disk space. Optimized 480p video recording mode offloads your computers CPU and hard disk allowing smooth and comfortbale gaming and working.\n\nEasy video recordings playback:\nÂ· Action! includes an internal ultra responsive player optimized for raw high-bitrate video recordings playback. Double click video recording thumbnail on the Action! list to start playback!\n\nThe outstanding performance:\nÂ· Action! defines a new standard of performance for gameplay and desktop recording software. It uses Mirillis ultra-fast, multicore optimized, proprietary video codec (FIC - Fast Intra Compression standard) which together with highly optimized application engine provides the ultimate performance of real-time HD video recording.\n\nRequirements:\n\nÂ· DirectX\nÂ· Intel Celeron 1.4GHz or equivalent processor (SSE2 required)\nÂ· 512MB RAM\nÂ· Graphics Card: Direct3D 9.0 compatible with Pixel Shader 2.0 support\nÂ· DirectX compatible sound card\nÂ· Latest graphics card drivers\nÂ· Administrator rights\n\nWhat's New in This Release:\nÂ· NEW FEATURE: Desktop region presets added\nÂ· Important improvements for direct video recording to MP4 format with Intel Quick Sync Video acceleration technology\nÂ· Fixed M4A audio recordings playback on some mobile devices\nÂ· Added '0' (zero) key to reset Action! window position to default setting\nÂ· Fixed minimum disk space requirement for MP4 export\nÂ· Added support for PrintScreen hotkey\nÂ· Stability improvements ","torrent":{"xt":"urn:btih:93f70b4831544b8021cd2b8ea4421cf4389ede08","amp;dn":"Mirillis+Action%21+1.12.0.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93f70b4831544b8021cd2b8ea4421cf4389ede08","infoHashBuffer":{"type":"Buffer","data":[147,247,11,72,49,84,75,128,33,205,43,142,164,66,28,244,56,158,222,8]},"announce":[],"urlList":[]}}