{"title":"Dan Koontz - The I.P.O. (epub)","uid":9353748,"size":247685,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:947182d587f9b82944595654921a40f5574a28d8&amp;dn=Dan+Koontz+-+The+I.P.O.+%28epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"7","files":1,"time":1387186811,"description":"Product Description\nA tragic accident. An opportunistic CEO. A shocking announcement at the opening of a bizarre new stock market.\n\nSeven year-old Ryan Tyler, Jr. has just been adopted. By a corporation.\n\nTicker symbol RTJ is the initial public offering on James Prescott?s Avillage Exchange, a market that trades in the financial futures of exceptionally gifted orphans.\n\nBefore the brilliant first-grader has even had a chance to catch his breath, he is whisked off to live with seemingly perfect new parents he?s not sure he can trust. And he?s got a sinking feeling that the only ally he has from his previous life is somehow conspiring with the corporation.\n\nWith Prescott and a board of directors pulling strings behind the scenes, Ryan?s only chance at freeing himself from his shareholders may be to team up with his fellow Avillage orphans: an embittered computer-programming savant, a once-in-a-generation NBA prospect, and a show-stopping Latin American model.\n\nKoontz?s fast-paced yet introspective writing style is sure to keep your mind whirring and the pages turning, right to the explosive final page.\nAbout the Author\nThe I.P.O. is Dan Koontz?s debut novel. Dan is a board-certified neurologist, practicing on the east side of Cleveland, where he lives with his wife, three daughters and a ten year-old Bernese Mountain Dog. Before attending medical school, he held jobs as a technology consultant at Andersen Consulting (now Accenture), a bagboy at a local grocery store, a warehouse worker, and, briefly, a bus-loader captain at the 1996 Atlanta Olympics. The youngest of three children, Dan grew up in Marietta, Georgia, a suburb of Atlanta. He is a proud graduate of Wheeler High School, University of Pennsylvania, and The Medical College of Georgia. Aside from writing, Dan enjoys spending time with his family, cooking, futilely rooting for Cleveland?s sports teams, fishing and traveling.\n","torrent":{"xt":"urn:btih:947182d587f9b82944595654921a40f5574a28d8","amp;dn":"Dan+Koontz+-+The+I.P.O.+%28epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"947182d587f9b82944595654921a40f5574a28d8","infoHashBuffer":{"type":"Buffer","data":[148,113,130,213,135,249,184,41,68,89,86,84,146,26,64,245,87,74,40,216]},"announce":[],"urlList":[]}}