{"title":"Kingsoft Office Suite Free 2012 8.1.0.3375","uid":7696464,"size":40955560,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:953e2666f7570834578b5385e912368655708478&amp;dn=Kingsoft+Office+Suite+Free+2012+8.1.0.3375&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"wallpwallpapers","files":-1,"time":1349376699,"description":"Kingsoft Office Suite Free 2012 - a free version of the office suite, created by Chinese software developers Kingsoft Software, as an alternative to Microsoft Office. The product has a long history of development in China, where it is still sold as WPS Office. &quot;Kingsoft Office&quot; is a company that tries to get in the first place, to the west, and the Japanese market.\n\nKingsoft Office (KSOffice) Writer 2012\nKingsoft Writer 2012, a tool for creating professional-looking documents. It can open Microsoft Word files or save your documents as Word files. It allows you to open, view and edit documents in different file formats, as well as recent files Word (. DOCX).\nFamiliar style, layout, and functionality such as those in Microsoft Office, which means that you can easily transfer Office environment between Microsoft Writer and Kingsoft Writer. Moreover, Kingsoft Office 2012 provides powerful functions such as built-in PDF conversion, switching instruments Tab, selection of different print, cross-references and an integrated toolbar Google Search, which are not available with Microsoft Office.\n\nKingsoft Office (KSOffice) Presentation 2012\nKingsoft Presentation 2012 helps you create multimedia presentations, creative ways to meet customer needs. It can open, edit and save as *. PPT, PPS *, * files (Template) and support *. PPTX file (Microsoft Office 2007). It is fully interoperable, allowing you to save your presentation saved as Power Point, and PDF-format effortlessly. Kingsoft Presentation offers a unique function in Double-screen TVs.\n\nKingsoft Office (KSOffice) Spreadsheet 2012\nKingsoft Spreadsheet 2012 can open edit and save *. XLS, *. chi (templates), *. DBF, *. txt, *. CSV, and compatible with *. XLSX file (Microsoft Office 2007). This gives you more efficiency and flexibility to achieve your target. It contains a lot of functions and array formulas which helps you manage, analyze and calculate data easier and faster. It provides eight types of encryption RC4, which are very difficult to decipher. Thus, you can protect your document from copying, modifying.\n\nKey Features\nSupport *. Docx, *. Xlsx;\nExport to PDF-file;\nCoding before saving;\nPrepare to print several new instruments;\nSupport for OLE Automation\n\nProgram Kingsoft Office Suite Free 2012 has English interface, and is completely transparent to the user Microsoft Office.","torrent":{"xt":"urn:btih:953e2666f7570834578b5385e912368655708478","amp;dn":"Kingsoft+Office+Suite+Free+2012+8.1.0.3375","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"953e2666f7570834578b5385e912368655708478","infoHashBuffer":{"type":"Buffer","data":[149,62,38,102,247,87,8,52,87,139,83,133,233,18,54,134,85,112,132,120]},"announce":[],"urlList":[]}}