{"title":"Stealing Faces by Michael Prescott","uid":7718629,"size":570228,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9600a4acf84217adaa3a957853d0373eae58438e&amp;dn=Stealing+Faces+by+Michael+Prescott&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"CMass1000","files":3,"time":1350005786,"description":"Book Description\nPublication Date: June 2, 2011\nJohn Cray has a secret. For twelve years he has stalked and kidnapped women, setting them loose in the mountains of eastern Arizona, hunting them like animals, and taking their lives. He has left no clues. He is suspected by no one. Or so he thinks. \n\nBut now he has a problem. Somebody -- a woman whose name he doesn't know -- is stalking him. \n\nShe follows him when he makes his nightly rounds in Tucson. She watches him on busy streetcorners and in shadowy restaurants. She seems to know his secret. But if so, why hasn't she gone to the police? \n\nCray plans to turn the tables on his mysterious pursuer. He will become the predator, and she -- the prey. Once she's in his power, she will tell him who she is and what she's after. And then she will die.\n\nBut even Cray isn't prepared to confront the truth when he discovers it -- or to deal with the shattering implications of a past he had thought long buried and an obsessive madness he cannot control ... \n\n&quot;Stealing Faces is truly thrilling as well as chilling: I could not put this book down. Reading the first few chapters of this tale is like reading the climax for most thrillers and the excitement just keeps building. Michael Prescott knows how to keep readers' eyes glued to his pages.... I was completely hooked. Actually, more than completely hooked, I thought the lightning-paced thrills were going to give me a heart attack!&quot; - Judith Flavell, The Mystery Reader","torrent":{"xt":"urn:btih:9600a4acf84217adaa3a957853d0373eae58438e","amp;dn":"Stealing+Faces+by+Michael+Prescott","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9600a4acf84217adaa3a957853d0373eae58438e","infoHashBuffer":{"type":"Buffer","data":[150,0,164,172,248,66,23,173,170,58,149,120,83,208,55,62,174,88,67,142]},"announce":[],"urlList":[]}}