{"title":"POTHS 3 - Satan - 09 - In Washington DC - Part 4","uid":7619718,"size":3156851557,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:96f940607fbae1bac6dc7abc9650ea518680e068&amp;dn=POTHS+3+-+Satan+-+09+-+In+Washington+DC+-+Part+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"POtHS11","files":-1,"time":1347296646,"description":"POTHS 3 - Satan - 09 - In Washington DC - Part 4\n\n\nPOtHS Comments on This one: This is a multi pack.\n\n\nDescription:\n\nHidden Agendas\nThe Secret Behind The Secret Societies\n\nSigns of the Times\nSIN-ister Clips\nThe Holy Spirit\n\nIt is not Just Obama but it is ALL American Presidents. Powered by The Spirits of Darkness.\n\nALL OF THE PRESIDENTS OF THE USA except Lincoln were Luciferian Freemasons and members of other Secret Societies. THEY ALL WORSHIP SATAN, with Blood oaths never to testify against a fellow Mason, even if it means BETRAYING your own Blood or Family or Friends or COUNTRY. The big deception with The Freemason is God. They all worship God. We think of God in this Christian nation as Yahweh The Creator of The Universe. But what GOD are they worshiping??? Lucifer, Satan, The Prince of the Air and Old Scratch himself are a few of his many names. He was cast down to Earth as his prison, when he chose to disobey Yahweh with his boastful Pride and desire to be worshiped himself as a God. Satan is The God of the Earth. Lets see now, Get what I want on Earth to loose eternal life in the Heavens. I choose not to be an Earth Dweller, I am a pilgrim just passing through this imprisonment here on Satan's Earth. He can have Earth. I choose eternity with The Creator in The Heavens. Peace Brothers. Choose wisely. Time is Short.\n\n\nRAPtURE (My transportation outta here).\n\nThe Blessed Hope.  If you believe in The Rapture you better believe That The Sacrificed Blood of Jesus, on the Cross paid for your sins and there is NOTHING Else you can do to gain Salvation, The GRACE of Christ did it ALL. Now you just have to believe that with all your Heart, Mind and Soul or Maybe Get Left Behind. All PAST, Present and Future Sins are Forgiven with Jesus. (I wouldn't PUSH That Future sin statement to much!!!)\n\n- In a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed..\n\n- And He will send forth His angels with A GREAT TRUMPET and THEY WILL GATHER TOGETHER His elect from the four winds, from one end of the sky to the other.\n\n- Do not marvel at this; for an hour is coming, in which all who are in the tombs will hear His voice,  Then we who are alive and remain will be caught up together\n  with them in the clouds to meet the Lord in The Air, and there we will be forever be with him...","torrent":{"xt":"urn:btih:96f940607fbae1bac6dc7abc9650ea518680e068","amp;dn":"POTHS+3+-+Satan+-+09+-+In+Washington+DC+-+Part+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96f940607fbae1bac6dc7abc9650ea518680e068","infoHashBuffer":{"type":"Buffer","data":[150,249,64,96,127,186,225,186,198,220,122,188,150,80,234,81,134,128,224,104]},"announce":[],"urlList":[]}}