{"title":"Resident Evil RETRIBUTION Xvid Cam - GLOBE","uid":7642073,"size":1042761236,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9a943280992013a7ef65483fd4daf8d7fbcc160a&amp;dn=Resident+Evil+RETRIBUTION+Xvid+Cam+-+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1347805919,"description":"* XVID CAM  * 01H24M54S    * + 1500 Bitrate    * Worked with the Dub plugins\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n\n\n* Plot :\n\nFollowing where the previous film left off, Alice (Milla Jovovich) and the others on Umbrella Corporation's Arcadia freighter are being attacked by a fleet of airships led by Alice's former ally Jill Valentine (Sienna Guillory), who is being mind-controlled by Umbrella through a red scarab device attached to her chest. Alice shoots one down, and it crashes on to the ship, knocking her in to the water, unconscious.\n\nSwitching over into what seems to be an alternate reality, Alice is living as a suburban housewife with her husband Todd (Oded Fehr), who is a doppelganger of Carlos Olivera, and deaf daughter Becky (Aryana Engineer), although this peace is disrupted when zombies attack and kill Todd. Alice and Becky escape to the streets and are rescued by Rain Ocampo (Michelle Rodriguez), who lets them board her car. As the three escape, they are hit by a truck, knocking Rain unconscious while Alice and Becky escape; Alice runs and is attacked by a zombified Todd.\n\nSuddenly, the real Alice awakens in an Umbrella base, after being captured after the earlier fight in Arcadia. Jill appears and interrogates Alice, demanding who Alice is working for, while Alice begs Jill to remember her true identity. The power unexpectedly goes out, and when the power comes back on, Alice has escaped from her cell. Jill orders for a laser grid to chase Alice down the end of the hallway and through a door, which leads to the Toyko city landscape where she battles a horde of zombies that includes Japan's patient zero (Mika Nakashima), before fleeing through a door that leads back to Umbrella headquarters. Finding many dead Umbrella operatives, Alice encounters Ada Wong (Li Bingbing), who she recognizes as the associate of her enemy, Albert Wesker (Shawn Roberts). Ada explains that she and Wesker no longer work for Umbrella.\n\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n* GLOBE FILES 2012 ","torrent":{"xt":"urn:btih:9a943280992013a7ef65483fd4daf8d7fbcc160a","amp;dn":"Resident+Evil+RETRIBUTION+Xvid+Cam+-+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a943280992013a7ef65483fd4daf8d7fbcc160a","infoHashBuffer":{"type":"Buffer","data":[154,148,50,128,153,32,19,167,239,101,72,63,212,218,248,215,251,204,22,10]},"announce":[],"urlList":[]}}