{"title":"Hogtied-----HT-19698 - Jessi Palmer - namefix","uid":7642124,"size":706926337,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:9ad849a5d5b7b86581fc94db2341de2bf1341a68&amp;dn=Hogtied-----HT-19698+-+Jessi+Palmer+-+namefix&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1347807155,"description":"\nRe-up as TPB messed up name.\n\n\nJessi Palmer's Pigtail Hogtie\n\nApr 14, 2012 - Performers: Jessi Palmer\n\n\nMP4 and WMV + Pics.\n\n\nJessi. Beautiful innocent face with creamy white skin is bound with her arms in a box tie and her hair bound in pigtails attached to the pulley. Her knees are open wide with a spreader bar and each ankle is bound to the pulley too... its a very challenging hogtie!\n\nMatt comes in and quickly puts rubber bands on her feet snapping them against her arches. A vibrator is added immediately. She doesn't seem to be able to handle pleasure and tries to wriggle away. Matt insists she take it. Slowly we see her face soften and her mouth open in longer gasps. The moans slow down and Matt steals the vibrator away.\n\n&quot;How tall are you?&quot; he asks. Jessi responds, &quot;4'10.&quot; &quot;My dick is almost bigger than you.&quot;\n\nShe says nothing and looks at him stunned. He jams his very hard cock into her mouth, making her repeat, &quot;I'm a tiny cock sucking whore.&quot; Matt says she doesn't have a boyfriend because its too hard to make her cum. She thinks about it more and we start to get a reaction.\n\nAs a consequence of her not cumming, Matt pulls her hair and ankles up by the pulley. He says its going to get worse if she doesn't cum. Notching it up slowly... she tries desperately to cum... nothing happens. He ratchets it up more. Her head is pulled further back. It seems like she can't get any further.\n\nMatt says &quot;I'm going to make you cum whether you want to or not.&quot; She can't hold back her pleasure any more and bursts into an intense real orgasm. She is hoisted even further in the air where she can hardly breathe and left to suffer.\n\nScreens &lt;a href=&quot;\nhttp://www.hogtied.com/site/shoot.jsp?shootId=19698&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hogtied.com/site/shoot.jsp?shootId=19698&lt;/a&gt;\n\n8000 uploads and counting, if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n\nCheers  :-) \n\n","torrent":{"xt":"urn:btih:9ad849a5d5b7b86581fc94db2341de2bf1341a68","amp;dn":"Hogtied-----HT-19698+-+Jessi+Palmer+-+namefix","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ad849a5d5b7b86581fc94db2341de2bf1341a68","infoHashBuffer":{"type":"Buffer","data":[154,216,73,165,213,183,184,101,129,252,148,219,35,65,222,43,241,52,26,104]},"announce":[],"urlList":[]}}