{"title":"The Ed Show 10-5-12.mp4","uid":7702456,"size":156638678,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9ae794e21dbf9abffc3dd1acdd961958c6583bf8&amp;dn=The+Ed+Show+10-5-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1349567283,"description":"The Ed Show; October 5, 2012.\n\nUnemployment is the lowest it's been since President Obama took office and the conspiracy theorists are going nuts!\n\nEd brought the truth on today's huge jobs report with Robert Wolf (former President of UBS Investment Bank), and  Bob Shrum (Democratic Strategist).\n\nThen, a Republican talking point died a bloody death.  There was a requiem for the &quot;8% promise&quot; with Chris Kofinis (Democratic Strategist).\n\nA new report said the same company where mine workers attended a Romney rally without pay ALSO made workers donate to his campaign. Alec MacGillis (Senior Editor at The New Republic), had the details.\n\nMitt Romney is completely changing his tune after he basically called half the country lazy moochers. Karen Finney (MSNBC Political Analyst and Former DNC Communications Director), joined Ed for that.\n\nEarly voting is restored in Ohio for all.\n\nAnd in the Big Finish, LeVar Burton (actor and former Reading Rainbow host) is mad at Mitt Romney for going after Big Bird.  He joined Ed tp discuss Romney's promise to cut PBS funding and what it would mean for public television.","torrent":{"xt":"urn:btih:9ae794e21dbf9abffc3dd1acdd961958c6583bf8","amp;dn":"The+Ed+Show+10-5-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ae794e21dbf9abffc3dd1acdd961958c6583bf8","infoHashBuffer":{"type":"Buffer","data":[154,231,148,226,29,191,154,191,252,61,209,172,221,150,25,88,198,88,59,248]},"announce":[],"urlList":[]}}