{"title":"N3II Ninety-Nine Nights (USA) XBOX360","uid":9357148,"size":6335027344,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:9be5f11825d7154793892d2b35109352941a8d22&amp;dn=N3II+Ninety-Nine+Nights+%28USA%29+XBOX360&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"razalgul1979","files":-1,"time":1387234869,"description":"Origin: USA NTSC\n\nSet on a ravaged world, N3II Ninety-Nine Nights invites the player to take on all comers in a series of spectacular battles. Players can enjoy the story from five different perspectives - including humans, elves and goblins - and are pitted against wave after wave of adversaries in the ultimate 'last man standing' free-for-all. Each of the species is given a specific back story which unfolds as the game progresses, while the various races also bring unique skills and abilities to the battle field.\n\nN3II: Ninety-Nine Nights also has a two-player co-op online mode, wherein players team up against the oncoming hordes, working together to expand their combo range to take out more enemy assailants at once. This two-player mode features online ranking boards detailing the most effective pairings across the globe.\nRelease Date: June 29, 2010\n\nM for Mature:\n\nGenre: Action\n\nPublisher: Konami\n\nDevelopers: Feel Plus, Q Entertainment\n\n\n\n    Supported Functions\n    Number Of Players: 1-2\n    Online - Co-Op Number Of Players: 2\n    Online Co-Op Multiplayer\n\nFeatures:\n\n-Encounter Massive Epic Battles: Staying true to its predecessor, N3II will pit players against hundreds of enemies on screen for some of the most prolific Hack &amp; Slash gameplay to date!\n\n-Enjoy Dramatic Visual Upgrades: Improved graphical presentation on the Xbox 360 featuring more enemies on screen, over-the-top destruction (Orb Attack), and uncompromised levels of violence including a blood camera system.\n\n-Select from a Multitude of Fighting Styles and Weaponry: Campaign with various characters, each equipped with customizable weaponry/accessories allowing for enhanced combo attacks and features that progressively change enemy battles.\n\n-Form Alliances in Online Co-Op: Combat relentless enemies with a friend in fully supported online Co-Op play for 2 players via Xbox LIVE.\n","torrent":{"xt":"urn:btih:9be5f11825d7154793892d2b35109352941a8d22","amp;dn":"N3II+Ninety-Nine+Nights+%28USA%29+XBOX360","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9be5f11825d7154793892d2b35109352941a8d22","infoHashBuffer":{"type":"Buffer","data":[155,229,241,24,37,215,21,71,147,137,45,43,53,16,147,82,148,26,141,34]},"announce":[],"urlList":[]}}