{"title":"Oingo Boingo - Private Life [promo].VOB","uid":7783467,"size":259545088,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9c02ead822b2cf50ebdb02abfd852fd761c9854b&amp;dn=Oingo+Boingo+-+Private+Life+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SgtRlee","files":-1,"time":1351832159,"description":"Oingo Boingo - Private Life [promo].VOB\n\n\nHQ very rare promo music video from a promo DVD. &quot;Private Life&quot; is a song from Nothing to Fear, the second album by Southern California New Wave band Oingo Boingo, released in 1982 on A&amp;M Records. It was one of the first works to be produced by award-winning engineer Joe Chiccarelli. The album possesses a noticeably louder and more abrasive tone than those of their previous releases; the result of frontman Danny Elfman's desire to increase the diversity of the songs. He later declared Nothing To Fear to be &quot;far more 'Boingo'&quot; than the band's debut album. The songs feature an unorthodox range in instruments, such as electric bells, xylophones and synthesisers, some of which were designed and built by the band. \n\nInitial vinyl pressings of the album contain a lesser known mix of the song Private Life, featuring more prominent bass guitar and glockenspiel. The single version, which was subsequently used on all re-releases of the album, is also shorter by approximately 27 seconds, since it shortens the transition into the chorus among other alterations. \n\nThe song's release was accompanied with a music video, directed by Danny Elfman's brother Richard Elfman (who was also a founding member of the group). \n\nThe album was received with high regional sales and airplay, selling 125,000 copies in its original run, despite continuous condemnation from critics. Elfman often used this negativity to the band's advantage through publicity, stating: &quot;The music [the critics] like is inspirationless and contrived. If we start getting praise from this clique of six or eight reviewers, we'd probably have to evaluate where we went astray.&quot; The band went on a successful tour following their new release, even opening for bands such as The Police and Fear on occasion. \n\nOingo Boingo was an American new wave band. They are best known for their influence on other musicians, their soundtrack contributions and their high energy Halloween concerts. The band was founded in 1972 as a performance art group called The Mystic Knights of the Oingo Boingo, and from 1976 it was led by songwriter/vocalist Danny Elfman, who has since achieved substantial renown as a composer for film and television.\n\nThe group's format changed twice. In 1979, it changed from a semi-theatrical music and comedy troupe into a ska-influenced New Wave octet and shortened their name to Oingo Boingo. In 1994, the band reshuffled its lineup, adopted an alternative rock sound and rechristened themselves Boingo. The band retired after a farewell concert on Halloween 1995, having reverted to the name Oingo Boingo for the concert.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Nothing_to_Fear&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Nothing_to_Fear&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/PafENaaeH&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/PafENaaeH&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 8000kbps\n   Audio: PCM 48000Hz stereo 1536kbps [DVD LPCM, 16 bit]\n   Duration: 00:03:34\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.6.4\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:9c02ead822b2cf50ebdb02abfd852fd761c9854b","amp;dn":"Oingo+Boingo+-+Private+Life+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c02ead822b2cf50ebdb02abfd852fd761c9854b","infoHashBuffer":{"type":"Buffer","data":[156,2,234,216,34,178,207,80,235,219,2,171,253,133,47,215,97,201,133,75]},"announce":[],"urlList":[]}}