{"title":"Quake 3","uid":7794872,"size":3081478,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:9ca43df05c8686408740ec9aa38206ddd08b615d&amp;dn=Quake+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1352076005,"description":"This is the Android port of id Software's id Tech 3 engine. It will let you play Quake 3 Arena and various mods on your phone.\nYou can now press Menu key in game and configure the controls. The default control is to use one joystick for both movement and shooting. Press the inner ring to move and strafe, and press outer ring to shoot. The phone will vibrate once you touch the outer ring so you know you are shooting.\nIf you are more comfortable to move with joystick and shoot with trigger, press menu key in game to switch to traditional control.\nNote:\n1)The game will download Quake 3 Arena Free Demo when you launch it for first time. This is a one time only download. Make sure you have turned WiFi on before you start the game, so you will not be billed any wireless data rates by your carrier.\n2)To play the full game on phone, you need to own a retail copy of Quake 3. Otherwise you can continue playing the free demo or download mods;\n3)To install the full retail game, copy all pk3 files from your Quake 3 Arena CD to /quake3/baseq3 on your phone's sd card;\n4)Multiplayer game is supported as well. You can start a game server on your PC or phone, then play with friends and families using WiFi. Or you can play on any public 1.32 Quake 3 Arena servers.","torrent":{"xt":"urn:btih:9ca43df05c8686408740ec9aa38206ddd08b615d","amp;dn":"Quake+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ca43df05c8686408740ec9aa38206ddd08b615d","infoHashBuffer":{"type":"Buffer","data":[156,164,61,240,92,134,134,64,135,64,236,154,163,130,6,221,208,139,97,93]},"announce":[],"urlList":[]}}