{"title":"Bopup.Communication.Server.v4.0.1.LAN.Instant.Messaging.Server.S","uid":6806805,"size":36360460,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9dee19e5aa0f22c9c48c1dab69986537167ace4f&amp;dn=Bopup.Communication.Server.v4.0.1.LAN.Instant.Messaging.Server.S&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"boffon","files":-1,"time":1320893847,"description":"Bopup Communication Server version 4.0.1.9933\nCorporate instant messaging server for secure business communications\n========================================================================\n\n[OVERVIEW]\n\nBopup Communication Server is an instant messaging server for private IM, \ninternal chat and secure collaboration over corporate and business \nnetworks. It provides Active Directory support and integration, message \nand file archiving, offline messaging and document distribution with \na strong encryption of transmitted data. The server offers various \nauthentication modes to accept user connections, manages user groups \nfrom a single place, supports and handles easy and very effective \ndistribution of documents and important events from the IM server to \nemployees and users.\n\nSince the communication server is designed for business and \nenterprise-level environments it is intended to install and organize \na private and internal chat system and real-time communication platform \nfor companies with no outside access too. Bopup Communication Server is \neasy and fast to set up which takes about few minutes to get completed. \nIt comes with embedded SQL server to host it's database or can be \ninstalled using an existing MS SQL Server software.\n\nThe communication server includes a built-in functionality to upgrade \nIM client software with uploading new versions of the messengers on the \nserver. End-user messaging applications can be also distributed and \ndeployed with pre-installed settings and options that reduces \nan overall time of software setup. And the IM client branding feature \nlets upload company's image, logotype on the communication server and \nshow it in the messengers interface. It is highly important for \ncompanies and organizations that want to get their messaging software \nin a single corporate style.\n\n\nKey features:\n\nSEDURE AND PRIVATE COMMUNICATION\nAll transmitted messages and files are encrypted with strong encryption \nalgorithms based on the Diffie-Hellman key exchange and CAST-128 \nalgorithms. That is the first and primary way to make corporate \nand business IM safe and secure. \n\nAUTHENTICATION MODES\nThe server supports various modes to authenticate and authorize \nconnected users. Choose the best way for your corporate and business \ninfrastructure from the available authentication modes: Simple, Windows \nAuthentication (SSPI) and Private login/password.\n\nMESSAGING GROUPS\nThe centralized management of user groups makes it possible to organize \na flexible IM structure with a list of assigned groups and \nsend/receive-only permissions set for each user. \n\nUSER ONLINE STATUS\nOnline statuses allow users to see the current status of each user in \ntheir Contact List, i.e. Online, Away, Offline/Not available and control \ntheir own status. \n\nCONTACT LIST ACCESS\nUsers can organize personal Contact Lists and access them from any \nworkplace and location. Users are informed if there are new contacts \navailable on the IM server and if they can be added to their Contact \nLists. \n\nOFFLINE FILE TRANSFER AND URGENT MESSAGING\nEnable message exchange and file transfer even if some users are \ncurrently not available. Offline messages and files are automatically \ndelivered by the IM server to the recipient when the latter goes online. \nSend urgent messages for high-priority tasks and notifications. \n\nFILE DISTRIBUTION\nEasy, managed and secure distributing files and directories to client \nworkstations. Important documents can be assigned and delivered to users \nfrom the server in a fully automated mode with a set of advanced flags. \n\nTERMINAL SERVER SUPPORT\nThe client software fully supports the Terminal Server, Citrix \nenvironments and the Windows XP Fast User Switching feature. Users can \ncommunicate even if they are connected to the same server via Terminal \nClient sessions or have open logon sessions on the same computer \nsimultaneously. \n\nCONFIRMATION MODE\nActivate the Confirmation Mode which pops up the client messenger when \na message is received and keeps it on top of other windows until the \nuser clicks the Confirm Message button. That is the best way to attract \nusers' attention. \n\nCENTRALIZED NOTIFICATION\nSend notifications and urgent messages and keep users updated on any \nevents and information. These messages are automatically delivered by \nthe server at the scheduled time at the specified intervals. \n\nMESSAGE AND TRANSFER LOGGING &amp; ARCHIVING\nBrowse, search and view the entire message and file transfer archives. \nPrint information for any period and for any person. \n\nINSTANT IM CLIENT UPDATES\nThe messaging clients can be instantly updated from the central IM \nserver. This feature allows to keep IM client versions up-to-date and \ndeploy new software updates and patches in a completely automated way \nwithout having to manually install it on all user computers.\n\nACTIVE DIRECTORY (LDAP) SUPPORT\nImport user accounts from a global catalog and create the local users \ndatabase on the server within a few seconds. Import accounts by choosing \ndifferent criterias: by Organizational Units (OU) or by Groups. \nThe server also provides integration options with a directory and can \nsearch and import accounts &quot;on-the-fly&quot; when new users connect.\n\nACCESS FROM A COMMAND LINE INTERFACE\nControl the communication server and send messages directly from \na command line interface. Send scheduled and instant messages to users \nand groups from third-party applications, scripts or batch files.\n\nFAST TO DEPLOY AND EASY TO USE\nNeither experience nor special skills are needed for installing the \nserver. Just go through the steps of the Setup Wizard and get your IM \nsystem running in a few minutes. \n\n\n[SYSTEM REQUIREMENTS]\n\nBopup Communication Server requires the following minimum system \nconfiguration: \n\n* 1 GHz processor (or higher recommended) \n* 512 MB RAM \n* 70 MB free disk space (*) \n* Microsoft Windows NT 4.0/2000/XP/2003/Vista/2008/7 (**) \n* Microsoft SQL 2000/2005/2008 Server and higher \n* Active Directory (LDAP) presence (optional)\n* Network connection configured for TCP/IP protocols\n* Internet connection (optional)\n\n* - Specified disk space is required if the product installed with \nbuilt-in SQL server.\n** - The built-in MSDE 2000 package that comes with the installation is \nnot supported by Windows Vista and on that system the communication \nserver should be installed using an existing external MS SQL Server. \n\nBopup Communication Server requires Windows administrator rights to run \nthe Setup Wizard and install the service. After installation the server \ncan be run and managed under a non-administrator Windows account. \n\n\n[LIMITATIONS]\n\nThis is 30-day trial version! For advanced details and purchasing \ninformation please refer B Labs website and product page at  &lt;a href=&quot;\nhttp://www.bopup.com/products/server/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bopup.com/products/server/&lt;/a&gt;\n\n\n========================================================================\nCopyright (C) 2000-2011 B Labs. All rights reserved. &lt;a href=&quot;\nhttp://www.bopup.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bopup.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:9dee19e5aa0f22c9c48c1dab69986537167ace4f","amp;dn":"Bopup.Communication.Server.v4.0.1.LAN.Instant.Messaging.Server.S","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9dee19e5aa0f22c9c48c1dab69986537167ace4f","infoHashBuffer":{"type":"Buffer","data":[157,238,25,229,170,15,34,201,196,140,29,171,105,152,101,55,22,122,206,79]},"announce":[],"urlList":[]}}