{"title":"The Ed Show 10-23-12.mp4","uid":7763501,"size":199468704,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a17920b2567fff1df4144480b2c406f0e10441d6&amp;dn=The+Ed+Show+10-23-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1351302112,"description":"The Ed Show; October 23, 2012.\n\n Two weeks before Election Day and Republicans have come down with a case of &quot;at least three stage three Romnesia.&quot;\n\n&quot;If you say that you love American cars during a debate, but you wrote an article titled, 'Let Detroit Go Bankrupt,' you might have Romnesia,&quot; President Obama told supporters today in Delray Beach, Florida.\n\nEd welcomed Richard Wolffe (MSNBC Political Analyst) for the truth about the final 2012 presidential debate.\n\nAnd with only two weeks to go, the Obama camp shows some confidence when it comes to polling in key swing states.\n\nKaren Finney (MSNBC Political Analyst and Former DNC Communications Director), and E.J. Dionne (Senior Fellow at The Brookings Institution and Washington Post columnist), looked at the president's two-week plan for victory.\n\nThen, Mitt Romney claimed he'd be tough on China, but wouldn't give many specifics. Ed has the play-by-play on the clash of the candidates and talked to Sen. Sherrod Brown (D-OH) about the implications for workers in his state.\n\nIt looks like it's all coming down to Ohio. Who will win the Buckeye State?  State Sen. Nina Turner (D-OH) weighed in on the latest Republican effort to block the vote.\n\nIn Wisconsin, Tommy Thompson aired one of the most disgraceful ads you'll ever see. Ed brought you the latest attack on Democrat Tammy Baldwin.\n\nAnd in the Big Finish, former West Wing actor Bradley Whitford joined Ed to discuss his support for President Obama and worker's rights in California.","torrent":{"xt":"urn:btih:a17920b2567fff1df4144480b2c406f0e10441d6","amp;dn":"The+Ed+Show+10-23-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a17920b2567fff1df4144480b2c406f0e10441d6","infoHashBuffer":{"type":"Buffer","data":[161,121,32,178,86,127,255,29,244,20,68,128,178,196,6,240,225,4,65,214]},"announce":[],"urlList":[]}}