{"title":"Deliriously.Jen.PILOT.2005.DVDRip.H264.m4v","uid":7793311,"size":123891412,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a2993b137038961665bb4cf4a4196038c62626df&amp;dn=Deliriously.Jen.PILOT.2005.DVDRip.H264.m4v&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TheFarEdge","files":1,"time":1352076472,"description":"Release Info:\n\nRelease Name: Deliriously.Jen.PILOT.2005.DVDRip.H264.m4v\nFormat: H264 \nSize: 125 MB\nVideo: H264 | SD | 1 337 Kbps | 15.000 FPS | 4:3\nAudio: English | 384  Kbps | 2 ch | AAC\nRuntime: 15mn\nSubtitles: None\n\nIMDB Info:\n\nName: Deliriously Jen\nGenre: Comedy\nIMDB Link: &lt;a href=&quot; http://www.imdb.com/title/tt0483595/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0483595/&lt;/a&gt;  \nIMDB Rating: 9.1/10 \nDirector: Angus Oblong\nWriters: Jennifer Manley, Angus Oblong\nCast: Michale Ackerman, Shay'La Banks and Brian Beery\nPlot: 20 year old Jen (Jen Manley of &quot;Catch me if You Can,&quot; &quot;Galaxy Quest&quot; &amp; &quot;Will &amp; Grace.&quot;) is new to being out on her own, having just moved out of her controlling mother's house. Her mother has messed Jen up so badly, that in her young adulthood, she is the definition of naive &amp; oblivious. Jen is certain that she's the life of parties, a lot of fun to be around and that everyone wants to be her friend, but unfortunately, that just isn't true. But Jen isn't alone, her friends and neighbors are also socially rejects, only in different ways. And you'll get to meet them all! Happy but delirious Jen lives in an apartment complex where 12 dwellings surround a shared courtyard and a myriad of over-the-top characters reside. They are a veritable plethora of odd, social rejects who know of each other, but not necessarily by name; like there's &quot;The old lady with a peg leg and ten cats,&quot; or &quot;That guy who drives a bus and brings home ugly hookers&quot; or &quot;The crippled Indian woman with a dot on her forehead.&quot; Jen gets to know these odd characters, and they are her first glimpses of the real world. Having no life of her own, Jen often finds herself easily influenced by the interests and lives of others, trying very hard to fit in just so people will like her. She inevitably ends up changing people's lives positively, giving them a new outlook or attitude. Usually without trying or knowing what she's just done. Written by Angus Oblong\n\nExuberant and oblivious Jen, out on her own for the first time, moves into an apartment complex full of twisted characters. In gleeful pursuit of her identity, Jen tries on other people's lifestyles, crossing every line of appropriate behavior and making a mockery of all she embraces. She gloms onto her gay neighbor Ken and his community, joyfully declaring herself a &quot;hag fag!&quot; Written by Jennifer Manley\n","torrent":{"xt":"urn:btih:a2993b137038961665bb4cf4a4196038c62626df","amp;dn":"Deliriously.Jen.PILOT.2005.DVDRip.H264.m4v","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2993b137038961665bb4cf4a4196038c62626df","infoHashBuffer":{"type":"Buffer","data":[162,153,59,19,112,56,150,22,101,187,76,244,164,25,96,56,198,38,38,223]},"announce":[],"urlList":[]}}