{"title":"Tommy Boy(1995)DVDRip.AC3(ENG)-DROCK","uid":6796602,"size":736031241,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a41ac7926da3df1ad0568f3db48c323f6e422dee&amp;dn=Tommy+Boy%281995%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1320479194,"description":"Saturday Night Live star Chris Farley had his first starring role in this frankly lowbrow comedy, which teamed him with fellow SNL cast member David Spade. Big Tom Callahan (Brian Dennehy) is the street-smart owner of a company that makes auto parts, and one day he'd like his son Tommy Callahan III (Chris Farley) to take over the business. Trouble is, Tommy Boy is a fat, dim-witted slob who took seven years to get a business degree and has no idea how to run a business. His father's sudden death unexpectedly puts Tommy Boy in charge, with his dad's weasely assistant Richard (David Spade) trying to guide him. However, what no one knows is Big Tom's wife, the young and beautiful Beverly (Bo Derek), married him only for his money while holding on to her lover, Paul (Rob Lowe), whose presence she explains by telling people he's her son. Beverly and Paul are waiting for Tommy Boy to run the company into the ground so they can take over, sell it off and earn a quick payoff. However, what Tommy Boy lacks in smarts (and hygiene), he makes up for in determination, and he hits the road with Richard for a long sales trip in a last ditch effort to rescue his father's legacy. Tommy Boy was a major hit that turned Chris Farley into a screen star; sadly, died a little over 2 1/2 years later. \n\nRipped with Handbrake. \n\nLength: 1 Hour 37 Minutes\n\nFile Type: MP4\n\n","torrent":{"xt":"urn:btih:a41ac7926da3df1ad0568f3db48c323f6e422dee","amp;dn":"Tommy+Boy%281995%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a41ac7926da3df1ad0568f3db48c323f6e422dee","infoHashBuffer":{"type":"Buffer","data":[164,26,199,146,109,163,223,26,208,86,143,61,180,140,50,63,110,66,45,238]},"announce":[],"urlList":[]}}