{"title":"*Two Rows - Canadian Genocide/Vatican Crimes Documentary by Free","uid":7793298,"size":374953490,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a43c4360d0f4371243ef7dcb19370bfa2e576adb&amp;dn=%2ATwo+Rows+-+Canadian+Genocide%2FVatican+Crimes+Documentary+by+Free&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"WideAwake87","files":1,"time":1352075574,"description":"&quot;Freedom Central is delighted to release TWO ROWS, a documentary feature about the personal struggle of Kevin Annett, and the amazing work he is doing to uncover the genocide and suppression of the native peoples in Canada.\n\nThis film features first hand evidence, including direct testimony from a Native named Del Riley, about what went on at the Mohawk Institute, one of the many Indian Residential Schools in Canada. Freedom Central examined the evidence turned up at excavation digs where children of Indian Residential Schools were buried, as more than half the children who attended these schools, died there.\n\nFreedom Central documented Kevin's stay with us, as he launched the International Tribunal into Crimes of the Church and State. We also feature footage of some of the actions we took at local churches, as well as footage from Kevin's speaking event in Holland.\n\nIt was a true honor to work on this film, and I hope that it gives more insight into the personal struggles of Kevin Annett, as he bravely fights to bring the Vatican and Canada, to justice, through international Common Law courts. But also, I hope it clears up some of the nasty and unfounded rumors and malicious slander that Kevin Annett is blighted with. What he is trying to do, needs to be known across the world, and we all need to be called to action, to implement the Common Law court system.&quot;\n\n\nPlease share and seed. Thankyou.","torrent":{"xt":"urn:btih:a43c4360d0f4371243ef7dcb19370bfa2e576adb","amp;dn":"%2ATwo+Rows+-+Canadian+Genocide%2FVatican+Crimes+Documentary+by+Free","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a43c4360d0f4371243ef7dcb19370bfa2e576adb","infoHashBuffer":{"type":"Buffer","data":[164,60,67,96,208,244,55,18,67,239,125,203,25,55,11,250,46,87,106,219]},"announce":[],"urlList":[]}}