{"title":"Island Press - Climate and Conservation 2012 eBook - AXA [deepst","uid":7728373,"size":6650348,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a529f30688ac2ed448050ab8dc2dd67981d84005&amp;dn=Island+Press+-+Climate+and+Conservation+2012+eBook+-+AXA+%5Bdeepst&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"deepstatus","files":-1,"time":1350276960,"description":"\n:                         Climate and Conservation                            :\n+-+                                                                         +-+\n  :    SUB TITLE: Landscape and Seascape Science, Planning, and Action      :\n  :       AUTHOR: Charles C. Chester,Jodi Hilty,Molly Cross                 :\n  :    PUBLISHER: -                                                         :\n  :   CATEGORIES: -                                                         :\n  : RELEASE DATE: 2012-10-13               PUBLISH DATE: 2012-05-29         :\n  :      ISBN-10: 1610911709                      PAGES: 416                :\n  :      ISBN-13: 9781610911702                LANGUAGE: English            :\n  +-------------------------------------------------------------------------+\n\n   Climate and Conservation presents case studies from around the world of   \n   leading-edge projects focused on climate change                           \n   adaptation-regional-scale endeavors where scientists, managers, and       \n   practitioners are working to protect biodiversity by protecting           \n   landscapes and seascapes in response to threats posed by climate          \n   change. The book begins with an introductory section that frames the      \n   issues and takes a systematic look at planning for climate change         \n   adaptation. The nineteen chapters that follow examine particular case     \n   studies in every part of the world, including landscapes and seascapes    \n   from equatorial, temperate, montane, polar, and marine and freshwater     \n   regions. Projects profiled range from North American grasslands to        \n   boreal forests to coral reefs to Alpine freshwater environments.          \n   Chapter authors have extensive experience in their respective regions     \n   and are actively engaged in working on climate-related issues. The        \n   result is a collection of geographical case studies that allows for       \n   effective cross-comparison while at the same time recognizing the         \n   uniqueness of each situation and locale. Climate and Conservation         \n   offers readers tangible, place-based examples of projects designed to     \n   protect large landscapes as a means of conserving biodiversity in the     \n   face of the looming threat of global climate change. It informs readers   \n   of how a diverse set of conservation actors have been responding to       \n   climate change at a scale that matches the problem, and is an essential   \n   contribution for anyone involved with large-scale biodiversity            \n   conservation.                                                             \n\n  +-[ ALEXANDRIA ]----------------------------------------------------------+\n  : The Royal Library of Alexandria, or Ancient Library of Alexandria, in   :\n  : Alexandria, Egypt, was the largest and most significant great library   :\n  : of the ancient world. It flourished under the patronage of the          :\n  : Ptolemaic dynasty and functioned as a major center of scholarship from  :\n  : its construction in the 3rd century BC until the Roman conquest of      :\n  : Egypt in 30 BC. The library was conceived and opened either during the  :\n  : reign of Ptolemy I Soter (323-283 BC) or during the reign of his son    :\n  : Ptolemy II (283-246 BC).                                               /:\n  +-----------------------------------------------------------------:_/--/:+  \n    &quot;With knowledge, comes wisdom - and wisdom should be shared.&quot;       /\n","torrent":{"xt":"urn:btih:a529f30688ac2ed448050ab8dc2dd67981d84005","amp;dn":"Island+Press+-+Climate+and+Conservation+2012+eBook+-+AXA+%5Bdeepst","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a529f30688ac2ed448050ab8dc2dd67981d84005","infoHashBuffer":{"type":"Buffer","data":[165,41,243,6,136,172,46,212,72,5,10,184,220,45,214,121,129,216,64,5]},"announce":[],"urlList":[]}}