{"title":"The Return of Sherlock Holmes(1986-1988)DVD 4-4 (nl subs) B-sam","uid":7701009,"size":4681422177,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a7441f3cd16d834c56f0c3b32bcc038ad5d3324f&amp;dn=The+Return+of+Sherlock+Holmes%281986-1988%29DVD+4-4+%28nl+subs%29+B-sam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"Betty-Boop","files":-1,"time":1349517751,"description":"The Return of Sherlock Holmes(1986-1988)DVD 4-4 (nl subs) B-sam\n\n\nOmschrijving:\nThe Adventures of Sherlock Holmes is een Britse televisieserie opgenomen tussen 1984 en 1994 in 41 afleveringen. De serie bestaat uit verfilmingen van vrijwel alle romans en korte verhalen over de detective Sherlock Holmes.\n\nDe serie was een productie van Granada Television. Jeremy Brett vertolkte de rol van Sherlock Holmes. David Burke vervulde aanvankelijk de rol van Dr. Watson, totdat hij besloot met de serie te stoppen om meer tijd door te brengen met zijn gezin. Edward Hardwicke nam de rol van hem over.\n\nVoor de serie werd een volledige replica van Baker Street gebouwd in de studios van Granada.\n\nNaast Brett, Burke en Hardwicke waren andere vaste acteurs Rosalie Williams als huishoudster Mrs. Hudson en Colin Jeavons als Inspecteur Lestrade van Scotland Yard. In enkele afleveringen speelde Charles Gray mee als Holmes broer Mycroft Holmes. Hij speelde dit personage ook al in de film The Seven-Per-Cent Solution uit 1976. Eric Porter speelde Holmes aartsvijand, Professor Moriarty.\n\nIn totaal werden 41 van de 60 Sherlock Holmes-verhalen geschreven door Sir Arthur Conan Doyle bewerkt voor de serie. De serie moest noodgedwongen stoppen door de dood van Brett als gevolg van hartfalen. Eerder was al bekend geworden dat hij vanwege zijn zwakke gezondheid wilde stoppen met de serie. De producers besloten na zijn dood geen vervanger te zoeken, maar de serie te beeindigen.\n\nDe serie bevat volgens veel Sherlock Holmes-fans de meest getrouwe verfilmingen van de verhalen. Desondanks bracht de reeks wel wat wijzigingen aan bij de personages. Zo stopte Holmes in de aflevering The Devils Foot met zijn gebruik van cocaine omdat de serie ook populair bleek onder kinderen.\n\n\nEnglish\n\nDr. Watson, finds a mystery in an empty house, while Holmes and he later solve the mysteries of an abbey grange, the Musgrave ritual, a second stain, a man with a twisted lip, the priory school, and a half-dozen plaster busts of Bonaparte.\n\nGenre ........: Drama/Mysterie\nSource...... .: Retail DVD\nBeeldFormaat..: 4:3\nTaal .........: Engels\nAudio ........: Engels 2.0\nOndertiteling : Nederlands\nInhoud........: 4 DVD's\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0090509/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0090509/&lt;/a&gt;\n\n\n\n\n\n@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\n\nKom ook eens kijken :\n &lt;a href=&quot;\nhttp://black-sam.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://black-sam.org&lt;/a&gt;\n\n\nEnjoy\n\n\n@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@","torrent":{"xt":"urn:btih:a7441f3cd16d834c56f0c3b32bcc038ad5d3324f","amp;dn":"The+Return+of+Sherlock+Holmes%281986-1988%29DVD+4-4+%28nl+subs%29+B-sam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7441f3cd16d834c56f0c3b32bcc038ad5d3324f","infoHashBuffer":{"type":"Buffer","data":[167,68,31,60,209,109,131,76,86,240,195,179,43,204,3,138,213,211,50,79]},"announce":[],"urlList":[]}}