{"title":"Up with Chris Hayes 9-9-12.mp4","uid":7620827,"size":358204834,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a7581f04cc4f694646b69804d7f8f6791c8ab585&amp;dn=Up+with+Chris+Hayes+9-9-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"liberal42","files":-1,"time":1347322905,"description":"Up with Chris Hayes; Sunday, September 9, 2012.\n\nOn Sunday's Up with Chris Hayes, Chris and his guests examined what the president didn't say in his speech to the Democratic National Convention on Thursday. They talked about what President Obama's second term might look like, and how he might overcome an even more entrenched Republican opposition. They discussed the Democrats' cheering of President Obama's foreign policy record, and reflect on the refrain of &quot;Bin Laden is dead&quot; uttered so often at the DNC. And they took a deep dive into the new, data-driven secret science of campaigning, which is quietly revolutionizing American politics and could fundamentally alter the course of this presidential campaign.\n\nJoining Chris were:\n\nHawaii Democratic Congressional candidate Tulsi Gabbard (former member of the Honolulu City Council and former Commission Commander and Captain of the Honolulu National Guard), Peter Beinart, (senior writer for Newsweek/Daily Beast and founder of the blog Open Zion), Jacob Hacker (professor of political science at Yale University and co-author of &quot;The Prosperity Agenda: What the World Wants from America and What We Need in Return&quot;), Michelle Goldberg (senior contributing writer for Newsweek/Daily Beast and author of &quot;The Means of Reproduction: Sex, Power and the Future of the World&quot;) discussed GOP obstruction \n\nJeremy Scahill (national security correspondent for The Nation) joined and replaced Jacob Hacker on the panel. The new panel discussed the gross continuation of Bush military tactics.\n\nSasha Issenberg, columnist for Slate.com, Washington correspondent for the &quot;Monocle,&quot; and author of &quot;The Victory Lab: The Secret Science of Winning Campaigns&quot;) replaced Peter Beinart but switched seats with Tulsi Gabbard.\nWalter Shapiro, (columnist for Yahoo News and the Columbia Journalism Review. He is currently covering his ninth presidential campaign), Chris Hughes (co-founder of Facebook, founder of Jumo.com, and chief digital organizer of the 2008 Barack Obama Presidential Campaign), Bob Shrum,(Democratic Strategist, senior advisor to the 2004 Kerry-Edwards campaign and to the 2000 Gore presidential campaign, senior fellow at NYU's Graduate School of Public Service) joined via satellite. This panel talked about political ads.\n\n'You Should Know' panel (L-R): Peter Beinart, Tulsi Gabbard, Sasha Issenberg, and Michelle Goldberg.","torrent":{"xt":"urn:btih:a7581f04cc4f694646b69804d7f8f6791c8ab585","amp;dn":"Up+with+Chris+Hayes+9-9-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7581f04cc4f694646b69804d7f8f6791c8ab585","infoHashBuffer":{"type":"Buffer","data":[167,88,31,4,204,79,105,70,70,182,152,4,215,248,246,121,28,138,181,133]},"announce":[],"urlList":[]}}