{"title":"Kayfabe - A Fake Real Movie About A Fake Real Sport-Strajow.avi","uid":7803344,"size":920731456,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a764a0f911dca66194dcd51a8e54d303409db002&amp;dn=Kayfabe+-+A+Fake+Real+Movie+About+A+Fake+Real+Sport-Strajow.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Strajow","files":-1,"time":1352337331,"description":"2007 Independent Comedy Film about a failing independent wrestling company that is about to go under and the characters and who are part of it. Described by some as the comedy equivalent of 'The Wrestler' starring Mickey Rourke, the film does have some similarities but seems to cover mostly different ground and concentrates more on the characters within the company, both in front of and behind the curtain \n\n\n\nPlot:\nEver wonder how on earth somebody actually becomes a professional wrestler? It's a lot less glamorous than you might think... Over the last several decades, for 20 bucks a night in front of crowds of less than 100, the &quot;stars&quot; of the Tri-Cities International Championship Wrestling Federation (TCICWF) have been trying to make it to the big time by performing their own campy brand of sports entertainment. In the process, they have inadvertently offended just about everybody in town. And now that the TCICWF is shutting down forever, these colorful, eccentric, clueless, indie wrestlers have one last chance to show the world that they belong in the big leagues. Kayfabe pulls no punches while revealing the hilarious absurdities of independent professional wrestling.\n\n\n\nFrame Size : 720x480 \nFile Type : .avi \nCodec : XviD \nDuration : 1hr 31min 32secs","torrent":{"xt":"urn:btih:a764a0f911dca66194dcd51a8e54d303409db002","amp;dn":"Kayfabe+-+A+Fake+Real+Movie+About+A+Fake+Real+Sport-Strajow.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a764a0f911dca66194dcd51a8e54d303409db002","infoHashBuffer":{"type":"Buffer","data":[167,100,160,249,17,220,166,97,148,220,213,26,142,84,211,3,64,157,176,2]},"announce":[],"urlList":[]}}