{"title":"elle-A - Stop Dont Go  (2000 Retail)","uid":7631785,"size":8415988,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a8f69c02d9cd860df10e45d423171662fe984a97&amp;dn=elle-A+-+Stop+Dont+Go++%282000+Retail%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thatdjguy","files":1,"time":1347556630,"description":"This was the title track from the original 4 track Debut CD Single from 'elle-A' released way back in January 2000, from the Gloucester U.K. based critically and publicly acclaimed 3 piece Pop/Rock Vocal/Dance Girl Band. The Band had it's big live performance debut to a 'sell out' crowd at the Cheltenham Town Hall some 8 months later. Video on You Tube.\nSounds a bit 'Cheesy' and 'Dated' now but at the time it sold many records for the Girl band. So you can't say fairer than that can you ? It done it's job very well.\n\nWritten, Produced and Engineered, All Instruments (not Vocals), Mixed, Sequenced &amp; Mastered by Producer/Manager Guy J Mitchell, this is the title track of the Bands 4 track CD recorded over 3 months in his own 24 track Digital Studio on the outskirts of the Band's home City of Gloucester, U.K. Other tracks on the CD were a very good remake/remix of the Bryan Adams classic 'Summer of '69. Along with this there was an extended Dance Remix of Stop Don't Go and finally a Karaoke Backing Track of Stop Don't Go to sing along with. (I will upload these also). \nThe CD hit the stores in January 2000 being distributed by the HMV Group and the MVC UK Chain of record stores. Sales done well and it became the launch that was needed after a previous 12 months of very hard rehearsals, visual production and preparations for the 7 year career that was to follow. \nAlthough 'poppy' and 'commercial' and typical of Girl band Pop at that time, the single was not really reflective of their later and general musical style, Stop Don't Go became very much talked about by many as the perfect 'Springboard' for them as it attracted a lot of interest from many people locally and gave them the openings to many venues and 'Prime Gigs' in the county. They soon became very 'Big News' very quickly and the local public and Radio Stations loved them as they had become the 'first' biggish thing, with their own CD to ever come out of their home town City of Gloucester. Having created and putting a solid and professional team around them resulted in a very high attention to detail in their performance, technical and visual production. The Bands flexible vocal and dance abilities and their ability to appeal to and entertain all ages, were further heightened by their good 'all round performance' ability giving them a very 'slick edge' on many other performers in the area. \nThis they proved for many years to many people in many places around the Country. \nEnjoy and thanks for listening. \nAll Rights Reserved (Video / Audio Content). Â© Guy J Mitchell &amp; GuyJayFlix. Alicante. Spain. \nelle-A are: Hayley Williams, Michelle Bradbury, Estelle Iles. Exclusive Management and Representation for elle-A by Guy J Mitchell for GMG Group / GMI Records. \nCopyright: Madcom, GMG Group, GMI Records, MusoSound, GuyJayFlix: 2000 - 2012. \n(Big thanks and much Love to loyal wife Lyn and son Guy for being there in my life).","torrent":{"xt":"urn:btih:a8f69c02d9cd860df10e45d423171662fe984a97","amp;dn":"elle-A+-+Stop+Dont+Go++%282000+Retail%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8f69c02d9cd860df10e45d423171662fe984a97","infoHashBuffer":{"type":"Buffer","data":[168,246,156,2,217,205,134,13,241,14,69,212,35,23,22,98,254,152,74,151]},"announce":[],"urlList":[]}}