{"title":"Jake.Speed.1986.DVDrip.x264-Manifesto","uid":6826664,"size":1599730701,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a99366c94c4b4ce291f8ca0bb84a1e67744ea297&amp;dn=Jake.Speed.1986.DVDrip.x264-Manifesto&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"janforyou42","files":-1,"time":1321593364,"description":"Jake Speed is a 1986 action/comedy film directed by Andrew Lane, produced by Lane, Wayne Crawford, and William Fay, written by Lane and Crawford, and starring Crawford in the title role.\nPlot\n\nIn Paris, a girl by the name of Maureen Winston (Becca C. Ashley) is abducted by two evil-looking men. While her family prays for her safe return, Maureen\\\\\\\\\\\\\\'s father heaps guilt on her sister Margaret (Karen Kopins), since she convinced her to go see the world. However, Margaret\\\\\\\\\\\\\\'s grandfather (Leon Ames) has an idea: call for Jake Speed (Wayne Crawford) to go and rescue her. However, there is one problem: Jake Speed is a character in a series of 40\\\\\\\\\\\\\\'s-style pulp fiction novels.\n\nHowever, Jake Speed does exist, as Margaret finds out when he leaves a note for her to meet him and his sidekick, Desmond Floyd (Dennis Christopher), in a tough Paris bar. The novels, as Margaret finds out, are based on Jake and Des\\\\\\\\\\\\\\'s real life adventures, and they work for nothing, seeing action and excitement (and another novel) as their reward.\n\nJake reveals that Maureen was kidnapped by white slavers, and is being held in an African country. Jake, Des, and Margaret fly to the nation, which is in the middle of a civil war, in order to rescue her. Many twists and turns later, we find out that Jake\\\\\\\\\\\\\\'s archenemy, the evil, perverted, murderous Englishman Sid (John Hurt), is behind the ring, and soon, Margaret becomes a part of it. Jake and Des must now rescue both Maureen and Margaret, stop Sid, and help the girls get out in one piece, while dealing with warring factions, pits of lions, and machine gun-firing helicopters.","torrent":{"xt":"urn:btih:a99366c94c4b4ce291f8ca0bb84a1e67744ea297","amp;dn":"Jake.Speed.1986.DVDrip.x264-Manifesto","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a99366c94c4b4ce291f8ca0bb84a1e67744ea297","infoHashBuffer":{"type":"Buffer","data":[169,147,102,201,76,75,76,226,145,248,202,11,184,74,30,103,116,78,162,151]},"announce":[],"urlList":[]}}