{"title":"Sideload~Wonder~Machine v. 1.2 for Android","uid":7755125,"size":2713014,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:aa8ad65df05706caa6327b4029c7e82405db9a82&amp;dn=Sideload%7EWonder%7EMachine+v.+1.2+for+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxmikloxx","files":1,"time":1351074814,"description":"                       .__ __   .__                        \n___  ______  ___ _____ |__|  | _|  |   _______  ______  ___\n  /  /  /  //     |  |  |/ /  |  /  _   /  /  /  /\n &gt;    &lt;  &gt;        &lt; \n/__/_ /__/_ __|_|  /__|__|_ ____/____/__/_ /__/_ \n      /      /     /        /                /      /\n\n***I DID NOT DEVELOP THIS PROGRAM/APP NOR ANY OF THE ASSOCIATED FILES***\n\nThe Android Central Sideload Wonder Machine (SWM) was designed to allow you to sideload applications to your Android device, without the need to install the Android SDK, or to use cumbersome command prompt commands. While specifically designed for phones where the ability to install from &quot;Unknown Sources&quot; has been disabled, this program will work with any Android device.\n\nWhat is 'sideloading'?\n\nSideloading refers to the practice of installing applications on your Android device that have not been downloaded from the official Android Market. Android developers may choose to have their application hosted elsewhere, and via a direct download and sideloading the applications can be used like any other application you have downloaded from the official Market. Normally, this can be done directly on the device, but this has been disabled on some Android phones.\n\n1. This has not been publicly tested, so it gets the BETA tag. It has been through a good bit of private testing, and it's time to put it out there for bug reports. The download is attached to the bottom of this post. The source will follow once I'm satisfied the BETA isn't broken.\n\n2. You will still need to install the Microsoft .NET 4 framework. \n\n3. To install version 1.2 of the SWM, you need to place the AC_SWM folder that is inside the zip file you downloaded on your C: drive. Don't place it in any subfolder. Don't remove any files or folders from the AC_SWM folder. Doing it this way (manually copying the folder) keeps us from having to write to the Windows registry. Nobody wants to do that.\n\nOpen the downloaded zip file with your favorite zip file utility. Or just use Windows and double click it.\nIn a separate window, open My Computer and navigate to your C: drive. If you don't have a C: drive, you already know what you're doing and will need to create one.\nDrag the AC_SWM folder from the zip file into your C: drive.\n\nInside the AC_SWM folder is the program itself. LEAVE IT WHERE IT IS. You can create a shortcut to the application anywhere you like, but the program itself needs to stay put.\n\nYou will also need to install the adb USB driver for your phone. You can find this at the manufacturers site. The application will not, and can not function without this. Refer to your device specific forum for help if needed.\n\nYou will need to enable USB debugging to use the SWM. On your phone:\nmenu-&gt;settings-&gt;Applications-&gt;Development . Check the box that says USB Debugging.\n\nTo use the SWM:\nConnect your phone to your computer.\nMake sure your phone is not set to act as a USB device.\nMake sure your phone is not set to act as a USB modem.\nMake sure any applications or windows that open and run when you plug your phone in are disabled. This includes doubleTwist and WinAmp, as well as device or carrier specific programs.\nOpen the Sideload Wonder Machine program on your computer.\nUse the &quot;Choose APK&quot; button to find the .apk file of the application you want to install. It's a standard windows dialog. Just select it and choose &quot;open&quot;.\nYou'll see a popup that tells you exactly what file is being prepared to be installed. If this is correct, click OK in that window.\nPress the &quot;Install&quot; button to install the application to your phone. If you are upgrading an app that already exists, be sure to check the box to let the program know.\nA window will open. Read what the window says. If there is no error message, everything went as planned and your application is now installed.\n\n\nIf there is an error, while your phone is plugged in open the diagnostics window via the &quot;Diagnostics&quot; button. Run both diagnostic tools. Read the output of them, and look for the error. If you are unable to resolve the error, please provide a screenshot of both diagnostic windows for better help.\n\n\nThank you for downloading and please continue seeding :)\n\nAlso, If you're interested in joining the FoneLab Development Team or contributing please email us at &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;374f535653524119564077505a565e5b1954585a&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;","torrent":{"xt":"urn:btih:aa8ad65df05706caa6327b4029c7e82405db9a82","amp;dn":"Sideload%7EWonder%7EMachine+v.+1.2+for+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa8ad65df05706caa6327b4029c7e82405db9a82","infoHashBuffer":{"type":"Buffer","data":[170,138,214,93,240,87,6,202,166,50,123,64,41,199,232,36,5,219,154,130]},"announce":[],"urlList":[]}}