{"title":"Nvidia system tool V6.06","uid":6824555,"size":93005824,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ab0d84bff145377368101ea3cd49e140245d7c67&amp;dn=Nvidia+system+tool+V6.06&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"manu9982401984","files":1,"time":1321528432,"description":"NVIDIA System Tools (previously called nTune) is a collection of utilities for accessing, monitoring, and adjusting system components, including temperature and voltages with user-friendly control panels within Windows, rather than through the BIOS.\n \nAdditionally, System Tools has a feature that automatically adjusts settings and tests them to find what it believes to be the optimal combination of settings for a particular computer hardware configuration. Everything, including the GPU, CPU, MCP, RAM, Voltage and Fans are adjusted, though not all motherboards support all of these adjustment options.\n \nConfigurations can also be saved. This allows the end user to toggle between performance gaming profiles, quiet profiles for less demanding work, or some other profile that is usage-specific.\n \nNVIDIA System Tools is also a front end for the BIOS. Most settings that can be changed in the BIOS are available in the utilities included. BIOS and driver updates to both nForce and GeForce hardware can also be done through System Tools. It additionally supports hardware which is certified under the Enthusiast System Architecture and connects to the motherboard via USB.\n","torrent":{"xt":"urn:btih:ab0d84bff145377368101ea3cd49e140245d7c67","amp;dn":"Nvidia+system+tool+V6.06","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab0d84bff145377368101ea3cd49e140245d7c67","infoHashBuffer":{"type":"Buffer","data":[171,13,132,191,241,69,55,115,104,16,30,163,205,73,225,64,36,93,124,103]},"announce":[],"urlList":[]}}