{"title":"Pocket Planets v1.0.3 Final By bobiras2009","uid":7660065,"size":45270412,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:abb7757f21cbe6e8bc6d04690e7fecbbceb28dc1&amp;dn=Pocket+Planets+v1.0.3+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1348277385,"description":"Follow my uploads here:                             &lt;a href=&quot;\nhttps://forum.suprbay.org/member.php?action=profile&amp;uid=311481&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/member.php?action=profile&amp;uid=311481&lt;/a&gt;    \n\nYou can make requests here:                              &lt;a href=&quot;\nhttps://forum.suprbay.org/forumdisplay.php?fid=4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/forumdisplay.php?fid=4&lt;/a&gt;\n                 \n\n                                By bobiras2009\t\t\n\n\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\nPocket Planets is the largest 3D Solar System Simulator in the Google Play Store.\nWith scaled representation of the Sun, Planets, Moons, Asteroids, Dwarfs and detailed information to the celestial objects.\nRegardless if you are a beginner or advanced astronomer, this App brings you closer to the planets than any telescope.\n\nDiscover ...\n\n    the Sun, the bright shining star in the center of our Solar System\n    Mercury, the fastest planet orbiting around our Sun\n    Venus, its greenhouse effect produces a surface temperature that would even bring lead to melting\n    Earth, the blue oasis and only place filled with life\n    Mars, inspiration for many SciFi films and books\n    Jupiter, the giant, guardian and protector in our neighborhood\n    Saturn, with rings of unique beauty and elegance\n    Uranus, which rolls over its orbit like a bowling ball\n    Neptune, the outermost recognized planet\n    Pluto, one of a new category of dwarf planets\n\nBut these are not all objects of this simulator, because so far you do not know Orcus, Varuna, Ceres, Pallas, Haumea and all the other asteroids and dwarf planets. Not to mention Sedna whose orbit is still speculative to science.\n\nNearly 200 objects are included in this simulator, but not as static images, rather as living objects in a living universe. Enjoy the Solar System in realtime, in the future or past.\n\nBring the cosmos to life with an innovative timeslider. Let time take its course, how fast depends on the scale factor of the timeslider. A wipe with your finger and the simulator comes to life.\n\nFor a more exiting viewing experience various camera modes are available. Attach the camera to a planet or place it at a fixed location in space and let the celestial bodies pass by, in portrait or landscape mode, whatever you prefer.\n\nAnd that's still not all. A built in encyclopedia gives you useful information about each object of the simulation, extracted from Wikipedia.\n\nSo what are you waiting for, don't miss this viewing experience, there is no easier way to explore the wonderful world beyond our planet.\nAnd if you ever feel &quot;Lost in Space&quot;, don't worry, because its just a simulation.\n\nFeatures:\n\n    Nearly 200 simulation objects\n    Simulation of real celestial body distances and dimensions\n    Adjustable simulator time with an innovative timeslider\n    Flexible camera system for a unique viewing experience\n    Portrait and landscape mode\n    Many HD textures, some of original recordings (NASA Voyager, Cassini spacecraft)\n    Many preference options\n    Ephemeris data based on NASA Horizons system\n    Orbit calculations with modified Kepler algorithms\n    Encyclopedia function, the most important information from Wikipedia\n\nWhat's in this version : (Updated : Sep 20, 2012)\n\n    Bugfix, crash when touching splashscreen or invoke context menu\n\nRequired Android O/S : 2.2+\n\n\n\n                                By bobiras2009\t\t","torrent":{"xt":"urn:btih:abb7757f21cbe6e8bc6d04690e7fecbbceb28dc1","amp;dn":"Pocket+Planets+v1.0.3+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abb7757f21cbe6e8bc6d04690e7fecbbceb28dc1","infoHashBuffer":{"type":"Buffer","data":[171,183,117,127,33,203,230,232,188,109,4,105,14,127,236,187,206,178,141,193]},"announce":[],"urlList":[]}}