{"title":"Music and Video Games That Want Your Soul (2013 conspiracy docum","uid":7762638,"size":3891080375,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:abf487604e8a4fe2f274f96dfc240203131594ba&amp;dn=Music+and+Video+Games+That+Want+Your+Soul+%282013+conspiracy+docum&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"one_last_round","files":3,"time":1351275506,"description":"Music That Wants Your Soul 2.0 (2012) \n\nThis video covers the Satanism theme in music.  This is the theme of my video because I believe these artists do believe in what's in their lyrics.  It's not just fun and games. This video will show you this throughout, by showing examples from some of biggest names in the music industry.  Once again, this is done by looking at music videos and breaking both the hidden and open messages present in them.  Along with this, the video covers the symbols that these artist use, like Jay Z when he uses the pyramid or triangle.\n \n\nMovies That Your Soul (2012)\n \nI made this video movie documentary.  The goal of the film is to make you realize that movies are made to program the viewer to accept certain ideas that are designed to change behavior.  This is done because certain agendas and ideas are easier accepted if someone is familiar with them.  Present an idea that might be first opposed and put it in a movie, television or print media.  Have that idea look cool and sexy.  Use comedy to bypass people's critical thinking.  Use subliminal imagery and metaphors.  Have the desired programming reach a young audience because children don't have the same critical thinking as adults.  Once the children are grown up, they will be the ones given the culture and the things that you programmed them with.  A lot of times you want to put the desired programming into their subconscious before the event happens.  And it is important to destroy the family because such ideas will be more acceptable to the target without parents as role models that give their child a strong moral code and knowledge.\n \nList of movies used\n Back to the Future II, Starman, Rock Star, Rosemary's Baby, Dragnet, Equiliberium, American Pie, Ghostbusters, Poltergeist, Star Wars Episode III, Flash Gordon, The Doors, the Running Man, the Ninth Gate, Angel Hart, the Entity, From Hell, 2012, Surrogates, District 9, the Devil Rides Out, BeDazzled, Conspiracy Theory, The Omen Trilogy, the Hangover, A Clockwork Orange, Dogma, Cyborg, Prince of Persia-The Sands of Time, the End of Days, Twelve Monkeys.\n \n\nVideo Games That Want Your Soul (July 4th, 2012) \n\n\nPart 1:  Video Game Violence\n With the rise in realism, due to graphical improvements, what impact does video games violence have on the individual that's playing them?  This section will show video game clips having graphical violence.\n \nPart 2:  Military Involvement\n Are video games training you for real life combat?  Is the military trying to recruit people through video games?  Part two will discuss the military's influence on video games.  \n \nPart 3.  Human Augmentation.  \n This section explores the idea of humans merging with technology.  The argument for this section is as followed.  Is there a possibility of losing your humanity when merging with technology?\n \nPart 4:  Sex In Games  \n Sexual themes present in video games are shown.  Could there be a moral and social danger depending on how certain sexual content is portrayed?      \n \nPart 5:  Predictive Programming\n How might video games be used to program the viewer?  Is there an agenda to get people to accept certain ideas? Are you being influenced to accept something that you aren't even aware of?\n \nPart 6:  Fallen Angel\n Lastly, video games with demonic themes are covered.  Why are demonic themes present in some video games?  \n \nList of games used:\n Assassin's Creed, Battlefield 3, Call of Duty, Mass Effect, Conker's Bad Fur Day, Diablo III, Last of Us, Metal Gear Solid, Devil May Cry, Crysis 2, Deus EX, Duke Nukem, Grand Theft Auto, Final Fantasy, God of War, Hitman, Kane and Lynch, Twisted Metal, La Noire, Lollipop Chainsaw, Fall Out 3, Max Payne, Mortal Kombat, Red Dead Redemption,  Infamous 2, Heavy Rain, Witcher II, Prototype, Catherine, Splatterhouse, Watch Dogs, Dead Space 2, Homefront, Crackdown, Dead Rising, Shadows of the Damned\n \n","torrent":{"xt":"urn:btih:abf487604e8a4fe2f274f96dfc240203131594ba","amp;dn":"Music+and+Video+Games+That+Want+Your+Soul+%282013+conspiracy+docum","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abf487604e8a4fe2f274f96dfc240203131594ba","infoHashBuffer":{"type":"Buffer","data":[171,244,135,96,78,138,79,226,242,116,249,109,252,36,2,3,19,21,148,186]},"announce":[],"urlList":[]}}