{"title":"Menage Trois","uid":7647984,"size":2172103306,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:ac68da15b23686be326074f691e07d398b13352b&amp;dn=Menage+Trois&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"filmpiraatje","files":13,"time":1347950156,"description":"Menage trois\n\nBiography\n\nMenage is one of the top black starlets working today, churning out one red-hot performance after another in the low-budget quickies that dominate the interracial and black-themed video market. She's got the look of a young Eartha Kitt, with a round, high-cheekboned face, almond-shaped eyes and long straight auburn-tinged hair that cascades well down her back. She's got a lithe a petite little body, small-breasted and oh-so-tight.\n\n\n\nMenage got into hardcore in late 1995 and has wasted no time in becoming one of the hardest-working sexers in the business. \n\n\nShe's appeared in over 60 films in her first year before the cameras alone! Menage has one of the longest tongues you'll see this side of Ripley's Believe It Or Not, and she's used it to work her way into a rep as one of the top oral performers around today. \nCheck out the way she tongue-lashes Santino Lee in 'Black Cheerleader Search #02' for a wondrous introduction to her flabbergasting oral skills.\n\n\n\nMenage is truly insatiable on-camera, taking everything that her partners can dish out and then some. \n\n\n\nOne of her best roles is in a riotous threesome with T.T. Boy and Obsession which moves outdoors and is joined by Julie Rage in the film's hottest sequence. \nShe promises to keep cranking out the hardcore as long as audiences keep watching. We're sure they will be for quite some time\n\n[size=4][align=center][u][i][b]this pack shows 12 movie with Menage \nall in AVI (4:3) size (640x480)\n\n","torrent":{"xt":"urn:btih:ac68da15b23686be326074f691e07d398b13352b","amp;dn":"Menage+Trois","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac68da15b23686be326074f691e07d398b13352b","infoHashBuffer":{"type":"Buffer","data":[172,104,218,21,178,54,134,190,50,96,116,246,145,224,125,57,139,19,53,43]},"announce":[],"urlList":[]}}