{"title":"OmniFormat 11.2","uid":7765031,"size":13796410,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ac92d08dcb96890fd0ba68cc5c75b2396cdb3d68&amp;dn=OmniFormat+11.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"wallpwallpapers","files":2,"time":1351349096,"description":"OmniFormat is a document conversion utility which allows dynamic conversion and image manipulation of over 75 file formats including HTML, DOC, XLS, WPD, PDF, JPG, GIF, TIF, PNG, PCX, PPT, PS, TXT, Photo CD, FAX and MPEG. OmniFormat includes HTML2PDF995, a utility for rapid, quality conversion of HTML to PDF and other formats. HTML2PDF995 may be called from other applications or run from the command line to quietly convert HTML to PDF. OmniFormat supports Optical Character Recognition (OCR). In order to convert image formats to text, the free OmniFormat Optical Character Recognition module must be downloaded from OmniFormat and installed. The OCR Module will process all import formats handled by OmniFormat. It can also extract text from PDF files and be run from the command line.\n\nDigital Rights Management:\nOmniFormat may be used to convert images and documents to rights managed PDF files, using the free Signature995 Standard Encryption Module. Pdf995 Standard Encryption may be downloaded free and uses 128 bit RC4 encryption to restrict users from printing, copying text and images and modifying PDF files. It also uses 128 bit RC4 encryption to password protect PDF files.\n\nOmniformat requires that Pdf995 - also FREE - be installed. Pdf995 is the fast, affordable way to create professional-quality documents in the popular PDF file format. Its easy-to-use interface allows you to create PDF files by simply selecting the &quot;print&quot; command from any application, creating documents which can be viewed on any computer with a PDF viewer.\n\nSimple to use, OmniFormat &quot;watches&quot; a folder for image files. When images are placed into the Watch folder, they are automatically processed. [Note: original files placed in the Watch folder will be deleted.] Processing may include a combination of conversion and image manipulation. OmniFormat may be optionally run as a Windows System Service.\n\nProcessing options include: Size, Rotation, Brightness, Saturation, Hue, Contrast.\n\nOmniFormat may also be used to dynamically convert XML data to any supported output format including PDF. A Microsoft Word file is used as a template to supply layout information. OmniFormat replaces fields in the Word template with values specified in the XML file, and then converts the document to the final format.\n\nInstall:\n\n- run application\n- use keygen","torrent":{"xt":"urn:btih:ac92d08dcb96890fd0ba68cc5c75b2396cdb3d68","amp;dn":"OmniFormat+11.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac92d08dcb96890fd0ba68cc5c75b2396cdb3d68","infoHashBuffer":{"type":"Buffer","data":[172,146,208,141,203,150,137,15,208,186,104,204,92,117,178,57,108,219,61,104]},"announce":[],"urlList":[]}}