{"title":"Luke Nguyen Greater Mekong","uid":9354740,"size":4031526912,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:acab3fbaee5fe0b57bf044625045107ef998d19e&amp;dn=Luke+Nguyen+Greater+Mekong&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"firefox999uk","files":-1,"time":1387200193,"description":"This is The TV Series  Luke Nguyen, Greater Mekong: A Culinary Journey from China to Vietnam  season 1 and 2 \n\nIf you just want the recipe Book search for Greater Mekong uploaded by rochapitomba\n\n\nJoin Luke Nguyen as he journeys down one of Asia's most famous rivers, the Mekong. To tie in with the third instalment of Luke's popular SBS series, The Greater Mekong tells the stories, experiences and recipes from the TV show of the same name. Luke immerses himself in the cultures and communities of the countries he visits, learning stories and histories from each region as well as sampling and recreating local cuisines.\n\nLuke's travels start in China where he explores the centuries-old traditions of the Yunnan Province. His journey takes him to Myanmar where he uncovers some of the country's unique flavours, and then on to Northern Thailand, Laos, Cambodia and finally Vietnam, Luke's homeland and the location of this mighty river's floodplains. The Greater Mekong cookbook contains over 70 recipes that celebrate well-known dishes as well as lesser known regional delicacies. Sample Chargrilled pork grilled in bamboo from Thailand, Steamed lemongrass and dill fish from Laos, Tea-infused sesame dumplings from China or for the more adventurous, Clay-pot cola chicken from Cambodia. With heartwarming stories, breath-taking location photography and stunning images of all the dishes featured in the show, The Greater Mekong is a must-have cookbook that will be treasured and referred to for many years to come.\t\t\n\nEnjoy from the L.O.S","torrent":{"xt":"urn:btih:acab3fbaee5fe0b57bf044625045107ef998d19e","amp;dn":"Luke+Nguyen+Greater+Mekong","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acab3fbaee5fe0b57bf044625045107ef998d19e","infoHashBuffer":{"type":"Buffer","data":[172,171,63,186,238,95,224,181,123,240,68,98,80,69,16,126,249,152,209,158]},"announce":[],"urlList":[]}}