{"title":"Buttman Focused  3","uid":7787825,"size":1464768512,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:ad4abf87808d9040b934db98baa57dc1c12d0771&amp;dn=Buttman+Focused++3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Programsmith","files":-1,"time":1351947783,"description":"one production: 2012\nCountry: United States\nGenre: Anal, Compilation, Big Butts, Toy Play, Gonzo\nDuration: 1:40:24 1:38:32\nEnglish\nDirected by: John Stagliano\nStudio: Evil Angel\nStarring: Kristina Rose, London Keys, Liza Del Sierra, Kelly Divine, Jynx Maze, Amy Brooke, Franceska Jaimes, Kara Price, Jandi Lin, Anita Blue, Briella Bounce, Angel Vain, Cheyenne Jewel, Talita Branda, Bella DellaMorte\n\nDescription: A 'Focused' Perspective Of What You Obsess Over!\nFeaturing Franceska Jaimes London Keyes Briella Bounce, 15 Girls In All!\nJohn 'Buttman' Stagliano is the pioneering inventor of gonzo porn, a sex industry legend who is not afraid to dig deep into his own psyche and explore the compulsions that drive his imagination. In recent years, John has pursued these erotic fixations in his 'Buttman's Stretch Class' series, in which the veteran porn hound's favorite female muses visit his home studio for intimate, instructional episodes of sensational tease and graphic SM play resulting in the expansion of their orifices and minds. For those craving intense focus, he has collected clips from his private adventures for 'Buttman Focused 3,' the latest in John's thematically edited anthologies organized according to kink.\nAs the director himself puts it,'' Focused 'is concentrated porn. Each section is one theme with many different girls; 13 different obsessions. No chitchat. Just the good stuff. ' The user-friendly categories include Wedgie; Camel Toe; Walking Butts; My Nose - Your Crack; Tight Clothes and Ass; Bare Ass and Gapes; Boobs; Buttholes; Pussy Tease; Deep Throat; Pussy Play, Tit Play; and Orgasm. And Buttman's 15 gorgeous stars (Briella Bounce, Kara Price, London Keyes, Franceska Jaimes, Bella DellaMorte, Anita Blue, Cheyenne Jewel, Angel Vain, Amy Brooke, Liza del Sierra, Kelly Divine, Jynx Maze, Kristina Rose, Talita Brandao and Jandi Lin) showcase each of these nasty passions with an eager sensuality that is totally real and unstaged. If you're seeking carefully classified kink, 'Buttman Focused 3' is the best fix for your fetish!\n\nVideo quality: DVDRip\nVideo format: AVI\nVideo codec: XviD\nAudio: MP3\nVideo: 624x352 (1.77:1), 29.970 fps, XviD build 64 ~ 837 kbps avg, 0.13 bit / pixel\nAudio: 48 kHz, MPEG Layer 3, 2 ch, ~ 121.72 kbps avg\n &lt;a href=&quot;\nhttp://imgload.me/img-509507dd40411.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgload.me/img-509507dd40411.html&lt;/a&gt; \n &lt;a href=&quot;\nhttp://imgload.me/img-509507dd4d5d4.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgload.me/img-509507dd4d5d4.html&lt;/a&gt; \n","torrent":{"xt":"urn:btih:ad4abf87808d9040b934db98baa57dc1c12d0771","amp;dn":"Buttman+Focused++3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad4abf87808d9040b934db98baa57dc1c12d0771","infoHashBuffer":{"type":"Buffer","data":[173,74,191,135,128,141,144,64,185,52,219,152,186,165,125,193,193,45,7,113]},"announce":[],"urlList":[]}}