{"title":"The Ed Show 11-7-12.mp4","uid":7806525,"size":199828589,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:aeaca0d7762c629bf52a9c896c7468556ae66d61&amp;dn=The+Ed+Show+11-7-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1352413878,"description":"The Ed Show; November 7, 2012.\n\n The American middle class scored a major victory: there will be four more years for President Obama and no one, not even Fox &quot;News,&quot; can deny it.\n\nEd welcomed E.J. Dionne (Senior Fellow at The Brookings Institution and Washington Post columnist), and Richard Wolffe (Executive Editor of MSNBC.com).\n\nEd also looked at President Obama's historic re-election with John Nichols (Washington Correspondent of The Nation).\n\nThen, voters rejected the right-wing's radical agenda and Republican candidates paid the price for the GOP's war on women. Terry O'Neill, President of The National Organization for Women, weighs in on that.\n\nRepublicans are going to have to deal with the new reality: Tuesday's election came down to demographics. State Sen. Nina Turner (D-OH), and Annette Taddeo (former candidate for U.S. Congress (D-FL)), discussed the new make-up of the American electorate.\n\nThey also paid a special tribute to the worst political prediction of all time.\n\nAnd in the Big Finish, the ground game beat out big money. Leo Gerard (United Steel Workers International President), explained how the &quot;get out the vote&quot; effort won over Citizens United.","torrent":{"xt":"urn:btih:aeaca0d7762c629bf52a9c896c7468556ae66d61","amp;dn":"The+Ed+Show+11-7-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aeaca0d7762c629bf52a9c896c7468556ae66d61","infoHashBuffer":{"type":"Buffer","data":[174,172,160,215,118,44,98,155,245,42,156,137,108,116,104,85,106,230,109,97]},"announce":[],"urlList":[]}}