{"title":"The Ed Show 11-2-12.mp4","uid":7792252,"size":200938614,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:af70cb6861d17b64cd02da4b61dd8cdc2202807c&amp;dn=The+Ed+Show+11-2-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1352053254,"description":"The Ed Show; November 2, 2012.\n\n Just a few days until the election and now have 32 consecutive months of private sector job growth in the US.\n\nFriday's strong jobs report proves President Obama has turned this country around and Republicans can't stand it. Ed welcomed David Cay Johnston (columnist for Reuters, Pulitzer Prize winner and author of &quot;Perfectly Legal&quot; and &quot;Free Lunch&quot;), and  Richard Wolffe (MSNBC Political Analyst), for reaction and analysis.\n\nNo doubt the employment figures are good news for the country and President Obama, but bad news for Mitt Romney and his campaign. Democratic Strategist Bob Shrum looked at the latest numbers.\n\nThen, more problems for Ohio voters. Hurricane Sandy left thousands without power, and over 6,000 voters across the state purged from the rolls. Ed had the details with state Sen.Nina Turner (D-OH) and Judith Browne-Dianis (Co-Director of Advancement Project).\n\nFrom Richard Mourdock to Michele Bachmann, the Tea Party is crashing in Congress. Ed broke down the down the down ballot Republican collapse with Keli Goff (author of &quot;The GQ Candidate&quot; and Political Correspondent for TheRoot.com), and Chris Kofinis (former Campaign Com. Director).\n\nFox and friends tried to politicize a hurricane fundraiser. Ed had the details.\n\nIn the Big Finish, Mitt Romney made a play for Wisconsin, while Scott Walker tried to spin the poll numbers in Romney's favor. John Nichols (Washington Correspondent of The Nation), had the latest from the Badger State.","torrent":{"xt":"urn:btih:af70cb6861d17b64cd02da4b61dd8cdc2202807c","amp;dn":"The+Ed+Show+11-2-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af70cb6861d17b64cd02da4b61dd8cdc2202807c","infoHashBuffer":{"type":"Buffer","data":[175,112,203,104,97,209,123,100,205,2,218,75,97,221,140,220,34,2,128,124]},"announce":[],"urlList":[]}}