{"title":"Antropophagus (1980) [UNCUT] DVDrip","uid":7715397,"size":666202329,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:afb2235757ecafe49b7e6168389292ac17dc6d00&amp;dn=Antropophagus+%281980%29+%5BUNCUT%5D+DVDrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mentaltown72","files":-1,"time":1349916389,"description":"Format: MKV\n\n\nBEHOLD!! The Italian horror classic that made the &quot;Video Nasty&quot; list.\n\n\nA group of tourists arrive on a small Greek island, only to find it almost completely deserted. It seems that the only person still alive there is a blind girl who does not know what has happened to the rest of the island's town, but is terrified of a man who she describes as smelling of blood.\n\nAs members of the group disappear or are brutally and mercilessly murdered by a mysterious, deformed man in various locations on the island, the survivors search for clues as to what is going on. They find a diary inside an abandoned mansion, which tells of a man who was shipwrecked with his wife and child. In order to survive, the man was forced to eat his dead family. This act drove him insane and he went on to slaughter the rest of the island's inhabitants. The disfigured cannibalistic killer goes by the name of Nikos Karamanlis and is known as &quot;The Anthropophagus Beast.&quot;\n\nAlmost the entire group is killed until only a few remain, but one of the survivors manages to overpower him and stab him with a pick axe to the stomach, and before he dies, in one final act of insanity, he attempts to devour himself, by chewing on his own intestines.\n\nIn the film's most notorious scene, the killer strangles a pregnant woman while pulling the fetus from her womb and then devouring it (in reality the fetus was a skinned rabbit covered with fake blood). The effect proved so convincing that the filmmakers were attacked and questioned as to whether they really extracted a human fetus from its mother's womb.","torrent":{"xt":"urn:btih:afb2235757ecafe49b7e6168389292ac17dc6d00","amp;dn":"Antropophagus+%281980%29+%5BUNCUT%5D+DVDrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afb2235757ecafe49b7e6168389292ac17dc6d00","infoHashBuffer":{"type":"Buffer","data":[175,178,35,87,87,236,175,228,155,126,97,104,56,146,146,172,23,220,109,0]},"announce":[],"urlList":[]}}