{"title":"24 - Stagione 6 - DVD Rip ITA - IDN_CREW","uid":6792795,"size":9121223509,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b37e5c296878f1ec3f45fd3ecd53790ee05be9f3&amp;dn=24+-+Stagione+6+-+DVD+Rip+ITA+-+IDN_CREW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Rayden_10","files":27,"time":1320330295,"description":"24 ÃƒÂ¨ una serie tv incentrata su una giornata dell'agente federale Jack Bauer del CTU (una fittizia agenzia governativa anti-terrorismo) di Los Angeles. Bauer ÃƒÂ¨ un agente dai metodi decisamente discutibili, e che spesso si trova ad operare al di sopra delle regole, ma che ÃƒÂ¨ sempre pronto a sacrificarsi e ad agire in prima persona per il bene della nazione.\n\nOgni stagione della serie televisiva racconta una serie di eventi che si svolgono nell'arco di 24 ore (da cui il titolo 24) ognuno dei quali copre un'ora della giornata. Altra caratteristica di 24 ÃƒÂ¨ l'ampio uso dello split screen, ovvero la suddivisione dello schermo in vari riquadri per seguire la contemporaneitÃƒÂ  di piÃƒÂ¹ piani narrativi, fino a confluire su quello principale. Inoltre, ogni stagione presenta piÃƒÂ¹ sottotrame, che hanno inizio e si dipanano quando quella che sembrava la trama principale va ad esaurirsi.\n\nParticolaritÃƒÂ  della serie ÃƒÂ¨ che, dato che ogni stagione di 24 racconta le vicende di un singolo giorno, le stagioni della serie vengono identificate proprio come Giorni (Days). Ogni Giorno ÃƒÂ¨ in pratica una stagione a sÃƒÂ© stante, con una propria linea narrativa, non collegata ad altre stagioni della serie (se non per piccoli riferimenti). In conseguenza di ciÃƒÂ², in 24 c'ÃƒÂ¨ un massiccio e frequente ricambio del cast da una stagione all'altra: l'unico personaggio fisso degli eventi ÃƒÂ¨ proprio il protagonista Jack Bauer.\n\nIl Day 6 inizia alle 06:00, 20 mesi dopo il rapimento di Jack Bauer da parte del governo Cinese. Dopo aver passato 20 mesi in una prigione cinese, Jack Bauer viene finalmente riportato a casa. Presto si accorgerÃƒÂ  che il suo ritorno ÃƒÂ¨ parte di un piano molto piÃƒÂ¹ grande: ottenere la posizione esatta di Hamri Al-Assad, il capo di un'organizzazione terroristica che da undici settimane tiene tutto il paese in una morsa di paura. Nonostante le sue condizioni psicologiche e fisiche Jack accetta di sacrificarsi ma quando si rende conto che ÃƒÂ¨ Abu Fayed, il suo nuovo carceriere, il vero mandante degli attentati si ribella e riesce a fuggire. Ora dovrÃƒÂ  convincere il Presidente degli Stati Uniti d'America Wayne Palmer e il CTU che l'uomo che stanno cercando di eliminare potrebbe essere il solo in grado di fermare gli attentati.","torrent":{"xt":"urn:btih:b37e5c296878f1ec3f45fd3ecd53790ee05be9f3","amp;dn":"24+-+Stagione+6+-+DVD+Rip+ITA+-+IDN_CREW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b37e5c296878f1ec3f45fd3ecd53790ee05be9f3","infoHashBuffer":{"type":"Buffer","data":[179,126,92,41,104,120,241,236,63,69,253,62,205,83,121,14,224,91,233,243]},"announce":[],"urlList":[]}}