{"title":"Elizabeth of York: A Tudor Queen and Her World Alison Weir (mult","uid":9353510,"size":10091990,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b3985a561fc0069fa1baa31055875067ea2cb664&amp;dn=Elizabeth+of+York%3A+A+Tudor+Queen+and+Her+World+Alison+Weir+%28mult&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"7","files":3,"time":1387183836,"description":"Elizabeth of York: A Tudor Queen and Her World (2013) Alison Weir\n\nElizabeth of York: A Tudor Queen and Her World by Alison Weir\n\n\nFormat: mobi/epub/azw3\nLength: 608 pages\nGenre: History\nDate: 7 November 2013\n\nAlison Weir builds an intriguing portrait of this beloved queen, placing her in the context of the magnificent, ceremonious, often brutal, world she inhabited, and revealing the woman behind the myth, showing that differing historical perceptions of Elizabeth can be reconciled.\n\nElizabeth of York would have ruled England, but for the fact that she was a woman. The eldest daughter of Edward IV, at seventeen she was relegated from pampered princess to bastard fugitive, but the probable murders of her brothers, the Princes in the Tower, left Elizabeth heiress to the royal House of York, and in 1486, Henry VII, first sovereign of the House of Tudor, married her, thus uniting the red and white roses of Lancaster and York.\n\nElizabeth is an enigma. She had schemed to marry Richard III, the man who had deposed and probably killed her brothers, and it is likely that she then intrigued to put Henry Tudor on the throne. Yet after marriage, a picture emerges of a model consort, mild, pious, generous and fruitful. It has been said that Elizabeth was distrusted and kept in subjection by Henry VII and her formidable mother-in-law, Margaret Beaufort, but contemporary evidence shows that Elizabeth was, in fact, influential, and may have been involved at the highest level in one of the most controversial mysteries of the age.\n\nNamed one of the Best Books of the Year by The Chicago Tribune.\n\nAuthor:\n\nAlison Weir is the New York Times bestselling author of the novels Innocent Traitor and The Lady Elizabeth and several historical biographies, including Mistress of the Monarchy, Queen Isabella, Henry VIII, Eleanor of Aquitaine, The Life of Elizabeth I, and The Six Wives of Henry VIII. She lives in Surrey, England with her husband and two children.  \n","torrent":{"xt":"urn:btih:b3985a561fc0069fa1baa31055875067ea2cb664","amp;dn":"Elizabeth+of+York%3A+A+Tudor+Queen+and+Her+World+Alison+Weir+%28mult","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3985a561fc0069fa1baa31055875067ea2cb664","infoHashBuffer":{"type":"Buffer","data":[179,152,90,86,31,192,6,159,161,186,163,16,85,135,80,103,234,44,182,100]},"announce":[],"urlList":[]}}