{"title":"Gmail Widgets Full v5.01 Final By bobiras2009","uid":7657205,"size":388905,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:b62b0f50823d73996336eee432a92ef006771e6b&amp;dn=Gmail+Widgets+Full+v5.01+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1348192517,"description":"Follow my uploads here:                     &lt;a href=&quot;\nhttps://forum.suprbay.org/member.php?action=profile&amp;uid=311481&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/member.php?action=profile&amp;uid=311481&lt;/a&gt;    \n\nYou can make requests here:                      &lt;a href=&quot;\nhttps://forum.suprbay.org/forumdisplay.php?fid=4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/forumdisplay.php?fid=4&lt;/a&gt;\n                 \n\n                                By bobiras2009\t\t\n\n\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\nRequirements: 2.3.3 and up\nOverview: Gmail Widgets is the best collection of beautiful homescreen widgets in a variety of sizes that show the number of unread emails and message previews.\n\nUntil Android 3.0, the Gmail app does not come with any widgets. This app fills that gap.\nThe Gmail widget in 3.0 and later versions is unreliable and not customisable.\n\nUnlike some of the other Gmail widgets on Google Play, this app works with the latest version of the Gmail app and is compatible with 2.3 (Gingerbread) and later. It also includes some exclusive widgets for 3.0 (Honeycomb), 4.0 (Ice Cream Sandwich) and 4.1 (Jelly Bean).\n\nReview of an older version on TalkAndroid. http://www.talkandroid.com/100486-get-a ... ore-100486\n\nFeatures\n- Supports push email - updates automatically when new mail arrives (it may not update immediately while you read mails)\n- Previews - shows the first lines of the message in addition to sender and subject (depending on size)\n- Supports different labels (e.g. Priority Inbox, Starred, and custom labels) from several accounts, even on the same widget (unified inbox)\n- Open Gmail or compose a new message quickly from the widget\n- Customisable appearance through themes and icons\n- Many different sizes to choose from, including scrollable, resizable stack and list widgets for newer Android versions\n\nPlease note\n- When you perform actions on your new mail, these may not be reflected immediately, even if you refresh manually. The purpose of these widgets is to notify you of new messages as soon as they arrive.\n- It may take up to 30 seconds for the widget to refresh the first time and after a reboot. During this time it may not look like anything is happening!\n\nWhat's in this version:\nSometimes it is necessary to remove and re-add the widgets after an update!\n5.0: Designed for ICS: improved configuration, redesigned widgets according to the guidelines (Holo theme), made widgets more flexible, many small improvements\n4.2: Added option to show missed calls, updated stack widget, bugfixes\n4.1: Added contact icons to some widgets, ability to filter unified inboxes by label, bugfixes\n4.0: Option to show SMS and emails on the same widget, Polish and Chinese (Taiwan) translations\n\n\n                                By bobiras2009\t\t\n","torrent":{"xt":"urn:btih:b62b0f50823d73996336eee432a92ef006771e6b","amp;dn":"Gmail+Widgets+Full+v5.01+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b62b0f50823d73996336eee432a92ef006771e6b","infoHashBuffer":{"type":"Buffer","data":[182,43,15,80,130,61,115,153,99,54,238,228,50,169,46,240,6,119,30,107]},"announce":[],"urlList":[]}}