{"title":"PREMIUM RUSH Xvid Cam - GLOBE","uid":7624120,"size":1022471868,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b6975e5e94d8ba211717ec0c53b9ebe9a2790ae8&amp;dn=PREMIUM+RUSH+Xvid+Cam+-+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1347393763,"description":"* XVID CAM  * 01H23M05S    * + 1500 Bitrate    * Worked with the Dub plugins\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n* Plot :\n\nWilee (Gordon-Levitt) is a New York City bicycle messenger alongside his ex-girlfriend, Vanessa (Ramirez). Her roommate, Nima (Chung), delivers $50,000 that she has saved for two years to Mr. Leung (O), a Chinese hawaladar, in exchange for a ticket that she must deliver to Sister Chen, buying a place for Nima's son and mother in one of Sister Chen's ships that smuggle people from China to America.\n\nMr. Lin, a local loan shark, learns of the ticket and how whoever returns it to Mr. Leung can collect Nima's money. He then approaches Bobby Monday (Shannon), a gambling-addicted NYPD officer who owes him money, offering to clear Monday's debt if Monday gets him the ticket. Monday begins searching for Nima, who decides to hire Wilee to deliver the envelope with the ticket to Sister Chen at 7 P.M. After Wilee leaves, Nima is confronted by Monday, who coerces her into revealing that Wilee has the ticket and handing over the delivery receipt. After Monday leaves, Vanessa finds Nima, and learns the contents of the envelope.\n\nMonday catches up with Wilee before he leaves the campus where Nima lives and threatens him for the ticket. Wilee escapes and heads to the police station to report Monday, only to find out he's a police officer, and hides in the bathroom, where he opens the envelope and finds the ticket.\n\nAfter he escapes the station, Wilee angrily tells his dispatcher, Raj (Mandvi) that he is returning the package so that someone else can drop it off. Returning to Nima's college, Wilee leaves the envelope, which is picked up by his rival, Manny (Parks). Before Manny picks it up, however, Monday calls the dispatch to redirect the delivery to a different address.\n\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n* GLOBE FILES 2012","torrent":{"xt":"urn:btih:b6975e5e94d8ba211717ec0c53b9ebe9a2790ae8","amp;dn":"PREMIUM+RUSH+Xvid+Cam+-+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6975e5e94d8ba211717ec0c53b9ebe9a2790ae8","infoHashBuffer":{"type":"Buffer","data":[182,151,94,94,148,216,186,33,23,23,236,12,83,185,235,233,162,121,10,232]},"announce":[],"urlList":[]}}