{"title":"Drive SnapShot 1.40.0.16125","uid":7729601,"size":1881104,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b82bafe374b990a0ef6f0b57136db907a690cc98&amp;dn=Drive+SnapShot+1.40.0.16125&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"wallpwallpapers","files":-1,"time":1350306558,"description":"Drive Snapshot creates an exact Disk Image of your system into a file, including the operating system, installed programs, your data and all security attributes - while windows is running and you continue to work. Drive Snapshot it allows you to backup your partition or your hard disk drive and it also can create a disk image of your system. If disaster strikes (a virus, trojan, or hard disk crash), a complete and exact restauration of your system will be possible in only few minutes. The image file can be mounted as a virtual drive, so you can easily restore (or use) single files or directories, using the Windows Explorer, or other program.\n\nKey features:\n* Create Disk Image Backups, while running Windows\n* There is no restart (to DOS) necessary. Never.\n* Continue your work, while the Backup is in progress\n* The new Snapshot technology ensures, that all data are consistent, and reflect the PC's data at the start of backup. There are no difficulties with opened files. Never.\n* This enables a very fast and easy way to backup servers and other computers, that must run 24 hours a day.\n* Easy Use and Restore of single Files or directories\n* Drive Snapshot creates a virtual drive, containing all your drives data. You may use, compare, or restore these files directly from the Disk Image file.\n* This works with any program of your choice, including (of course) the Windows Explorer\n* Complete Restore of a disk in case of Disaster\n* If a disk is restored to it's original state, it will be exactly the same as at the time of Backup - byte for byte.\n* Restoring a system partition will require DOS; other drives can be restored using Windows\n* Compatible to all Windows file systems (FAT16, FAT32, NTFS)\n* Compatible to all Windows RAID Methods\n* Very easy and comprehensive command line interface\n* This makes automation of regular tasks a breeze.\n\nInstall:\n\n- run application\n- use keygen","torrent":{"xt":"urn:btih:b82bafe374b990a0ef6f0b57136db907a690cc98","amp;dn":"Drive+SnapShot+1.40.0.16125","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b82bafe374b990a0ef6f0b57136db907a690cc98","infoHashBuffer":{"type":"Buffer","data":[184,43,175,227,116,185,144,160,239,111,11,87,19,109,185,7,166,144,204,152]},"announce":[],"urlList":[]}}