{"title":"Slow Burn (tv) (DVD) [1986] Eric Roberts","uid":6815717,"size":1707988229,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b8df1749b4d3aa4fb6ab53eb194aa69054096dde&amp;dn=Slow+Burn+%28tv%29+%28DVD%29+%5B1986%5D+Eric+Roberts&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ThorntonWilde","files":8,"time":1321195257,"description":" &lt;a href=&quot;http://bayimg.com/JAkpCaAdo&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/JAkpCaAdo&lt;/a&gt;\n\nSlow Burn (TV 1986) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0091972/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0091972/&lt;/a&gt;\n\nTHIS IS A DVD RIP.  ENGLISH SUBTITLES IN TEXT FILE THAT PLAY IN VLC PLAYER\n\nSlow Burn is a 1986 American television drama film noir presented by Joel Schumacher and directed by Matthew Chapman. Chapman also adapted screenplay from the novel of Arthur Lyons named Castles Burning. Film stars include Eric Roberts, Beverly D'Angelo, Dennis Lipscomb, Raymond J. Barry, Johnny Depp, Anne Schedeen, Emily Longstreth, Henry Gibson and Dan Hedaya.\n\n  Eric Roberts  ...  Jacob Asch  \n  Beverly D'Angelo  ...  Laine Fleischer  \n  Dennis Lipscomb  ...  Ron McDonald  \n  Raymond J. Barry  ...  Gerald McMurty  \n  Anne Schedeen  ...  Mona  \n  Emily Longstreth  ...  Pam Draper  \n  Johnny Depp  ...  Donnie Fleischer  \n  Henry Gibson  ...  Robert  \n  Dan Hedaya  ...  Simon Fleischer  \n  Frank Schuller  ...  Norton  \n  Victoria Catlin  ...  Erica  \n  Edward Bunker  ...  George  \n  Ruth Richards  ...  Mrs. Poulson  \n\nJacob Asch (Roberts) is hired by Gerald McMurty (Barry) to find his ex-wife Laine and their son in Palm Springs. Jacob finds Laine and a teenager named Donnie who may or may not be Gerald's son. He also finds an intricate web of deceit and betrayal that begin to lead to death. He takes it upon himself to unravel the mystery and find out who is killing people and why. Johnny Depp appeared as Donnie Fleischer, the missing insightful rich son of McMurty who only wants to be loved. Film set in Palm Springs.\n\nWhile not a mainstream film, it is, in my view, a highly effective film noir in which Eric Roberts is totally underrated as an actor. (I would qualify him as a much better actor than his sister, Julia, who is overrated, but that's another review...) Roberts plays the down-on-his-luck ex-reporter with the perfect mix of narrative precision and jaded idealism: two ingredients that are part and parcel of any effective film noir. The first-person narration by Roberts enhances the quality of the movie, and keeps us guessing on the real motive behind the crime.\n\nSet in Palm Springs, everything about the setting in the movie progresses slowly as a metaphor for the theme of oppression: Asch (Roberts) is oppressed by his past; the police are oppressed by the rich residents of Palm Springs who treat them as servants; the rich, meanwhile, are oppressed by boredom (watch Johnny Depp's classic performance as the insightful rich kid who only wants to be loved...); the isolation of each character is omnipresent and is further augmented by the heat and isolation of the desert.\n\nThere is an audience for this film if they're looking for a more contemporary version of film noir. While there are elements of the film that might have been tighter, I recommend getting a copy of this film and putting it right between The Big Sleep and Chinatown in your movie library. The film is based on the Arthur Lyons book, CASTLES BURNING\n\n\n","torrent":{"xt":"urn:btih:b8df1749b4d3aa4fb6ab53eb194aa69054096dde","amp;dn":"Slow+Burn+%28tv%29+%28DVD%29+%5B1986%5D+Eric+Roberts","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8df1749b4d3aa4fb6ab53eb194aa69054096dde","infoHashBuffer":{"type":"Buffer","data":[184,223,23,73,180,211,170,79,182,171,83,235,25,74,166,144,84,9,109,222]},"announce":[],"urlList":[]}}