{"title":"[PC] Area 51","uid":7781274,"size":2075433985,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ba489088a9475915cce050a97605f7a1ae6721ba&amp;dn=%5BPC%5D+Area+51&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"psyshit666","files":-1,"time":1351781029,"description":"Area 51 is a first-person shooter survival horror video game that was released in 2005 (2006 in Japan) and it was developed by Midway Studios Austin and published by Midway for the PlayStation 2, Xbox, and Microsoft Windows, and is a loose remake of the 1995 light gun video game of the same name, and was followed in 2007 by the loosely related BlackSite: Area 51. The player controls Ethan Cole, a HAZMAT operative voiced by David Duchovny sent to the Area 51 base to assist in the cleanup of a mutagenic virus.\nArea 51 at first starts out with intense combat where the player has several AI teammates with him (ranging from two to seven most of the time) versus hordes of mutants. Notable among the voice actors are David Duchovny as the player character and main protagonist of the game Ethan Cole, Brian Warner as Edgar the ancient and powerful Grey, Powers Boothe as Major Bridges, and Ian Abercrombie as Dr. Cray.\n\nGAME REQUIRES AN INTERNET CONNECTION, CHECK YOUR FIREWALL PLEASE\n\nKEY &quot;SHOOT&quot; ASSIGNED TO ENTER, CHANGE THAT IN Edit Profiles-&gt;Controls","torrent":{"xt":"urn:btih:ba489088a9475915cce050a97605f7a1ae6721ba","amp;dn":"%5BPC%5D+Area+51","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba489088a9475915cce050a97605f7a1ae6721ba","infoHashBuffer":{"type":"Buffer","data":[186,72,144,136,169,71,89,21,204,224,80,169,118,5,247,161,174,103,33,186]},"announce":[],"urlList":[]}}