{"title":"Porco Rosso[DVD9 Ita Jap sub Ita][Nautilus-bt]","uid":6827637,"size":8002080006,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ba97520c02d27733fbe8886abfff3e38ed8e5053&amp;dn=Porco+Rosso%5BDVD9+Ita+Jap+sub+Ita%5D%5BNautilus-bt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"someuser11","files":39,"time":1321637339,"description":"[center][b][SIZE=16pt][color=blue]Porco Rosso[/color][/SIZE][/b]\n\n[img]http://filmup.leonardo.it/posters/loc/500/porcorosso.jpg[/img]\n\n[b][color=green]~~Scheda~~[/color][/b]\n\nÃ‚Â« Piuttosto che diventare un fascista, meglio essere un maiale Ã‚Â»\n\t\n(Porco Rosso al suo ex commilitone Ferrarin)\n\nPorco Rosso (Kurenai no buta), ÃƒÂ¨ un film d'animazione giapponese del regista Hayao Miyazaki, proiettato per la prima volta in Giappone nel 1992. In Italia ÃƒÂ¨ stato distribuito il 12 novembre 2010.\n\nTitolo originale:  \tKurenai no buta\nNazione:  \tGiappone\nAnno:  \t1992\nGenere:  \tAnimazione\nDurata:  \t94'\nRegia:  \tHayao Miyazaki\nSito ufficiale:  \t \n\nCast (voci):  \tShÃƒÂ»ichirÃƒÂ´ Moriyama, Tokiko Kato, Sanshi Katsura, Tsunehiko KamijÃƒÂ´, Sanshi Katsura, Akemi Okamura\nProduzione:  \tJapan Airlines, Nibariki, Nippon Television Network Corporation, Studio Ghibli, TNNG, Toho Company, Tokuma Shoten\nDistribuzione:  \tLucky Red\nData di uscita:  \t12 Novembre 2010 (cinema)\n\n\n\n[hr]\n[b][color=green]~~Trama~~[/color][/b]\n\n[spoiler=Trama]\nMarco Pagot ÃƒÂ¨ un asso dell'aviazione militare italiana che, in seguito ad un misterioso incidente durante la Prima guerra mondiale, al quale sopravvive miracolosamente, assume per magia l'aspetto di un maiale antropomorfo. Abbandona dunque l'aeronautica e la vita mondana (compreso l'amore per Gina, la bella cantante di un night club allestito su un'isoletta dell'Adriatico e frequentato da contrabbandieri) e si ritira sulla costa dalmata, guadagnandosi da vivere con le taglie poste sui pirati dell'aria che combatte con il suo monoplano dipinto di rosso (da cui il soprannome &quot;Porco Rosso&quot;). La sua abilitÃƒÂ  lo rende ben presto un ostacolo non indifferente per i Pirati dell'Aria, che per contrastarlo formano un'alleanza e ingaggiano un altro asso dell'aviazione, l'americano (Donald Curtis). Con l'aiuto di Donald, che si rivela essere un rivale all'altezza di Marco, i pirati riescono a depredare una lussuosa nave da crociera, quindi Donald raggiunge e affronta Marco che sta dirigendosi a Milano per far riparare il suo aereo. Durante la battaglia, alla quale peraltro Marco non appare interessato, il suo aereo ha un'avaria, venendo crivellato di colpi dal suo avversario che vedendolo precipitare e ritrovando un pezzo del suo aereo lo crede morto e se ne va. In realtÃƒÂ  Marco sopravvive alla battaglia, e con quanto rimane del suo aereo raggiunge la Piccolo SPA di Milano per farlo riparare e potenziare in vista della rivincita contro Curtis.\n\nDal momento che i tre figli del signor Piccolo sono emigrati in America in cerca di lavoro, come pure tutti gli altri uomini e operai che lavoravano nella ditta, la ristrutturazione e progettazione del nuovo aereo vengono affidate alla giovane Fio, nipote del signor Piccolo. Marco all'inizio si mostra recalcitrante, ma di fronte alla determinazione e all'esperienza della ragazzina si lascia convincere, anche se per riuscire a rimettere apposto l'aereo ÃƒÂ¨ costretto a indebitarsi.\n\nDurante la sosta a Milano Marco incontra il suo amico ed ex-camerata Arturo Ferrarin, ora maggiore della Regia Aeronautica, che dopo aver tentato invano di convincerlo a rientrare in aviazione lo informa che i fascisti lo stanno cercando. Sfuggito agli squadroni punitivi Marco lascia Milano con il suo aereo appena riparato assieme a Fio, che lo convince a portarla con sÃƒÂ©.\n\nNel mentre Curtis, donnaiolo e narcisista, cerca di conquistare Gina, dicendole anche che ad Hollywood sono interessati a lei come aspirante attrice, ma la donna risponde che anni addietro ha scommesso con sÃƒÂ© stessa di aspettare una certa persona nel suo giardino privato anche per tutta la vita, e che se quella persona dovesse un giorno presentarsi a lei alla luce del sole allora lei lo avrebbe amato.\n\nCome Porco e Gina ritornano sull'isola-rifugio di Marco, perÃƒÂ², i due vengono assaltati dai pirati, ansiosi di prendersi la loro rivincita nei confronti del Porcellastro. Fio perÃƒÂ² li trattiene, deridendoli e rimproverandoli per aver svenduto il loro orgoglio di aviatori affidandosi ad uno straniero, e convince Curtis a misurarsi in un duello ad armi pari con Marco per l'onore degli aviatori e dell'Italia: se Marco vincerÃƒÂ  Curtis pagherÃƒÂ  i conti in sospeso di Porco Rosso con la ditta Piccolo, se invece perderÃƒÂ  Fio sposerÃƒÂ  Curtis.\n\nIl duello richiama una grande folla ed ÃƒÂ¨ senza esclusione di colpi, ma al momento decisivo la mitragliatrice di Marco si inceppa e quella di Curtis si scarica. I due a quel punto decidono di concludere lo scontro a suon di pugni, e alla fine a vincere ÃƒÂ¨ Marco.\n\nL'arrivo improvviso della regia aeronautica costringe i pirati e gli altri spettatori ad andarsene in tutta fretta; Marco affida Fio a Gina perchÃƒÂ© la riproti &quot;nel mondo della gente rispettabile&quot;, mentre lui e Curtis (che sembra aver notato qualcosa nella faccia del suo avversario) si offrono di fare da esca agli inseguitori per permettere agli altri di scappare.\n\nPassano gli anni. Gina e Fio diventano grandi amiche, e superano insieme il fascismo e la Guerra. L'hotel Adriano gestito da Gina continua ad essere una rinomata meta turistica, frequentato anche dagli ormai anziani Pirati dell'Aria; Curtis, ora diventato un attore, ricorda con nostalgia quell'estate sull'Adriatico. E su come si sia conclusa la scommessa di Gina, Fio risponde agli spettatori che &quot;ÃƒÂ¨ un segreto soltanto nostro&quot;.\n[/spoiler]\n[hr]\n[b][color=green]~~Extra~~[/color][/b]\t\nStoryline e trailer originale\n[hr]\n[b][color=green]~~Trailer~~[/color][/b]\t\n[youtube]SrERkmE6adg[/youtube]\n[hr]\n[b][color=green]~~Cover~~[/color][/b]\t\n[hr]\n\n[hr]\n\n[b][color=green]~~Scheda tecnica del Rip~~[/color][/b]\n[code]\n\nH:\\condivisa\\Anime\\Porco Rosso DVD9\\VTS_01_1.VOB\n   General\n      Complete name : H:\\condivisa\\Anime\\Porco Rosso DVD9\\VTS_01_1.VOB\n      Format : MPEG-PS\n      File size : 1 024 MiB\n      Duration : 23mn 21s\n      Overall bit rate : 6 128 Kbps\n   Video #224\n      ID : 224 (0xE0)\n      Format : MPEG Video\n      Format version : Version 2\n      Format profile : Main@Main\n      Format settings, BVOP : Yes\n      Format settings, Matrix : Custom\n      Format settings, GOP : M=3, N=15\n      Duration : 23mn 21s\n      Bit rate mode : Variable\n      Bit rate : 5 622 Kbps\n      Nominal bit rate : 8 700 Kbps\n      Width : 720 pixels\n      Height : 576 pixels\n      Display aspect ratio : 16:9\n      Frame rate : 25.000 fps\n      Standard : PAL\n      Color space : YUV\n      Chroma subsampling : 4:2:0\n      Bit depth : 8 bits\n      Scan type : Interlaced\n      Scan order : Top Field First\n      Compression mode : Lossy\n      Bits/(Pixel*Frame) : 0.542\n      Stream size : 939 MiB (92%)\n   Audio #189-128\n      ID : 189 (0xBD)-128 (0x80)\n      Format : AC-3\n      Format/Info : Audio Coding 3\n      Format profile : Dolby Digital\n      Mode extension : CM (complete main)\n      Muxing mode : DVD-Video\n      Duration : 23mn 21s\n      Bit rate mode : Constant\n      Bit rate : 192 Kbps\n      Channel(s) : 2 channels\n      Channel positions : Front: L R\n      Sampling rate : 48.0 KHz\n      Bit depth : 16 bits\n      Compression mode : Lossy\n      Stream size : 32.1 MiB (3%)\n   Audio #189-129\n      ID : 189 (0xBD)-129 (0x81)\n      Format : AC-3\n      Format/Info : Audio Coding 3\n      Format profile : Dolby Digital\n      Mode extension : CM (complete main)\n      Muxing mode : DVD-Video\n      Duration : 23mn 21s\n      Bit rate mode : Constant\n      Bit rate : 192 Kbps\n      Channel(s) : 2 channels\n      Channel positions : Front: L R\n      Sampling rate : 48.0 KHz\n      Bit depth : 16 bits\n      Compression mode : Lossy\n      Stream size : 32.1 MiB (3%)\n   Text #189-32\n      ID : 189 (0xBD)-32 (0x20)\n      Format : RLE\n      Format/Info : Run-length encoding\n      Muxing mode : DVD-Video\n      Duration : 23mn 19s\n      Delay relative to video : 1s 960ms\n   Text #189-33\n      ID : 189 (0xBD)-33 (0x21)\n      Format : RLE\n      Format/Info : Run-length encoding\n      Muxing mode : DVD-Video\n      Duration : 23mn 19s\n      Delay relative to video : 1s 960ms\n   Text #189-34\n      ID : 189 (0xBD)-34 (0x22)\n      Format : RLE\n      Format/Info : Run-length encoding\n      Muxing mode : DVD-Video\n      Delay relative to video : 2s 0ms\n[/code]\n[hr]\n[b][color=green]~~Note~~[/color][/b]\nNon sono l'autore del rip e non mi voglio prendere nessun merito al riguardo.\nBanda max 370 kbytes 24/24 7/7 :D\n\n[hr]\n\nVisita il nostro sito http://www.nautilus-bt.org ( Visit our site http://www.nautilus-bt.org )\n\n[/center]","torrent":{"xt":"urn:btih:ba97520c02d27733fbe8886abfff3e38ed8e5053","amp;dn":"Porco+Rosso%5BDVD9+Ita+Jap+sub+Ita%5D%5BNautilus-bt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba97520c02d27733fbe8886abfff3e38ed8e5053","infoHashBuffer":{"type":"Buffer","data":[186,151,82,12,2,210,119,51,251,232,136,106,191,255,62,56,237,142,80,83]},"announce":[],"urlList":[]}}