{"title":"Democracy Now - 17 nov 2011","uid":6825594,"size":449921933,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:bbf1b30153d6b436fba096957c65c8cf0bbff6ef&amp;dn=Democracy+Now+-+17+nov+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1321549179,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Nov 17, 2011\n\n-  National Day of Action Kicks Off Third Month of OWS\n-  95 Arrested at Bank of America in San Francisco\n-  U.S. Establishes Permanent Military Presence in Australia\n-  Obama in Bali for East Asian Summit\n-  U.S. Accused of Weakening International Cluster Ban\n-  U.S. Receives New Bunker-Busting Bombs\n-  Karzai: No U.S. Agreement Without End to Night Raids\n-  Arab League Suspends Syria, Gives Deadline\n-  Gingrich Defends Lucrative Freddie Mac Work\n-  Invoking OWS, SEIU Gives Obama Early Endorsement\n-  Suspect Arrested in White House Shooting\n\n\nSpecial reports\n\n- Occupy Wall Street's National Day Action Launches with Protest at NY Stock Exchange\n\nToday is a national day of action to mark the start of the third month of the Occupy Wall Street movement. Here in New York, organizers have been distributing posters reading &quot;Shut Down Wall Street! Occupy the Subways! Take the Square!&quot; As we broadcast, protesters were marching in various parts of the Financial District in an attempt to block the New York Stock Exchange from opening at 9:30 a.m. Labor organizers are planning protests at dozens of bridges across the country today as part of a campaign to highlight the need for increased spending on the nation's infrastructure. In Portland, protesters are planning to occupy the Steel Bridge. In Seattle, an action will target the Montlake Bridge. In Washington, D.C., protesters will march on the Key Bridge. In New York, a 5 p.m. action is set at the Brooklyn Bridge. The protests come just two days after New York police raided Occupy Wall Street at Liberty Plaza and destroyed the encampment. Protesters have been allowed to return to the park, but without sleeping bags, tents or musical instruments. Democracy Now!'s Ryan Devereaux reports live from Wall Street, where protesters, with help from New York police, blockaded all streets leading to the Stock Exchange. &quot;The plan is for sort of a three-pronged blitz on the Financial District, marches coming from all different directions, and trying to basically swarm the area with people,&quot; Devereaux says. &quot;The NYPD's response has been equally robust. There are police vehicles, officers and barricades on every single street.&quot;\n\n\n- Ex-New York Times Freelancer Natasha Lennard on Quitting the Corporate Media in an Occupy Era\n\nWe speak with former freelancer at the New York Times, Natasha Lennard, who helped the newspaper cover the initial Occupy protests. She was arrested during the Brooklyn Bridge demonstration while reporting on the event. She no longer freelances for the Times and recently wrote a piece for Salon.com titled &quot;Why I Quit the Mainstream Media.&quot;\n\n\n- 84-Year Old Dorli Rainey, Pepper-Sprayed at Occupy Seattle, Denounces &quot;Worsening&quot; Police Crackdowns\n\nPolice departments across the country are coming under criticism for using excessive force against Occupy Wall Street protesters during the past two months. In Seattle Mayor Mike McGinn apologized Wednesday, hours after an 84-year-old retired Seattle school teacher named Dorli Rainey was pepper sprayed in the face during a protest. Photographs of her moments after she was pepper sprayed went viral, showing the chemical irritant and liquid used to treat it dripping from her chin. According to Occupy Seattle organizers, a priest and a pregnant teenager were also pepper sprayed Tuesday night. Dorli Rainey joins us from Seattle. &quot;My problem is not only with police brutality,&quot; Rainey says. &quot;It is with the progressively worse attitude of the police.&quot;\n\n\n- Paramilitary Policing of Occupy Wall Street: Excessive Use of Force Amidst the New Military Urbanism\n\nWe host a discussion on policing and the Occupy Wall Street movement with Chuck Wexler, director of the Police Executive Research Forum, which helped organize calls among police chiefs on how to respond to the Occupy protests, and with Norm Stamper, the former police chief of Seattle, who recently wrote an article for the Nation magazine titled &quot;Paramilitary Policing From Seattle to Occupy Wall Street.&quot; &quot;Trust me, the police do not want to be put in this position. Cities need to ask themselves, is there another way to handle this conflict?,&quot; Wexler says. Stamper notes, &quot;There are many compassionate, decent, competent police officers who do a terrific job day in and day out. There are others who are 'bad apples.' What both of them have in common is that they 'occupy,' as it were, a system, a structure that itself is rotten. I am talking about the paramilitary bureaucracy.&quot; We are also joined by Stephen Graham, author of &quot;Cities Under Siege: The New Military Urbanism,&quot; and by by retired New York Supreme Court Judge Karen Smith, who worked as a legal observer Tuesday morning in New York after the police raided the Occupy Wall Street encampment. &quot;I was there to take down the names of people who were arrested... As I'm standing there, an African-American woman goes up to a police officer and says, 'I need to get in. My daughter's there, I want to know if she is OK.' And he said, 'Move on, lady,' and they kept pushing with their sticks, pushing back and she was crying... he throws her to the ground and starts hitting her in the head,&quot; says Smith. &quot;I walk over and I say, 'Look, cuff her if she's done something, but you don't need to do that.' He said, 'lady, you want to get arrested?' I said, 'Do you see my hat? I'm here as a legal observer.' He said, 'Do you want to get arrested?' and he pushed me up against the wall.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:bbf1b30153d6b436fba096957c65c8cf0bbff6ef","amp;dn":"Democracy+Now+-+17+nov+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbf1b30153d6b436fba096957c65c8cf0bbff6ef","infoHashBuffer":{"type":"Buffer","data":[187,241,179,1,83,214,180,54,251,160,150,149,124,101,200,207,11,191,246,239]},"announce":[],"urlList":[]}}