{"title":"Super Bowl Collections - Super Bowl I-X Disk 5","uid":7727614,"size":1713569078,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:befb87bd71d9c310b504d0bc8d4f07974d2e7088&amp;dn=Super+Bowl+Collections+-+Super+Bowl+I-X+Disk+5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":5,"time":1350256929,"description":"NFL Films Super Bowl Collection: Super Bowl I-X Disk 5\n\n &quot;Live the excitement of the first 10 Super Bowls and the seasons leading up to each big game in this NFL Films 5-disc collector's set loaded with defining highlights, enhanced content and exclusive Super Bowl I-X memorabilia. A must-own for every football fan.&quot;\n\nStarting with the 1967 face-off between Vince Lombardi's Green Bay Packers and Hank Stram's Kansas City Chiefs, relive the magic and excitement of the first 10 Super Bowl championships. The big-name roster includes such legends as Joe Namath, Johnny Unitas, Terry Bradshaw, Bart Starr, Roger Staubach and many more. The many electrifying profiles of star teams, players and coaches will also leave NFL fans cheering. \n\nThis 5-disc collector's set from NFL Films includes a massive compilation of defining football moments, as well as enhanced content and exclusive memorabilia from Super Bowl I-X. Aside from 10 hours of game footage, NFL Films: Super Bowl Collections - Super Bowl I-X also includes interviews with a variety of athletes and coaches, as well as several featurettes. Highlights include the original telecast from Super Bowl I, footage of Bart Starr, Weeb Ewbank, Duane Thomas, and Hank Stram, among many others, as well as the legendary 1966 NFL Championship game, the fledgling stages of Terry Bradshaw's career, coverage of the Dolphins' perfect season in 1972, famous Super Bowl failures, and much more.  \n\n Super Bowls 9 and 10\n\n Emergence of Terry Bradshaw\n Viking's Super Bowl Failures\n Jack lambert-The Ferocious Career\n Roger Staubach-Living Symbol of America's Team\n","torrent":{"xt":"urn:btih:befb87bd71d9c310b504d0bc8d4f07974d2e7088","amp;dn":"Super+Bowl+Collections+-+Super+Bowl+I-X+Disk+5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"befb87bd71d9c310b504d0bc8d4f07974d2e7088","infoHashBuffer":{"type":"Buffer","data":[190,251,135,189,113,217,195,16,181,4,208,188,141,79,7,151,77,46,112,136]},"announce":[],"urlList":[]}}