{"title":"Beginning Windows 8 Application Development[Pdf/ePUB] {BBS}","uid":7736457,"size":45788222,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c1c030a71f680febd3db0032c96988f664635a89&amp;dn=Beginning+Windows+8+Application+Development%5BPdf%2FePUB%5D+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bigbluesea","files":-1,"time":1350497740,"description":"Learn to use exciting new development tools and create applications for Windows 8\n\nIf you're a beginning developer, there's no better place to get up to speed on the Windows 8 SDK than this Wrox guide. A team of Microsoft experts provides a complete course in Windows 8 programming, helping you take full advantage of the innovative new SDK. Written in an easy-to-read style, this book is packed with reusable examples that showcase the endless possibilities of the Windows SDK and also introduces the new Windows 8 app store.\n\nIt explains how to set up the development environment and covers user interface design, using special effects and graphics, working with C# and C++, and much more.\n\n    * Provides a complete introduction to the Windows SDK and Windows 8, starting with setting up the development environment and building your first application\n    * Covers user interface design, touch- and event-driven design elements, leveraging windows-based services, and offline application development with HTML 5\n    * Explores creating C# applications for the Windows 8 system, XNA 4 and Silverlight 5 considerations, and the role of C++\n    * Shows how to debug, certify and deploy your applications\n    * Introduces the new Windows 8 app store and offers advice on marketing your apps\n\nBeginning Windows 8 Application Development is perfect for anyone who's ready to get started developing apps for the exciting new Windows 8 OS.\n\n\n# Paperback: 624 pages\n# Publisher: Wrox; 1 edition (October 2, 2012)\n# Language: English\n# ISBN-10: 1118012682\n# ISBN-13: 978-1118012680\n","torrent":{"xt":"urn:btih:c1c030a71f680febd3db0032c96988f664635a89","amp;dn":"Beginning+Windows+8+Application+Development%5BPdf%2FePUB%5D+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1c030a71f680febd3db0032c96988f664635a89","infoHashBuffer":{"type":"Buffer","data":[193,192,48,167,31,104,15,235,211,219,0,50,201,105,136,246,100,99,90,137]},"announce":[],"urlList":[]}}