{"title":"Spider-Man The Movie Portable - [Espera]","uid":6798710,"size":979774353,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c1ddf17a1bfa15da37e6c033f6e9a31249c67dfd&amp;dn=Spider-Man+The+Movie+Portable+-+%5BEspera%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":3,"time":1320576139,"description":"    //   / /                                            \n   //____     ___      ___      ___      __      ___    \n  / ____    ((   ) ) //   ) ) //___) ) //  ) ) //   ) ) \n //          \\ \\    //___/ / //       //      //   / /  \n//____/ / //   ) ) //       ((____   //      ((___( (   \n\n                     Presents\n\nINSTRUCTIONS\n1.Unrar\n2.Run &quot;Street Racing Battle 1 Click.exe&quot;\n3.Enjoy.\n\nWarning this is a PORTABLE verision of the game.\nAll portable versions brought to you by us may or may not \nwork with x64 versions of Windows.\n\nSpider-Man is an action game based upon the Marvel Comics character, Spider-Man, and is directly based on the first feature film starring the eponymous character. It was developed by Treyarch and released in 2002 for PC and several video game consoles. The game has many scenes and villains that did not appear in the film. It was followed by Spider-Man 2 two years later to promote the release of the second film. Then, in 2007, to promote the release of the third film, Spider-Man 3: The Video Game was released.\n\nPeter Parker develops super-spider powers after being bitten by a genetically altered spider. The game opens with an optional tutorial, narrated by Bruce Campbell, where Peter learns to use his powers and the player learns the controls of the game and how to read the HUD. After competing in a wrestling match as Spider-Man, Peter is devastated when his Uncle Ben is killed by the leader of the Skulls gang. Peter uses his new powers to track down and defeat the murderer. Peter vows to use his powers for good and to fight evil in Manhattan. Meanwhile, Norman Osborn and OsCorp are investigating the appearance of this new hero. Anxious to develop his Human Performance Enhancer &quot;Super-Soldier&quot; Serum, the main goals of which are already exhibited by the super-hero, Osborn orders the capture of Spider-Man, deploying hunter-killer robots for this purpose. Spider-Man fights these robots and emerges victorious. Meanwhile, the Shocker has just robbed a bank, and is driving away with his thugs as Spidey lands, only to be hit by Vulture. Spider-Man goes after Shocker first. His battle with Shocker leads him through Grand Central Station, into the sewers and to a subway station, where Spider-Man defeats him in a climactic battle. Afterward, Shocker tells Spider-Man about Vulture's lair: an old clocktower on the Lower East Side of town. Spider-Man climbs Vulture's tower, but Vulture escapes. Spider-Man defeats Vulture atop the Chrysler Building.\n\nPC System Requirements\nWindows 98 or better\n500 MHz Pentium III or Athlon processor or faster\n128 MB RAM\nDirectX 8.1 plus DirectX compatible 32 MB video card (ATI Radeon 7200 or better/NVidia Geforce 256 or better)\n1GB hard disk space\n4x CD-ROM drive","torrent":{"xt":"urn:btih:c1ddf17a1bfa15da37e6c033f6e9a31249c67dfd","amp;dn":"Spider-Man+The+Movie+Portable+-+%5BEspera%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1ddf17a1bfa15da37e6c033f6e9a31249c67dfd","infoHashBuffer":{"type":"Buffer","data":[193,221,241,122,27,250,21,218,55,230,192,51,246,233,163,18,73,198,125,253]},"announce":[],"urlList":[]}}