{"title":"Im Fadenkreuz des Mossad.mp4","uid":6813865,"size":2061819237,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c2f94d031c43ad67c6a4b8e18589c02782af8e32&amp;dn=Im+Fadenkreuz+des+Mossad.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bilush","files":1,"time":1321125021,"description":"Die Geschichte des Mossad in drei Kapiteln\n\n&quot;Goldas Rache&quot;\nIn den frÃƒÂ¼hen 1970ern richtet sich das Hauptaugenmerk des Mossad auf eine extremistische, palÃƒÂ¤stinensische Terrorvereinigung, bekannt als &quot;Schwarzer September&quot;. Diese Organisation fÃƒÂ¼hrt gewaltsame Aktionen im Zuge des PalÃƒÂ¤stina-Konfliktes durch. Als die Terroristen einen Anschlag auf israelistische Athleten bei den Olympischen Spielen in MÃƒÂ¼nchen verÃƒÂ¼ben und sie dadurch tÃƒÂ¶ten, ordert die Premierministerin Golda Meir Vergeltung an. Agenten des Mossad werden in die ganze Welt in tÃƒÂ¶dlicher Mission ausgesandt.\n\n&quot;Operation Sphinx&quot;\n1972 unterzeichnet der Irak ein Geheimabkommen mit der franzÃƒÂ¶sischen und italienischen Regierung zum Bau eigener Atomkraftwerke. Israel wÃƒÂ¼rde sich nicht gegen einen Nuklearangriff wehren kÃƒÂ¶nnen, welcher die ZerstÃƒÂ¶rung des jÃƒÂ¼dischen Staates zur Folge hÃƒÂ¤tte. Der Mossad schickt Israels Top Guns auf eine todesmutige Mission, die irakische Bedrohung zu zerschlagen und unversehrt nach Hause zurÃƒÂ¼ck zu kehren.\n\n&quot;Unternehmen Entebbe&quot;\nAm 27. Juni 1976 entfÃƒÂ¼hren die Volksfront zur Befreiung PalÃƒÂ¤stinas und die Baader-Meinhof-Gruppe ein Flugzeug der Air France auf dem Flug von Tel Aviv nach Paris und zwingen es, auf dem Flughafen Entebbe in Uganda zu landen. Sechs Tage spÃƒÂ¤ter, nach einem verzweifelten Wettrennen gegen die Zeit, stehen Kommandotruppen des Mossad in den StartlÃƒÂ¶chern, um den Flughafen zu stÃƒÂ¼rmen und die Geiseln zu befreien.","torrent":{"xt":"urn:btih:c2f94d031c43ad67c6a4b8e18589c02782af8e32","amp;dn":"Im+Fadenkreuz+des+Mossad.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2f94d031c43ad67c6a4b8e18589c02782af8e32","infoHashBuffer":{"type":"Buffer","data":[194,249,77,3,28,67,173,103,198,164,184,225,133,137,192,39,130,175,142,50]},"announce":[],"urlList":[]}}