{"title":"Insomnia.2002.BluRay.720p.H264","uid":7745909,"size":646334667,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:c41b94547406a2684bc30f6845c790a9b83792b8&amp;dn=Insomnia.2002.BluRay.720p.H264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"twentyforty","files":4,"time":1350766080,"description":"Two Los Angeles homicide detectives are dispatched to a northern town where the sun doesn't set to investigate the methodical murder of a local teen.\n\nDirected by Christopher Nolan. \n\nStarring Al Pacino, Robin Williams. \n\n***************************************************************************\n\nSaid gazillion times, but worth repeating:\n\n\n&quot;Requests must contain IMDB link. Request must contain valid reason Why do you ask for it and do not go someplace else.\nRe-seed requests must contain link to specific torrent. Request should contain desired file- or frame-size or I will encode in format I choose myself. \nAny type of Requests should be posted in [COMMENTS] section of newest torrents.\nRe-seed request should contain exact time and time-zone you're in. Google. My Time Zone is CET, so do the math before.\nRe-seed time-window is 1 day. If you have slow connection meaning, you cannot finish download in that time-frame, just forget about re-seeding and especially loading of old, dead torrents.\nRe-seed chances are good for single torrents within one year of original day of upload.\nChances for re-seed of Pack-torrents and single TV episodes are slim to none.\nIn short - if I have something (and is physically present) - I would definitely re-seed.\nYou should just ask - nicely, in civilized and aforementioned manner, of course.\nIf you've done something wrong on my torrents - ever - do not bother to ask.\n\nDo NOT bother requesting easily available titles. If I haven't encoded something new and current - I have my reasons for that.\n\nDo NOT request movies which have IMDB score lower than 4.4.\n\nDo NOT request inclusion of TV shows in my uploads. If you are in need for my small-sized TV encodes and if you are long-time regular downloader - send me an e-mail on my gmail (address is twentyforty1) and I might include you in my daily list. In Subject-line put your handle/screen-name as first in order to be recognized.\nRequests for movies and Reseed-requests can be placed on my gmail too.\nDo NOT place Requests on Page 48 or 61, bitching about &quot;no seeds&quot; especially (ask for Reseed) - it is extremely stupid.\n\n\nNOTE: Before making fool of yourself (as lately many did) click  on &quot;Files&quot; (up there, not hidden)  and look what is in the torrent. If you want to see NFO or screen-shots - they are in the torrent. So, either get torrent program or plug-in for one you use with IMG and NFO viewer or - download .jpg and .nfo first and knock yourself out.\n\nOLD or DEAD torrents:\n\nFollow my rules to make nice and proper Re-seed Request, as explained above.\nIn case of old torrents, trackers might be dead by now - then simply load one new torrent of mine and from Properties of that new torrent copy and then paste all trackers in Properties of old torrent.&quot;","torrent":{"xt":"urn:btih:c41b94547406a2684bc30f6845c790a9b83792b8","amp;dn":"Insomnia.2002.BluRay.720p.H264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c41b94547406a2684bc30f6845c790a9b83792b8","infoHashBuffer":{"type":"Buffer","data":[196,27,148,84,116,6,162,104,75,195,15,104,69,199,144,169,184,55,146,184]},"announce":[],"urlList":[]}}