{"title":"Seram Sejuk","uid":7717352,"size":733001728,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c4230f79e1142332df958fe5156de3b9f6e9ed3c&amp;dn=Seram+Sejuk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"firdausBD","files":1,"time":1349967790,"description":"Seram Sejuk mengisahkan seorang penyanyi rock yang ingin membuat video klipnya tetapi mempunyai budget yang ciput. \n\nDalam masa yang sama juga seorang editor saiful yang berusia dalam akhir 20an, yang menyimpan perasaan terhadap seorang rakan setugasnya bernama Ros. Saiful mula merasa cemburu apabila majikannya Che Wan juga turut menaruh minat terhadap gadis tersebut. \n\nKisah-kisah ganjil bermula apabila disatu ketika Saiful telah menjumpai sebuah kalung yang menyimpan seribu misteri. Ros telah menolak pemberian Saiful yang cuba menghadiahkan kalung tersebut kepada beliau. Bermula dari peristiwa tersebut menyebabkan Ros mula dirasuk oleh kuasa dari kalung tersebut dan pekerja-pekerja dipejabat tersebut mula diganggu oleh kuasa jahat yang terdapat pada kalung tersebut.\n\nChe Wan dan Saiful mula dilagakan menyebabkann mereka berdua merasa saling tak puas hati. Kejadian-kejadian misteri yang berlaku telah menyebabkan Saiful dan Che Wan mula tuduh-menuduh antara satu sama lain dengan mengatakan masing-masing memakai ilmu hitam untuk mendapatkan Ros. Dari situlah wujudnya dukun palsu yang cuba mengambil kesempatan atas situasi tersebut. Akhirnya misteri kalung tersebut telah terungkai. \n\nKalung tersebut merupakan kalung pusaka peninggalan pasangan kekasih yang telah dibunuh oleh perompak dan merupakan lambang cinta mereka. Kuasa yang terdapat pada kalung tersebut menggangu mereka. Kuasa kalung lagi merasa marah apabila setelah diambil tetapi tidak dhargai. Akhirnya kalung tersebut dapat dipulangkan ketempat asalnya kembali.\n\nRead more:","torrent":{"xt":"urn:btih:c4230f79e1142332df958fe5156de3b9f6e9ed3c","amp;dn":"Seram+Sejuk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4230f79e1142332df958fe5156de3b9f6e9ed3c","infoHashBuffer":{"type":"Buffer","data":[196,35,15,121,225,20,35,50,223,149,143,229,21,109,227,185,246,233,237,60]},"announce":[],"urlList":[]}}