{"title":"Curse Breakers: Horror Mansion v1.0.3 Android","uid":7772892,"size":24381863,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:c455c6517f3070573130aeeb86a3cf685d483fef&amp;dn=Curse+Breakers%3A+Horror+Mansion+v1.0.3+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":".BONE.","files":1,"time":1351578073,"description":"Do you have what it takes to face the supernatural, the undead, and worse? Take on the role of a Curse Breaker, visit cursed locations around the world in your quest to defeat evil and protect the innocent. On your first job you will be taken to a Haunted Mansion where a family has been torn apart by a cursed crystal ball, it is your job to stop this curse and put an end to the horrors that lurk in every corner.\n\nCurse Breakers: Halloween Haunted Mansion features some of our best graphics and sound effects to date. Be spooked, scared, and horrified by the chilling atmosphere of the Haunted Mansion. Maneuver your way through huge mansion, graveyard and more, each with their own puzzles and mysteries to be solved. An adventure story that will rivet any reader, whether or not he or she has any interest in this subject. Can you break the curse and set the family free?\n\nFeatures:\nIncredible graphics with detailed scenes and objects!\nStunning new sound effects guaranteed to cause a scare!\nMany items to collect, combine and solve puzzles with!\nMultiple puzzles to solve and challenges to complete.\nA dark adventure full of chills and thrills that will have you battle the supernatural and beyond.\nZombies!\nRequired Android O/S : 2.2+","torrent":{"xt":"urn:btih:c455c6517f3070573130aeeb86a3cf685d483fef","amp;dn":"Curse+Breakers%3A+Horror+Mansion+v1.0.3+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c455c6517f3070573130aeeb86a3cf685d483fef","infoHashBuffer":{"type":"Buffer","data":[196,85,198,81,127,48,112,87,49,48,174,235,134,163,207,104,93,72,63,239]},"announce":[],"urlList":[]}}