{"title":"PowerISO 5.4","uid":7773351,"size":7492232,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c84df53bdcb1daef6e598642986be4f11555261f&amp;dn=PowerISO+5.4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"wallpwallpapers","files":2,"time":1351594127,"description":"PowerISO - the program allows you to create, convert, extract, compress, edit and encrypt images of CD / DVD, and open them using the built-in emulator. In PowerISO used compression-decompression technology in real-time image files with the extension of DAA, which significantly reduces the size of image files. Files Images can be cut into pieces of various sizes and in a compressed form to send through e-mail programs or write to other media. Most importantly - files can be used directly without decompressing. It works with all major formats of images: ISO, BIN, NRG, CDI, DAA, MDF, BWI, B5I, LCD, CIF, P01, PDI, NCD, PXI, GI, FCD, VCD, C2D. There is a built-in emulator CD / DVD-drive.\n\nMain Features:\n- Support almost all CD/DVD-ROM image file formats (ISO, BIN, NRG, IMG, DAA and so on).\nNote: DAA (Direct-Access-Archive) is an advanced format for image file, which supports some advanced features, such as compression, password protection, and splitting to multiple volumes. It can be handled directly just like other formats, such as ISO, BIN, ...\n- Supports on-the-fly burning.\n- Supports UDF image file.\n- Create image file from hard disk files or CD/DVD-ROM.\n- Edit an existing image file.\n- Can edit and burn Audio CD image file.\n- Extract files and folders from image file.\n- Convert image files between ISO/BIN and other formats.\n- Make bootable image file, get boot information from bootable image file.\n- Make floppy disk image file.\n- Optimize files to save disk space while saving image files.\n- Mount image file with internal virtual drive. Even if the image file is saved as DAA format, the virtual drive can handle that format directly.\n- Support shell integration, such as context menu, Drag and Drop, clipboard...\n- Supports command-line parameters.\n- Can open XBOX image file.\n- Supports multiple languages","torrent":{"xt":"urn:btih:c84df53bdcb1daef6e598642986be4f11555261f","amp;dn":"PowerISO+5.4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c84df53bdcb1daef6e598642986be4f11555261f","infoHashBuffer":{"type":"Buffer","data":[200,77,245,59,220,177,218,239,110,89,134,66,152,107,228,241,21,85,38,31]},"announce":[],"urlList":[]}}