{"title":"AbyssMedia SiteInFile Compiler v4.0.6.0","uid":7684833,"size":1792165,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:cd5676c99ad50dc7af0576b08f4e532432255103&amp;dn=AbyssMedia+SiteInFile+Compiler+v4.0.6.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"wallpwallpapers","files":-1,"time":1348919023,"description":"Create professional presentations, cd autoruns and eBooks using SiteInFile technology. SiteInFile Compiler compress HTML pages or entire site with all resources (include HTML, CSS, WAV, TXT, JPG, GIF, javascript, PNG, etc.) into a single compact file with built-in browser. All content will be protected from copying (no temporary files during execution!). SiteInFile Wizard will guides you through the process of customizing the publication to suit your requirements.\n\nMain Benefits:\nEasy to Use: you build compact self-extracting E-Books with one click.\nRoyalty Free: There are absolutely no royalties or on-going fees to use the compiler.\nCompatibility: E-Books created using the exact same &quot;engine&quot; as Internet Explorer. This means total compatiblility with the world's most popular web browser including support for HTML, DHTML, images &amp; animations, JPEG and PNG graphics, javascript, VBScript.\nContent Protection: Right-mouse clicking is controlled by your choice of setting in your E-Books. This stop thieves from easily stealing your HTML source. Unlike other E-Books our solution never extract content to temporary folder during viewing.\nCompact and Portable: compiler automatically compresses all your files when compiling E-Books.\nSecurity Options: protect your E-Book with a password or set expiration date.\nCustomizable: you can change application icon, compression level and even User-Agent for built-in browser.\nRich Media Content: Flash, Audio and Video could be embedded in HTML\n\nWith SiteInFile Compiler you can:\nCreate CD Autorun Menu\nPrepare Manuals\nMake Photo Albums\nCreate E-Books\nCompile Off-line websites\nDesign Marketing presentations\nand more...\n\nInstall:\n\n- Run Application\n- Copy crack in install dir and replace it","torrent":{"xt":"urn:btih:cd5676c99ad50dc7af0576b08f4e532432255103","amp;dn":"AbyssMedia+SiteInFile+Compiler+v4.0.6.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd5676c99ad50dc7af0576b08f4e532432255103","infoHashBuffer":{"type":"Buffer","data":[205,86,118,201,154,213,13,199,175,5,118,176,143,78,83,36,50,37,81,3]},"announce":[],"urlList":[]}}