{"title":"Touched_By_An_Angel_Se01_Ep05_The_Hero_DVDRIP_NLSubs","uid":7686225,"size":443336172,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ce341909616bd1c93261b3d45c09cb94d5b7a7f8&amp;dn=Touched_By_An_Angel_Se01_Ep05_The_Hero_DVDRIP_NLSubs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Recon06","files":-1,"time":1348954464,"description":"Touched_By_An_Angel_Se01_Ep05_The_Hero_DVDRIP_NLSubs\n\n\nDe serie draait gewoonlijk rond een persoon of een groep van mensen, die op een zeer beslissend moment in hun leven komen te staan, zoals een groot probleem of een moeilijke keuze. \nOp dat moment komen er engelen in het leven van die persoon, die boodschappen brengen gestuurd door God. Op die manier proberen ze de mensen te helpen en bij te staan in hun problemen. \nMonica, het belangrijkste engelpersonage, leert altijd hoe ze mensen moet bijstaan in hun noden en vragen. \n\nTaal: Engels\nOndertiteling: Nederlands\nGenre: Romance, Drama, Geweld\n\n\n\nEpisode  5\n&quot;The Hero&quot;\nThree years ago, James Mackey defused a tense hostage situation by shooting the gunman who had fatally wounded James's partner. Now Monica is a journalist writing a story about the small-town sheriff and local hero. Although a loving father, Mackey places intense pressure on his son, Matthew so he can gain admission to the U.S. Naval Academy in Annapolis. Rather than risk not doing well, the boy cheats on a college entrance exam but gets caught. Afraid of how his father will react, Matt attempts suicide. While in a coma, Monica uses her angelic powers to talk to him and convince him to live. She later helps Sheriff Mackey resolve his own inner torment, his late partner, Nick Hansen, was the true hero. Mackey had frozen when they confronted the criminals, and Nick saved his life. Monica convinces Mackey that God loves him regardless and is able to reunite father and son...\n","torrent":{"xt":"urn:btih:ce341909616bd1c93261b3d45c09cb94d5b7a7f8","amp;dn":"Touched_By_An_Angel_Se01_Ep05_The_Hero_DVDRIP_NLSubs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce341909616bd1c93261b3d45c09cb94d5b7a7f8","infoHashBuffer":{"type":"Buffer","data":[206,52,25,9,97,107,209,201,50,97,179,212,92,9,203,148,213,183,167,248]},"announce":[],"urlList":[]}}