{"title":"Touched_By_An_Angel_Se01_Ep03_Fallen_Angela_DVDRIP_NLSubs","uid":7686215,"size":415295230,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cee5642895b508e07bc18121f5053c9f81a9b8a4&amp;dn=Touched_By_An_Angel_Se01_Ep03_Fallen_Angela_DVDRIP_NLSubs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Recon06","files":-1,"time":1348954150,"description":"Touched_By_An_Angel_Se01_Ep03_Fallen_Angela_DVDRIP_NLSubs\n\n\nDe serie draait gewoonlijk rond een persoon of een groep van mensen, die op een zeer beslissend moment in hun leven komen te staan, zoals een groot probleem of een moeilijke keuze. \nOp dat moment komen er engelen in het leven van die persoon, die boodschappen brengen gestuurd door God. Op die manier proberen ze de mensen te helpen en bij te staan in hun problemen. \nMonica, het belangrijkste engelpersonage, leert altijd hoe ze mensen moet bijstaan in hun noden en vragen. \nIn de eerste afleveringen van de serie begeleidt Tess Monica bij haar eerste opdrachten, als een sociale werker, nadat ze gepromoveerd is van zoektochten en redding.\n\nTaal: Engels\nOndertiteling: Nederlands\nGenre: Romance, Drama, Geweld\n\n\n\nEpisode  3\n&quot;Fallen Angela&quot;\nMonica learns to overcome her fear of water when she moves next door to Angela Evans, an avid boater with a secretive past. Years ago during college, she supported herself as a call girl. Now that her husband Carter is running for the U.S. Senate, she is being blackmailed by Marshall, her former pimp. Monica convinces Angela to stand up to him, but learns that the ruthless man had taken photographs of her in compromising positions. Rather than tell Carter the truth, she attempts suicide by intentionally sinking her boat in the middle of the lake. Adam, the Angel of Death, cautions Monica not to violate Angela's free will by rescuing her. The resourceful angel shows the woman how her suicide would affect her loved ones, and she chooses to live. Revealing herself after the rescue, Monica admits overcoming her own fear of water when she saw Angela about to drown and encourages her to return home and confide in Carter. Together, the Evans decide to hold a press conference regarding Angela's past, freeing them from the threat of further blackmail.\n","torrent":{"xt":"urn:btih:cee5642895b508e07bc18121f5053c9f81a9b8a4","amp;dn":"Touched_By_An_Angel_Se01_Ep03_Fallen_Angela_DVDRIP_NLSubs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cee5642895b508e07bc18121f5053c9f81a9b8a4","infoHashBuffer":{"type":"Buffer","data":[206,229,100,40,149,181,8,224,123,193,129,33,245,5,60,159,129,169,184,164]},"announce":[],"urlList":[]}}