{"title":"Last.Resort.S01E01.WEB-DL.480p.H264","uid":7646833,"size":202187761,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d01262bd7c59c309ca22d03258a7b1e362e9a3aa&amp;dn=Last.Resort.S01E01.WEB-DL.480p.H264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"twentyforty","files":3,"time":1347928070,"description":"500 feet beneath the ocean's surface, the U.S. ballistic missile submarine Colorado receives their orders. Over a radio channel, designed only to be used if their homeland has been wiped out, they're told to fire nuclear weapons at Pakistan. Captain Marcus Chaplin (Andre Braugher) demands confirmation of the orders only to be unceremoniously relieved of duty by the White House. XO Sam Kendal (Scott Speedman) finds himself suddenly in charge of the submarine and facing the same difficult decision. When he also refuses to fire without confirmation of the orders, the Colorado is targeted, fired upon, and hit. The submarine and its crew find themselves crippled on the ocean floor, declared rogue enemies of their own country. Now, with nowhere left to turn, Chaplin and Kendal take the sub on the run and bring the men and women of the Colorado to an exotic island. Here they will find refuge, romance, and a chance at a new life, even as they try to clear their names and get home. From executive producer/writer Shawn Ryan (The Shield, The Unit, The Chicago Code) and Executive producer/writer Karl Gajdusek comes this dramatic new international action-thriller about treachery, treason, and nuclear brinkmanship. LAST RESORT contemplates establishing of a new society in the modern world, and character becomes everything when unthinkable decisions must be made. \n\nNOTE: Watched last week, as ugly webrip, it is promising series in my opinion.","torrent":{"xt":"urn:btih:d01262bd7c59c309ca22d03258a7b1e362e9a3aa","amp;dn":"Last.Resort.S01E01.WEB-DL.480p.H264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d01262bd7c59c309ca22d03258a7b1e362e9a3aa","infoHashBuffer":{"type":"Buffer","data":[208,18,98,189,124,89,195,9,202,34,208,50,88,167,177,227,98,233,163,170]},"announce":[],"urlList":[]}}