{"title":"The Ed Show 11-3-12.mp4","uid":7794949,"size":222117634,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d05a639fa933ecd9d0fe77bbcaaa18507ab8dacb&amp;dn=The+Ed+Show+11-3-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1352077179,"description":"The Ed Show; November 3, 2012.\n\n Just days until the election and Mitt Romney throws a desperate Hail Mary, taking President Obama's &quot;revenge&quot; comment way out of context and proportion.\n\nIn a special Saturday live broadcast from high atop Democracy Plaza on Rockefeller Center; Ed welcomed Alex Wagner (Host of MSNBC's &quot;NOW with Alex Wagner&quot;), and Michael Steele (Former Chairman of the Republican National Committee and MSNBC Analyst), to weigh in on a huge day on the campaign trail.\n\nOhio is a state of denial for the Romney campaign as surrogates keep trying to spin the polls in their favor.  Democratic Strategist Bob Shrum responded to Karl Rove.\n\nThen, Ohio voters face long lines and power outages in cities across Cuyahoga county. State Sen. Nina Turner (D-OH) had an update on how the Buckeye State is still getting out the vote despite all the obstacles.\n\nFormer President Clinton has been an effective surrogate for President Obama this election season. Could he have an effect on down ballot races as well? Ed asked Joy Reid (Managing Editor of TheGrio.com and MSNBC Contributor).\n\nAnd in the Big Finish, President Obama brought star power to Milwaukee to help lock up the badger state. State Sen. Lena Taylor (D-WI) and Ruth Conniff (Political Editor of The Progressive Magazine), joined Ed for an update on voting in Wisconsin.","torrent":{"xt":"urn:btih:d05a639fa933ecd9d0fe77bbcaaa18507ab8dacb","amp;dn":"The+Ed+Show+11-3-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d05a639fa933ecd9d0fe77bbcaaa18507ab8dacb","infoHashBuffer":{"type":"Buffer","data":[208,90,99,159,169,51,236,217,208,254,119,187,202,170,24,80,122,184,218,203]},"announce":[],"urlList":[]}}