{"title":"Ignite-SKIDROW","uid":6795757,"size":597118200,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d14727955f4652e555821024237c178e2eb1c584&amp;dn=Ignite-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":".Dude.","files":-1,"time":1320444123,"description":"Ignite (c) Nemesys Games\n\n04-11-2011........Release Date\nProtection...............Steam\nRacing...............Game Type\nDisk(s)...................1 CD\n\nRELEASE NOTES\n\nEvery race is different in Ignite. Each race brings something new as\nplayers try to win by using their own tactics. The score system in\nIgnite allows for tactics to be used during a race. Gathering score\nallows the use of nitro in the race and converts to time bonus at the\nend. So short term usage of nitro can help the players get out of\nsituations ahead of the others but using a lot of nitro and thus score\nmay cost him the game. There are different methods of gathering score\n(drafting, hitting objects, drifting) and some cars are more suited for\na method then the other. Choosing the right car for the preferred\nmethod and playing out your strategy will make the player win the game.\n\nFeatures:\n\nSingle and multiplayer game: a 35 races long single player campaign\nplayed at 7 locations. Multiplayer game up to 5 players.\n\n3 Brand new modes of game play:\nRace mode: A new twist to the racing genre: Players can gather score\nand burn it away to get ahead or collect score and jump to the front\nat the end of the race when it is converted into time bonus.\n\nKnock-Out mode: At the end of each lap, the last player gets knocked\nout of the race. Those who remain, get a score bonus.\n\nRun-Out mode: Players start with a set amount of score, but it is\ngradually running out. Players may replenish some of their score with\nstunts or burn some of it away as nitro but if their score runs down\nto zero they lose the game.\n\n3 different types of racing cars: The American muscle, the street and\nthe race cars all have a certain feel which requires different driving\ntechnique.\n\nVarious configuration for each car: All vehicles have different\nsettings which makes them suitable for different races or driving\nstyles.\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy everything from the SKIDROW folder to the game installation\n5. Play the game\n6. Support the companies, which software you actually enjoy \n\nscreens: &lt;a href=&quot;\nhttp://bayimg.com/bAkolaadM&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/bAkolaadM&lt;/a&gt;","torrent":{"xt":"urn:btih:d14727955f4652e555821024237c178e2eb1c584","amp;dn":"Ignite-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d14727955f4652e555821024237c178e2eb1c584","infoHashBuffer":{"type":"Buffer","data":[209,71,39,149,95,70,82,229,85,130,16,36,35,124,23,142,46,177,197,132]},"announce":[],"urlList":[]}}