{"title":"The Return of Sherlock Holmes by Sir Arthur Conan Doyle [republi","uid":7784182,"size":3095089,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d4bbda995df6d1d60816d7e6ffe68310addd77ca&amp;dn=The+Return+of+Sherlock+Holmes+by+Sir+Arthur+Conan+Doyle+%5Brepubli&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"republicV","files":-1,"time":1351854611,"description":"Biographical note\n\nSir Arthur Conan Doyle was an author most noted for his stories about the detective Sherlock Holmes, which are generally considered a major innovation in the field of crime fiction, and for the adventures of Professor Challenger. He was a prolific writer whose other works include science fiction stories, historical novels, plays and romances, poetry, and non-fiction.\n\nContents\n\nThe Adventure of the empty house -- The adventure of the Norwood builder -- The adventure of the dancing men -- The adventure of the solitary cyclist -- The adventure of the priory school -- The adventure of Black Peter -- The adventure of Charles Augustus Milverton -- The adventure of the six Napoleons -- The adventure of the three students -- The adventure of the golden pince-nez -- The adventure of the missing three-quarter -- The adventure of the Abbey Grange -- The adventure of the second stain\n\nSummary\n\nHaving left Sherlock Holmes apparently deceased at the conclusion of The Final Problem (in The Memoirs of Sherlock Holmes), we now find that he is alive after all! In this collection, first published in 1905, the great detective causes Watson to faint (The Empty House), demonstrates that cryptography is elementary (The Dancing Men), and gets engaged (Charles Augustus Milverton).","torrent":{"xt":"urn:btih:d4bbda995df6d1d60816d7e6ffe68310addd77ca","amp;dn":"The+Return+of+Sherlock+Holmes+by+Sir+Arthur+Conan+Doyle+%5Brepubli","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4bbda995df6d1d60816d7e6ffe68310addd77ca","infoHashBuffer":{"type":"Buffer","data":[212,187,218,153,93,246,209,214,8,22,215,230,255,230,131,16,173,221,119,202]},"announce":[],"urlList":[]}}