{"title":"Circadian Rhythm - Pepper St","uid":9356866,"size":112897435,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d4e8445ee3eac375e704bbb538fc8fd1143d7e0b&amp;dn=Circadian+Rhythm+-+Pepper+St&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cdaek","files":-1,"time":1387228655,"description":"This is the start of what we're hoping is an awesome project. We hope you all enjoy listening to what we've done so far. The full album is to come this Winter. After the release of the self titled EP in early January 2013, the band got to work on finishing the writing and recording for the full length LP, paying homage to the place where all of the magic first started, Pepper St. \nThe band was formed in early 2006 with Craig William on guitar and John Buonomo on bass. In 2007 the band was put on hiatus but in 2010 Craig joined a local alternative band, where he met CR's current drummer, Jay Northrop and after some time had John coming in to do the bass work. In the summer of 2012, the project was disbanded and it was then that Craig and John decided that it was time to start writing some of their own tunes again and that Circadian Rhythm should be revived. \nAfter months of going through band members trying out drummers, singers, and guitarists to try and help fill the gaps and see what the band's sound would be, it was decided that Craig would take the helm of doing the vocals for the band. Shortly thereafter, guitarist James Ryan was called in to join the band and it wasn't too long after that Craig and John saw the return of Jay behind the drum kit. \nNow the band stands almost a year later with the upcoming release of Pepper St.. The album offers everything from crushing hard riffs, to smooth jazz and funk influenced tones to enormous soundscapes created by a variety of different ambient textures, thus lending itself to a whole assortment of music lovers and audiophiles. \n2014 is proving to be one of the biggest years for the band yet seeing as the release of the album will have many show dates and possible tours attached to it. Stay tuned and keep your eyes (and ears) peeled to see if Circadian Rhythm is coming to a city near you!\ncredits\nReleased 14 December 2013 \nNick Belmore at Dexter's Lab \nBrad Boatright at Audiosiege \nSarah A. and Cody B.","torrent":{"xt":"urn:btih:d4e8445ee3eac375e704bbb538fc8fd1143d7e0b","amp;dn":"Circadian+Rhythm+-+Pepper+St","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4e8445ee3eac375e704bbb538fc8fd1143d7e0b","infoHashBuffer":{"type":"Buffer","data":[212,232,68,94,227,234,195,117,231,4,187,181,56,252,143,209,20,61,126,11]},"announce":[],"urlList":[]}}