{"title":"POtHS - Conspiracy - 002 - Riddles in Stone - History of The USA","uid":7676399,"size":4119021441,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d4f4579a0c91d625e60dca743e2323ef06583719&amp;dn=POtHS+-+Conspiracy+-+002+-+Riddles+in+Stone+-+History+of+The+USA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"POtHS11","files":-1,"time":1348705490,"description":" PO t HS\n\nPouring Out the Holy Spirit\n\n\n\n&quot;C  O  N  S  P  I  R  A  C  Y&quot;\n\nVolume 002\n\nRiddles In Stone - History of The USA\n\nPOtHS - Conspiracy - 002 - Riddles In Stone - History of The USA - 3 &amp; 4 of 5\n\n\nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long.\n\n\nPOtHS Comment:  These are outstanding Films if you want to know why America and This World is so Messed up.\n\n\nDiscription:   Storyline\n\nThis documentary explores the highly controversial subject of the design of America's capital. Was the city built to reflect the majesty of America's newfound freedom? Or the hidden agenda of secret societies? With every major cornerstone laid by Freemasons, was the city built in a Masonic pattern? Embark upon this incredible journey as Riddles in Stone interviews experts on both sides of the heated debate. Watch as Freemason apologists defend some of the most direct and hard-hitting questions concerning the influence of Masonry in America, and its symbolism in Washington, D.C. Alongside them are leading researchers who maintain that occult architecture permeates the city, and conceals a secret agenda. Was D.C. laid out according to the pattern of the stars? Is there really a pentagram in the street layout north of the White House? Does a Masonic square and compass extend from the Capitol building to the Washington monument... Written by Christian J. Pinto  \nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\n\n \nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n                                             \n\n      :thankyou:    :thankyou:     Thank You JESUS  \n\n  ","torrent":{"xt":"urn:btih:d4f4579a0c91d625e60dca743e2323ef06583719","amp;dn":"POtHS+-+Conspiracy+-+002+-+Riddles+in+Stone+-+History+of+The+USA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4f4579a0c91d625e60dca743e2323ef06583719","infoHashBuffer":{"type":"Buffer","data":[212,244,87,154,12,145,214,37,230,13,202,116,62,35,35,239,6,88,55,25]},"announce":[],"urlList":[]}}