{"title":"Born In Flames (1983)","uid":7777894,"size":734207696,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d72afa1b9478f49f087644a39973973f3de09880&amp;dn=Born+In+Flames+%281983%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"loninappleton","files":2,"time":1351701180,"description":"Born In Flames (1983)\nA film by Lizzie Borden\n\n\nThis film has previously circulated in torrents on a site which I use but is not very well known.  It has since lapsed and I have brought it back as a new torrent.\n\nBorn In Flames appeared as a torrent during the beginning of the Occupy Movement which I do not feel was coincidental.  While this is not a &quot;Wild In The Streets&quot; style depiction of what a youth takeover would look like, Lizzie Borden places the action after the takeover.\n\nThe use of radio is particularly telling for me.  Radio is the most democratic medium and remains so today in spite of hand held devices.  Everybody has a radio.  And in developing countries or radical societies, control of the radio  -- the free airwaves, means that the message is not restricted to expensive tools.  But this is hardly the main subject of the film.  It is, however an important detail as you can see in the IMDB detail.\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0085267/plotsummary&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0085267/plotsummary&lt;/a&gt;\n\nHere is the IMDb description:\n\n&quot;Set ten years after the most peaceful revolution in United States history, a revolution in which a socialist government gains power, this films presents a dystopia in which the issues of many progressive groups - minorities, liberals, gay rights organizations, feminists - are ostensibly dealt with by the government, and yet there are still problems with jobs, with gender issues, with governmental preference and violence. In New York City, in this future time, a group of women decide to organize and mobilize, to take the revolution farther than any man - and many women - ever imagined in their lifetimes. \n\nWritten by Gary Dickerson &quot;\n\nThanks Gary\n\n--\n\n\nNotes written June 11 2012\n\n","torrent":{"xt":"urn:btih:d72afa1b9478f49f087644a39973973f3de09880","amp;dn":"Born+In+Flames+%281983%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d72afa1b9478f49f087644a39973973f3de09880","infoHashBuffer":{"type":"Buffer","data":[215,42,250,27,148,120,244,159,8,118,68,163,153,115,151,63,61,224,152,128]},"announce":[],"urlList":[]}}