{"title":"Up with Chris Hayes 9-22-12.mp4","uid":7666132,"size":389129481,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d776a39b464b022a33b8d883d51c62c43b5be46b&amp;dn=Up+with+Chris+Hayes+9-22-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"liberal42","files":-1,"time":1348443474,"description":"Up with Chris Hayes; Saturday, September 22, 2012.\n\nOn Up with Chris Hayes, they be discussed what is looking more and more like Mitt Romney's worst week ever in his presidential campaign. The latest national poll shows him seven points behind President Obama. His comments on the 47 percent of Americans who don't pay income taxes have become infamous. And his 2011 tax returns show that he and his wife, Ann, purposely limited their charitable deductions in order to bring their effective tax rate up to 14.1 percent. Plus, they moved from the national political scene into the down-ballot races and discussed the latest polls suggesting a dramatic turn to Democratic congressional candidates across the country.\n\nJoining Chris Saturday were:\n\nJohn Nichols, Washington correspondent for The Nation and associate editor of Wisconsin's Capital Times.\n\nL. Joy Williams (political strategist and founder LJW Political Stategies, co-host of radio show &quot;This Week in Blackness&quot;).\n\nAna Marie Cox, (columnist for The Guardian and founder of the political blog Wonkette).\n\nKevin Williamson (deputy managing editor of The National Review).\n\nCharlies Pierce (contributing writer for Esquire, lead writer for the magazine's politics blog.)\n\nDemocratic congressional candidate for Iowa's 4th district Christie Vilsack (former teacher and First Lady of Iowa.)\n","torrent":{"xt":"urn:btih:d776a39b464b022a33b8d883d51c62c43b5be46b","amp;dn":"Up+with+Chris+Hayes+9-22-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d776a39b464b022a33b8d883d51c62c43b5be46b","infoHashBuffer":{"type":"Buffer","data":[215,118,163,155,70,75,2,42,51,184,216,131,213,28,98,196,59,91,228,107]},"announce":[],"urlList":[]}}