{"title":"POtHS - SIN-ister Secrets - 94 - Hell Fire Club Britains Superso","uid":7721818,"size":3364901031,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d84bf2a561f780d52470c74522e9e2be197e62fc&amp;dn=POtHS+-+SIN-ister+Secrets+-+94+-+Hell+Fire+Club+Britains+Superso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"POtHS11","files":-1,"time":1350089608,"description":"POtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - SIN-ister Secrets - 94 - Hell Fire Club - Britains Super Soldiers and Human Cloning\n\n\n\nPOtHS Comment: The Title is Self Explanatory\n\n\nDescription:\n\nThe Hell Fire Club - Descent Into Darkness - Anthony J Hilder:\nChild Molestation, Murder, Mystery and Mayhem in the Hell Fire Club in West Wycombe near London in the 1700s. Keeping the facade of Christian worship in an above ground Church Sir Francis Dashwood and Benjamin Franklin below ground practice the worship of debauchery, rape, and murder. The specter of Satanic practices and worship goes on to this day in Bohemian Grove and the Skull and Bones where Americas leaders are nourished and indoctrinated with the Luciferian Doctrine. . Though the Hell Fire Clubs members are long gone....The practices still carry on with New World Orderites in The Bohemian Grove before the Owl of Moloch and in the tomb of Skull and Bones at Yale University.\n\nBases 7 Britain's Supersoldiers - MK-Ultra Mind Control:\nThe final DVD version of Bases 7 on the Supersoldier program in the UK. Thanks to Dave's brave witness statement a whole batch of victims and witnesses have come forward, see AMMACH Witness statements.AMMACH Project Conference is on Aug31st,Sept 2nd Britannia Hotel Nottingham\nHighly Disturbing allegations and claims involving Ritual Child Abuse, Aliens, Mind Control, UFOs, Secret bases in Somerset. Super Soldiers, MI6 and more..RAF in the Project Monarch Program.\nThe Orkney Child Abuse Scandal is detailed.\nInvolves physical creature implants that move in the body, and radiate RF \n\nDiscovery Channel's Human Cloning:\nWe've cloned sheep, mice, dogs and more. So are humans next? Bioethicists talk about the prospect of human cloning and there's one doctor with such pursuits.  \n\n\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nThese Torrents are currently on a Free Leech --  High Speed Server\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n\n                                           \n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n\n\n","torrent":{"xt":"urn:btih:d84bf2a561f780d52470c74522e9e2be197e62fc","amp;dn":"POtHS+-+SIN-ister+Secrets+-+94+-+Hell+Fire+Club+Britains+Superso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d84bf2a561f780d52470c74522e9e2be197e62fc","infoHashBuffer":{"type":"Buffer","data":[216,75,242,165,97,247,128,213,36,112,199,69,34,233,226,190,25,126,98,252]},"announce":[],"urlList":[]}}