{"title":"NFL Patriots vs Titans HDTV 2012-09-09 720p AVCHD-SC-SDH","uid":7617576,"size":4931291619,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:daa27d5a9001a2bda07c85679428214f05a37f56&amp;dn=NFL+Patriots+vs+Titans+HDTV+2012-09-09+720p+AVCHD-SC-SDH&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SCSA420","files":-1,"time":1347244008,"description":"StoneCold420 presents another High Quality 720p H264 AVCHD release for the NFL fans around the world here exclusively on ThePirateBay.se and KickAss Torrents.\n\n\nNFL Patriots vs Titans HDTV 2012-09-09 720p AVCHD-SC-SDH\n\n\nNew England Patriots vs Tennessee Titans\nLP Field Stadium\nNashville, TN\nSeptember 9, 2012\n\n\nPlease see the .nfo file for more information\n\nSCREENSHOTS ARE HERE: &lt;a href=&quot; http://bayimg.com/PaCnKaaEA&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bayimg.com/PaCnKaaEA&lt;/a&gt;\n\n\nNew England Patriots \nvs \nTennessee Titans\n\n\nJim Nantz and Phil Simms calls the action for this 1st New England Patriots game of the 2012 season.\n\n\nThis is SDH release #802 for the NFL fans from a NFL fan. First aired and captured in H264 AVCHD at 8,000 kbps from the 16:9 widescreen 1920 x 1080i HD source on 09/09/2012 on the CBS HD channel on DirecTv HDTV Digital Satellite then converted to 16:9 widescreen 1280 x 720p resolution Framerate is 59.940 with an average Video Bitrate of 5,000 kbps in a High Quality 4.59 GB 720p H264 AVCHD Blu-Ray MKV release with 48khz 384 kbps AAC 2 channel stereo audio show runtime 2 Hours 12 minutes 20 seconds\n\nThis is my 67th official 720p H264 AVCHD-SC-SDH release. Enjoy the NFL Football Game of the New England Patriots vs Tennessee Titans NFL fans. \n\nI have split this release into 2 parts less then 4 GB each so that they can be played back on Playstation 3, Xbox 360, iPhone, iPad, and Samsung Galaxy S III smartphones. Part 1 is 2.26 GB and Part 2 is 2.32 GB. This release is in H264 AVCHD MP4 format with AAC 2 channel stereo audio. This release is playable with VLC player as well as Media Player Classic, Windows Media Player, and any other devices capable of playing 720p HD MP4 video files with AAC 2 channel stereo audio.\n\nIf you want this show in MKV format it is easy to convert it from MP4 to MKV using MKVtoolnix 2.2.0 (MKVmerge 2.2.0) which you can download from here: http://www.bunkus.org/videotools/mkvtoolnix/win32/mkvtoolnix-2.2.0-setup.exe\n\nHere's how to do it: Download and install MKVMerge (Use link above). It is a free program that allows you to take video and audio files and convert them into MKV files on the fly, making it a very quick conversion.\n\nOpen MKVMerge on your computer, and you will be greeted by its home menu. Click the &quot;Add&quot; button that is near the top of the program, and a new window will appear giving you access to your computer's files. Locate your MP4 video and select it. Press &quot;Open,&quot; and it will load into MKVMerge.\n\nPress the &quot;Browse&quot; button at the bottom of the program, and a window will appear. Locate a place on your computer to save the new MKV file after it is created. Once you have found a place, click &quot;Save&quot; to save the location. Click the &quot;Start Muxing&quot; button at the bottom of the program and your MKV file will be created. Depending on the size of the file, it could take a few minutes. Once it is finished locate the MKV file after the program congratulates you on the conversion and play it as you would any other video file.\n\n\nEnjoy the New England Patriots vs Tennessee Titans NFL fans and thanks for downloading my NFL Patriots vs Titans HDTV 2012-09-09 720p AVCHD-SC-SDH release. Enjoy the show!!!\n\nUploaded by SCSA420 on ThePirateBay.se and KickAss Torrents\n\nStoneCold420 \nSmackDownHotel\nSeptember 9, 2012\n\nFor 2012 SDH releases from 2012-03-29 onward please check here:  &lt;a href=&quot;\nhttp://thepiratebay.se/user/SCSA420&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/SCSA420&lt;/a&gt; or go here:","torrent":{"xt":"urn:btih:daa27d5a9001a2bda07c85679428214f05a37f56","amp;dn":"NFL+Patriots+vs+Titans+HDTV+2012-09-09+720p+AVCHD-SC-SDH","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"daa27d5a9001a2bda07c85679428214f05a37f56","infoHashBuffer":{"type":"Buffer","data":[218,162,125,90,144,1,162,189,160,124,133,103,148,40,33,79,5,163,127,86]},"announce":[],"urlList":[]}}