{"title":"POtHS - Biblical Times - 05 - Moses","uid":7770998,"size":4862342013,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dacd576ea5f4c4c2400f08ab1b2d0d82cc47c514&amp;dn=POtHS+-+Biblical+Times+-+05+-+Moses&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":58,"time":1351529703,"description":"\nPOtHS\nPouring Out the Holy Spiritruth\n\n\nBiblical Times\n\n\n\n\n\nPOtHS - Biblical Times - 05 - Moses\n\n\n\nPOtHS says: This is one of the Best Bible Movies I have seen. Ben is outstanding.\n\nDescription:\n\n\nAcademy Award-winner Ben Kingsley (Gandhi) is MOSES in this awe-inspiring tale of an ordinary man called upon by God to become a great leader.\n\nMoses is awe-struck when God, in the form of a burning bush, calls him to guide the Israelites out of bondage. The reluctant leader and his flock begin the treacherous journey to the Promised Land. However, Pharaoh intends to stop the exodus and with his brutal army traps the Israelites by the banks of the Red Sea. Yet these Israelites are God's chosen people, and the waters part, allowing their safe passage. Moses continues the chronicle of the pilgrimage to Canaan, through the life of this amazing leader and the many miracles God bestowed. MOSES is the fourth in a collectible series of Turner Original films based on Old Testament stories.\n\nAlso: The Five Books of Moses.\n\n--------------------------------------------------------------\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nThese Torrents are currently on a Free Leech --  High Speed Server\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n\n                                           \n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n","torrent":{"xt":"urn:btih:dacd576ea5f4c4c2400f08ab1b2d0d82cc47c514","amp;dn":"POtHS+-+Biblical+Times+-+05+-+Moses","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dacd576ea5f4c4c2400f08ab1b2d0d82cc47c514","infoHashBuffer":{"type":"Buffer","data":[218,205,87,110,165,244,196,194,64,15,8,171,27,45,13,130,204,71,197,20]},"announce":[],"urlList":[]}}