{"title":"Walk the Line(2005)DVDRip.AC3(ENG)-DROCK","uid":6804527,"size":733256704,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dae25381e8dd9e23ba7a05fd01c59430b29189fa&amp;dn=Walk+the+Line%282005%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"drock232","files":-1,"time":1320806236,"description":"James Mangold's Walk the Line tells the life story of country music legend Johnny Cash (Joaquin Phoenix), focusing primarily on the long courtship he had with June Carter (Reese Witherspoon). The film is structured as an extended flashback opening with Cash readying to take the stage at his historic Folsom Prison Concert. The film touches on his childhood, relating a horrific early incident from his life and establishing the troubled relationship he would have with his father (Robert Patrick). Cash joins the military and leaves home. During his time in the armed services he begins writing songs and romances a hometown girl (Ginnifer Goodwin). After the end of his duty he settles down and attempts to begin a music career, but his wife has trouble adjusting to his dreams. Cash auditions for Sam Phillips (Dallas Roberts), signs to Sun Records, and soon finds himself on tour with a roster of young soon-to-be legends that includes Elvis Presley (Tyler Hilton) and Jerry Lee Lewis (Waylon Malloy Payne). On this tour he meets June Carter, the daughter of the famous Carter family, and they take a liking to each other, although she refuses any serious advances from him. Cash gains world-wide fame thanks in part to the inspiration he gets from June, but eventually his marriage crumbles and he develops a serious drug addiction. The film is based on Cash's autobiographies. Phoenix and Witherspoon performed all of their own singing in the movie, just as Sissy Spacek and Beverly D'Angelo did in Coal Miner's Daughter a quarter-century before.\n\nRipped with Handbrake.\n\nLength: 2 Hours 15 Minutes\n\nFile Type: MP4\n\nFrame Width: 624\n\nFrame Height: 352\n\nFrame Rate: 29fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:dae25381e8dd9e23ba7a05fd01c59430b29189fa","amp;dn":"Walk+the+Line%282005%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dae25381e8dd9e23ba7a05fd01c59430b29189fa","infoHashBuffer":{"type":"Buffer","data":[218,226,83,129,232,221,158,35,186,122,5,253,1,197,148,48,178,145,137,250]},"announce":[],"urlList":[]}}