{"title":"Smokin' Guns","uid":7696342,"size":409494295,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:daefda05416dc76858362f72376a340004e65c92&amp;dn=Smokin%27+Guns&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"CCnOSnBT","files":-1,"time":1349373187,"description":"The Smokin' Guns game started its life under the name of Western Quake. It was originally developed by a team known as Iron Claw Interactive. They released WQ3 beta 2.0 in 2003, after which development all but ceased. In May 2005, development of Western Quake was taken over of by a bunch of cowboys calling themselves The Smokin' Guns with the blessings of the former team. With the release of the stand alone version in 2008, the game was renamed to Smokin' Guns, and the team to Smokin' Guns Productions. Throughout this manual, anytime you see the word &quot;we&quot; it should be noted that &quot;we&quot; refers to one or the other (or both) teams.\n\nSmokin' Guns is intended to be a semi-realistic simulation of the &quot;Old West's&quot; great atmosphere and was developed on Id Software's Quake III Arena Engine.\n\nThis total conversion includes completely new weapons created with historically correct information about damage, rate of fire, reload time, etc. It also includes new gametypes and maps inspired mostly byAnd to increase the feeling of a &quot;gunslingers atmosphere&quot; we also created music tracks and sounds adapted to this time period.\n\nHere's a list of some of the most important features of Smokin' Guns:\n\n* A full arsenal of weapons with historically correct design. Check the weapons page for more information.\n* A variety of western styled maps and player models.\n* A realistic damage system with different locations (head, chest, neck, etc) and height-dependant falling damage.\n* New western styled gametypes for more fun: Bank Robbery and Duel Modes.\n* A money system allowing for equipment purchase with money from rewards &amp; pickups.\n* Easy to use graphical user interface and HUD.\n* Other small improvements for better gameplay and enhanced fun.\n\nYou can also find news on continued development and newer files on the official website located at \n &lt;a href=&quot;\nhttp://www.smokin-guns.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.smokin-guns.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:daefda05416dc76858362f72376a340004e65c92","amp;dn":"Smokin%27+Guns","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"daefda05416dc76858362f72376a340004e65c92","infoHashBuffer":{"type":"Buffer","data":[218,239,218,5,65,109,199,104,88,54,47,114,55,106,52,0,4,230,92,146]},"announce":[],"urlList":[]}}