{"title":"Barack Obama is a Global Disappointment!.rar","uid":7637219,"size":1008425,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dcee2fcb46d3062b4e5438915d4c83d0284b5d7a&amp;dn=Barack+Obama+is+a+Global+Disappointment%21.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"wonderwang","files":-1,"time":1347677994,"description":"\nDear President Obama:\n\nYou are the thirteenth President under whom I have lived and unlike any of the others, you truly scare me.\n\nYou scare me because after 46 months of exposure, I know nothing about you.\n\nYou scare me because I do not know how you paid for your expensive Ivy League education and your upscale lifestyle and housing with no visible means of support.\n\nYou scare me because you did not spend the formative years of youth growing up in America, and culturally you are not an American.\n\nYou scare me because you have never run a company or met a payroll.\n\nYou scare me because you have never had military experience, and thus don't understand it at its core.\n\nYou scare me because you lack humility and class, always blaming others.\n\nYou scare me because for over half your life you have aligned yourself with radical extremists who hate America and you refuse to publicly denounce these radicals who wish to see America fail.\n\nYou scare me because you are a cheerleader for the &quot;blame America&quot; vrowd and deliver this message abroad.\n\n\nYou scare me because you want to change America to a African style country where the government sector dominates instead of the private sector.\n\nYou scare me because you want to replace our health care system with a government controlled one.\n\nYou scare me because you prefer windmills to responsibly capitalizing on our own vast oil, coal and shale reserves.\n\nYou scare me because you want to kill the American capitalist goose that lays the golden eggs, which provides the highest standard of living in the world.\n\nYou scare me because you have begun to use extortion tactics against certain banks and corporations.\n\nYou scare me because your own political party shrinks from challenging you on your wild and irresponsible spending proposals.\n\nYou scare me because you will not openly listen to or even consider opposing points of view from intelligent people.\n\nYou scare me because you falsely believe that you are both omnipotent and omniscient.\n\nYou scare me because the media gives you a free pass on everything you do.\n\nYou scare me because you demonize and want to silence the Limbaughs, Hannitys, O'Relllys and Becks who offer opposing, conservative points of view.\n\nYou scare me because you prefer controlling over governing.\n\nFinally, you scare me because if you serve a second term I will probably not feel safe in writing a similar letter in 8 years.\n\n-Lou Pritchett","torrent":{"xt":"urn:btih:dcee2fcb46d3062b4e5438915d4c83d0284b5d7a","amp;dn":"Barack+Obama+is+a+Global+Disappointment%21.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcee2fcb46d3062b4e5438915d4c83d0284b5d7a","infoHashBuffer":{"type":"Buffer","data":[220,238,47,203,70,211,6,43,78,84,56,145,93,76,131,208,40,75,93,122]},"announce":[],"urlList":[]}}