{"title":"The King 2 Hearts (Korean Drama Complete Series) ENG SUB","uid":7788643,"size":5335168855,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:dfdfea7f3ac861f3f957036bccf9a0745f554998&amp;dn=The+King+2+Hearts+%28Korean+Drama+Complete+Series%29+ENG+SUB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":11,"uploader":"tunogopm","files":40,"time":1351963401,"description":"Plot\n\nThe King 2 Hearts is set in a alternate universe, where modern-day South Korea is governed by a constitutional monarchy descended from the Joseon Dynasty. Lee Jae-ha is a handsome yet materialistic crown prince who doesn't care about politics and feels total reluctance to being the second in line to the throne. Lee Jae-kang, the current king, tricked him into joining a joint military collaboration with North Korea as a means to help &quot;make him grow up&quot;.\n\nMeanwhile, Kim Hang-ah is a North Korean Special Forces Officer who is also the daughter of a North Korean military high command official. Both Jae-ha and Hang-ah meet at the joint military training, a crucial part in establishing friendly relations between the two separate countries. Although the two met each other with a fiery disposition, Jae-ha unwittingly sparks a friendship with Hang-ah and he subsequently falls in love with her. Soon, an arranged marriage is set up between the two and they eventually become engaged. While they attempt to set their differences aside and build a growing relationship, things suddenly take a turn for the worse when King Jae-kang and his wife were assassinated in cold blood by the devious Club M, who are led by John Meyer/Kim Bong-gu, a mysterious magician who wishes to remove the Royal Family and rule in their stead. Now crowned the new King of South Korea, Jae-ha must learn to be responsible and protect the country before it is too late","torrent":{"xt":"urn:btih:dfdfea7f3ac861f3f957036bccf9a0745f554998","amp;dn":"The+King+2+Hearts+%28Korean+Drama+Complete+Series%29+ENG+SUB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfdfea7f3ac861f3f957036bccf9a0745f554998","infoHashBuffer":{"type":"Buffer","data":[223,223,234,127,58,200,97,243,249,87,3,107,204,249,160,116,95,85,73,152]},"announce":[],"urlList":[]}}