{"title":"The Ed Show 10-10-12.mp4","uid":7721890,"size":218004526,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e0cc0dd542c4f748c95014c48b61592eb858b250&amp;dn=The+Ed+Show+10-10-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1350093414,"description":"The Ed Show; October 10, 2012.\n\n27 days until the election and Mitt Romney implodes over a woman's right to choose.\n\nWednesday, Ed welcomed Terry O'Neill (President of The National Organization for Women), and Democratic Strategist Bob Shrum for reaction and analysis of Romney's abortion Etch A Sketch.\n\nMitt Romney went moderate during his debate with the president. Now one question is, will his running mate do the same?  Howard Fineman (NBC News Political Analyst and Editorial Director of the Huffington Post Media Group), had a preview of tomorrow's vice presidential debate.\n\nPaul Ryan tried to convince Michigan voters that he and Mitt Romney would fight for the auto industry, but their records told a different story.  John Nichols (Washington Correspondent of The Nation) had the details.\n\nFrom the coal mine owner to the real estate mogul, CEO's are holding their workers hostage to get votes for Mitt Romney.  Robert Reich (former U.S. Labor Secretary and UC Berkeley Professor), looked at the revolt of the plutocrats.\n\nThe mother of a Navy SEAL killed in Benghazi asks Mitt Romney to stop using her son as a political prop.\n\nAnd in the Big Finish, Rep. Joe Walsh attacked Tammy Duckworth for her appearance at the Democratic National Convention, and he's not the only Tea Partier facing a tough re-election fight.  Ed talked with Karen Finney (MSNBC Political Analyst and former DNC Communications Director).","torrent":{"xt":"urn:btih:e0cc0dd542c4f748c95014c48b61592eb858b250","amp;dn":"The+Ed+Show+10-10-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0cc0dd542c4f748c95014c48b61592eb858b250","infoHashBuffer":{"type":"Buffer","data":[224,204,13,213,66,196,247,72,201,80,20,196,139,97,89,46,184,88,178,80]},"announce":[],"urlList":[]}}