{"title":"Internet Download Manager 6.12 Build 21 Final","uid":7679968,"size":4953674,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e1c29de1aa24f3000ddcdcde275523f1f5c01546&amp;dn=Internet+Download+Manager+6.12+Build+21+Final&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"wallpwallpapers","files":-1,"time":1348793391,"description":"Internet Download Manager has a smart download logic accelerator that features intelligent dynamic file segmentation and safe multipart downloading technology to accelerate your downloads. Unlike other download accelerators and managers that segment files before downloading starts, Internet Download Manager segments downloaded files dynamically during download process. Internet Download Manager reuses available connections without additional connect and login stages to achieve better acceleration performance.\n\nInternet Download Manager supports proxy servers, ftp and http protocols, firewalls, redirects, cookies, authorization, MP3 audio and MPEG video content processing. IDM integrates seamlessly into Microsoft Internet Explorer, Netscape, MSN Explorer, AOL, Opera, Mozilla, Mozilla Firefox, Mozilla Firebird, Avant Browser, MyIE2, and all other popular browsers to automatically handle your downloads. You can also drag and drop files, or use Internet Download Manager from command line. Internet Download Manager can dial your modem at the set time, download the files you want, then hang up or even shut down your computer when it's done.\n\nInstall setup\nUse keygen and patch","torrent":{"xt":"urn:btih:e1c29de1aa24f3000ddcdcde275523f1f5c01546","amp;dn":"Internet+Download+Manager+6.12+Build+21+Final","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1c29de1aa24f3000ddcdcde275523f1f5c01546","infoHashBuffer":{"type":"Buffer","data":[225,194,157,225,170,36,243,0,13,220,220,222,39,85,35,241,245,192,21,70]},"announce":[],"urlList":[]}}