{"title":"Melissa Harris-Perry 10-7-12.mp4","uid":7712217,"size":372105950,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e215aa9fad15a3720de62462e1c7946ea55e8054&amp;dn=Melissa+Harris-Perry+10-7-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":-1,"time":1349838077,"description":"Melissa Harris-Perry; Sunday, October 7, 2012.\n\nTopics Melissa broached through her (perhaps) amplified mike today include one of the third rails of American politics: affirmative action. They had a bonus edition of This Week in Voter Suppression! [Trademark], Ohio edition. They also took a look at the first-generation Americans running this fall to serve America in Congress and elsewhere. Melissa also has a preview of this week's vice-presidential debate in store.\n\nIn addition to potential substitute host Kornacki, our guests included:\n\nRobert Traynham (MSNBC contributor and former communications director for Rick Santorum), Chloe Angyal (an editor at Feministing and contributor to The Atlantic, Jezebel, The Guardian, among others), Steve Kornacki (&quot;The Cycle&quot; co-host, writer at Salon.com), Sayu Bhojwani (founding director of the New American Leaders Project),  they discussed the upcoming debate(s).\n\nGrace Meng (Democratic candidate for Congress from New York) joined and replaced Steve Kornacki to discuss diversity in congress.\n\n\nSayu Bhojwani and Chloe Angyal stayed. Kenji Yoshino (NYU law professor) replaced Grace Meng, Debo Adegbile (acting president and director-counsel of the NAACP Legal Defense Fund) replaced  Sayu Bhojwani on the new panel that discussed Fisher Vs. University of Texas (affirmative action).\n\n\nChristopher Smitherman (Cincinnati councilman and head of the Cincinnati NAACP) joined via satellite to discuss 'This Week in Voter Suppression'.\n\nFootnote was on the American presidency and its strengths.","torrent":{"xt":"urn:btih:e215aa9fad15a3720de62462e1c7946ea55e8054","amp;dn":"Melissa+Harris-Perry+10-7-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e215aa9fad15a3720de62462e1c7946ea55e8054","infoHashBuffer":{"type":"Buffer","data":[226,21,170,159,173,21,163,114,13,230,36,98,225,199,148,110,165,94,128,84]},"announce":[],"urlList":[]}}