{"title":"Far Cry 2 (Wineskin Port)","uid":7722171,"size":2895487088,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:e295950ae8524b2c11b341bc1bf2a6705811e116&amp;dn=Far+Cry+2+%28Wineskin+Port%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"YoMamaIsBeast","files":1,"time":1350104629,"description":"A recent port I have made using Wineskin Winery, Far Cry 2.\n\nI used an Razor1911 pc game and a seperate crack for it straight from The Pirate Bay itself!\n\nEverything should work properly, I am running on a Early 2011 MacBook Pro running OS X 10.8.2 Mountain Lion and the game runs really well. I have the latest engine as of last week (I havent had time to update and This engine runs the best with this game.)\n\nBest way to save to Mac:\n1. Unzip Far Cry 2 from the ZIP File inside the torrent.\n2. Drag the game to your desktop or Applications folder, whichever works best.\n3. Open game and run.\n4. It may freeze and close on the first time but on the second time, let it run. Don't have anything else in the background of The Mac while running the game. This makes it run better and not shut automatically at random.\n\nPLEASE DO NOT MESS WITH ANY WINESKIN SETTINGS IN THE WRAPPER IF YOU ARE ONLY NEW TO WINESKIN AND PORTING. IF YOU ARE ADVANCED IN WINESKIN AND THINK THAT THIS GAME MAY RUN BETTER ON A NEWER WRAPPER OR ENGINE GO AHEAD BUT IF YOU FINE IT DOESN'T WORK CHANGE IT BACK TO THE ORIGINAL SETTINGS YOU GOT IT!\n\nHappy Pirating!\n\n(I still have an MC Domination game, Trials 2 Second Edition ported game, Alfred app for Mac and Gravity Guy Game (native to mac) to come on Pirate Bay please stay tuned and SEED!!!!!!!!!","torrent":{"xt":"urn:btih:e295950ae8524b2c11b341bc1bf2a6705811e116","amp;dn":"Far+Cry+2+%28Wineskin+Port%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e295950ae8524b2c11b341bc1bf2a6705811e116","infoHashBuffer":{"type":"Buffer","data":[226,149,149,10,232,82,75,44,17,179,65,188,27,242,166,112,88,17,225,22]},"announce":[],"urlList":[]}}