{"title":"Match of the Day 29.09.2012","uid":7686688,"size":722159314,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e47877e52e7604a6e8df40727cc23260a1a07d20&amp;dn=Match+of+the+Day+29.09.2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"footy","files":1,"time":1348968098,"description":"Match of the Day 29.09.2012\n\nDuration: 1 Hour, 30 Min\n\nLanguage : English \n\nGabby Logan presents highlights from all of the day's Premier League games.\n\nIt's a day full of exciting fixtures - not least the lunchtime London derby between Arsenal and Chelsea. Although last season's game at the Emirates ended 0-0, the reverse fixture between the sides earlier in the campaign was a classic, with Arsenal winning 5-3. Robin van Persie scored a hat-trick for the Gunners that day, but has of course since departed for Manchester United. Arsene Wenger's new-look side are still adjusting to his absence, and could be in for a tough afternoon against a Chelsea team that have started the Premier League season brilliantly.\n\nThe day's early evening match is another intriguing encounter, as Manchester United take on a Tottenham side who have not started brightly under new manager Andre Villas Boas. They have not won at Old Trafford since 1989, and will have to shackle the prolific van Persie, so often their nemesis during his days at Arsenal.\n\nChampions Manchester City travel to Craven Cottage to play Fulham. In last season's encounter at Craven Cottage, Roberto Mancini's men blew a 2-0 lead to draw 2-2 - the only time in their first 12 league matches of the season that they failed to pick up maximum points.\n\nElsewhere, Everton host Southampton, Liverpool are away at Norwich and Reading take on Newcastle. Stoke welcome high-flying Swansea to the Britannia Stadium and Sunderland play Wigan.\n","torrent":{"xt":"urn:btih:e47877e52e7604a6e8df40727cc23260a1a07d20","amp;dn":"Match+of+the+Day+29.09.2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e47877e52e7604a6e8df40727cc23260a1a07d20","infoHashBuffer":{"type":"Buffer","data":[228,120,119,229,46,118,4,166,232,223,64,114,124,194,50,96,161,160,125,32]},"announce":[],"urlList":[]}}