{"title":"Nodus Griefing Client for Minecraft 1.3.2","uid":7721949,"size":4584776,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e56c2aefbcf86c5f4432bb80c6bab0115ddb6967&amp;dn=Nodus+Griefing+Client+for+Minecraft+1.3.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Predictability","files":11,"time":1350094965,"description":"I've been looking everywhere for a torrent for this, but couldn't find any.  When I finally got it, I decided to upload it to TPB so everyone else can use it too.\n\nThis is a modified version of the popular game Minecraft that makes griefing a lot easier.  Griefing is basically razing your enemy's buildings and towns.  However, it can be pretty difficult when you're bound to the normal rules of Minecaft.  In this torrent, I have included the modified Minecraft client, a batch file that automates it's installation in Windows (sorry Mac and Linux users, but you'll have to follow the instructions manually), a list of accounts, most of which usable, and 6 Spamfiles, and instructions on how to install.  To use the accounts, simply go to &quot;Account settings&quot; under &quot;Multiplayer&quot;. \n\nHere's a few of the abilities this client gives you:\n- Customizable X-ray vision that lets you see through everything but what you choose.\n- Creative Nuker will allow automatically delete all blocks around you.\n- FullBright which removes all darkness for you.\n- Customizable High Jump abilities allow you to choose how high to jump.\n- NoFall makes you immune to damage inflicted from falling a large distance.\n- Build modes allow you to automatically build either a pole, floor, wall, or swastika.\n- And many, many more.\n\nI included a full guide, along with keybinds in the README as well.  Anyways, here's how to install Nodus Griefing Client:\n\nI hope everyone has had as much with this as I have!\nIf you have any questions, feel free to PM me.\nSpecial thanks to Stonecold1995 for making the quick installation program for Windows (yeah, I know it's simple but I can't into even batch files) and of course, Scetch for making the client itself.\n\nIf you would like to download Nodus from it's original site, you can visit Sceth's website.\nScetch's website: Scetch.net\nNodus Griefing forums: nodusgriefing.com","torrent":{"xt":"urn:btih:e56c2aefbcf86c5f4432bb80c6bab0115ddb6967","amp;dn":"Nodus+Griefing+Client+for+Minecraft+1.3.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e56c2aefbcf86c5f4432bb80c6bab0115ddb6967","infoHashBuffer":{"type":"Buffer","data":[229,108,42,239,188,248,108,95,68,50,187,128,198,186,176,17,93,219,105,103]},"announce":[],"urlList":[]}}