{"title":"POtHS - Prophetic Times - 91 - Mystery Babylon Vol 5 - The True ","uid":7669110,"size":4024361081,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e5c938acd0a282fda567e78448e8e2ddcfad5068&amp;dn=POtHS+-+Prophetic+Times+-+91+-+Mystery+Babylon+Vol+5+-+The+True+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":-1,"time":1348519073,"description":"POtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - Prophetic Times - 91 - Mystery Babylon Vol 5 - The True Deal\n\nbabylonthegreatisfalling.net\n\nPOtHS Comments on This one:Excellent\n\nDescription:\nThe True Deal With Judges by Dr Dale Livingston:\nIn this radio show, Dr. Dale Livingston disgusses the True Deal With Judges and some of United States true history.  Learn the deception perpetrated on the people.\n\n\nMystery Religion in the Vatican by Michael Hoggard:\nLearn about the inner secrets of the Roman Catholic Church hierarchy.  Pastor Mike Hoggard looks at the Vatican and Mystery Babylon the Mother of Harlots and Goddess worship as the center of Vatican Goddess worship.\n\n\n50 Facts vs Darwinism In The Textbooks - Russ Miller:\nLies are all they have to support the theory of evolution.  Learn the Lies they feed your children in school textbooks.\nPresented by Russ Miller of Creation, Evolution, &amp; Science Ministries - http://www.creationministries.org/\n\n\nJESUS DNA EVOLUTION - THE NEW WORLD ORDER:\nPastor Michael Hoggard returns to explain the amazing correlations between the Holy Bible and DNA, and how the Gospel message is literally encoded in our genetic structure. He also discusses why evolution is a religion and evolution's connection to the New World Order.\n\n\nSermons - Payday Someday and How Do I Know There Is A God by RG Lee:\nThis old tymer sermon is one to listen to.  Pastor R.G. Lee was born November 11, 1886, and died July 20, 1978. The midwife attending his birth held baby Lee in her black arms while dancing a jig around the room, saying, &quot;Praise God! The Lord has sent a preacher to this house.&quot; &quot;God-sent preacher&quot; well describes Dr. Lee. Few in number are the Baptists who have never heard his most famous sermon, &quot;Payday Someday!&quot; If you haven't heard it, or read it, surely you have heard some preacher make a favorable reference to it.\n\n\nEndtime News Updates 8-30-12 and 8-1-12:\nLatest world news on wars and rumors of wars, and various global agendas to formalize the New World Order and Religion.\n\nThe Entire Collection can be found here: \n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\n           \n:thankyou:  :thankyou:   Thank You JESUS\n","torrent":{"xt":"urn:btih:e5c938acd0a282fda567e78448e8e2ddcfad5068","amp;dn":"POtHS+-+Prophetic+Times+-+91+-+Mystery+Babylon+Vol+5+-+The+True+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5c938acd0a282fda567e78448e8e2ddcfad5068","infoHashBuffer":{"type":"Buffer","data":[229,201,56,172,208,162,130,253,165,103,231,132,72,232,226,221,207,173,80,104]},"announce":[],"urlList":[]}}