{"title":"paleangel_hack_attacks_testing","uid":7673989,"size":10216375,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e6e62bb1bcdfa5654fd0057a1376482e2c791c25&amp;dn=_paleangel_hack_attacks_testing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"paleange1","files":-1,"time":1348651134,"description":"A network security breach (a hack, crack, or other invasion) occurs when unauthorized access to the network is achieved and havoc results. The best possible defense is an offensive strategy that allows you to regularly test your network to reveal the vulnerabilities and close the holes before someone gets in. Written by veteran author and security expert John Chirillo, Hack Attacks Testing explains how to perform your own security audits.\n\nStep by step, the book covers how-to drilldowns for installing and configuring your Tiger Box operating systems, installations, and configurations for some of the most popular auditing software suites. In addition, it includes both common and custom usages, scanning methods, and reporting routines of each. Finally, Chirillo inspects the individual vulnerability scanner results and compares them in an evaluation matrix against a select group of intentional security holes on a target network. Chirillo tackles such topics as:\n\nBuilding a multisystem Tiger Box\nBasic Windows 2000 Server installation and configuration for auditing\nBasic Linux and Solaris installation and configuration\nBasic Mac OS X installation and configuration for auditing\nISS, CyberCop, Nessus, SAINT, and STAT scanners\nUsing security analysis tools for Mac OS X\nVulnerability assessment","torrent":{"xt":"urn:btih:e6e62bb1bcdfa5654fd0057a1376482e2c791c25","amp;dn":"_paleangel_hack_attacks_testing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6e62bb1bcdfa5654fd0057a1376482e2c791c25","infoHashBuffer":{"type":"Buffer","data":[230,230,43,177,188,223,165,101,79,208,5,122,19,118,72,46,44,121,28,37]},"announce":[],"urlList":[]}}