{"title":"Hannah and Her Sisters 1986 DVDRip Sonata Premiere ","uid":7721827,"size":740352653,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e7bb49079dc7737fd46a1daa0a0c7e85e03f5104&amp;dn=Hannah+and+Her+Sisters+1986+DVDRip+Sonata+Premiere+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"klinho","files":2,"time":1350090116,"description":"A Woody Allen Manhattan mosaic, Hannah and Her Sisters concerns the lives, loves, and infidelities among a tightly-knit artistic clan. Hannah (Mia Farrow) regularly meets with her sisters Holly (Dianne Wiest) and Lee (Barbara Hershey) to discuss the week's events. It's what they don't always tell each other that forms the film's various subplots. Hannah is married to accountant and financial planner Elliot (Michael Caine), who carries a torch for Lee, who in turn lives with pompous Soho artist Frederick (Max Von Sydow). Meanwhile, Holly, a neurotic actress and eternal loser in love, dates TV producer Mickey (Allen), who used to be married to Hannah and spends most of the film convinced that he's about to die. Appearing in supporting parts are Lloyd Nolan and Maureen O'Sullivan (Farrow's real mom), as the eternally bickering husband-and-wife acting team who are the parents of Hannah and her sisters. The film begins and ends during the family's traditional Thanksgiving dinner, filmed in Farrow's actual New York apartment. Unbilled cameos are contributed by Sam Waterston as one of Wiest's brief amours and Tony Roberts as one of Allen's friends. Hannah and Her Sisters collected Oscars for Michael Caine, Dianne Wiest, and Woody Allen's screenplay. ~ Hal Erickson, Rovi","torrent":{"xt":"urn:btih:e7bb49079dc7737fd46a1daa0a0c7e85e03f5104","amp;dn":"Hannah+and+Her+Sisters+1986+DVDRip+Sonata+Premiere+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7bb49079dc7737fd46a1daa0a0c7e85e03f5104","infoHashBuffer":{"type":"Buffer","data":[231,187,73,7,157,199,115,127,212,106,29,170,10,12,126,133,224,63,81,4]},"announce":[],"urlList":[]}}