{"title":"Melissa Harris-Perry 10-13-12.mp4","uid":7731689,"size":371029320,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:eb562ec237bd1fa7be4f9a7262b028215115ae0c&amp;dn=Melissa+Harris-Perry+10-13-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":-1,"time":1350356614,"description":"Melissa Harris-Perry; Saturday, October 13, 2012.\n\nSo rather than asking those people in a fury, &quot;WHY HAVEN'T YOU MADE UP YOUR MIND, DUDE/LADY?!?!&quot;, today Mellisa explored some of the things that could help sway their vote in these final days. Naturally, there are people who are their direct opposites folks who have voted early, in states like Ohio. Well, in today's edition of This Week in Voter Suppression!{Trademark}, they brought some fresh news on what extreme Republican lawmakers and state officials are going to in order to block people from voting early.\n\nThey assessed the cultural and social impact of an Obama second term on African Americans, and take a look at school desegregation through busing. And Mellisa had a Foot Soldier who is brilliant!\n\nOur guests include:\n\nGlen Johnson (politics editor of Boston.com), Jelani Cobb (associate professor of Africana Studies at the University of Connecticut), Anthea Butler (professor of religious studies and graduate chair of religion at the University of Pennsylvania), Matt Welch (editor-in-chief of Reason Magazine, and author of &quot;McCain: Myth of a Maverick&quot;) discussed undecideds and &quot;This Week in Voter Suppression&quot;.\n\n\nNina Turner (D-Ohio State Senator) joined via satellite to discuss a billboard designed to intimidate certain voters.\n\n\nBarbara Arnwine (president and executive director of the Lawyer's Committee for Civil Rights Under Law) replace Glen Johnson on the panel. They discussed an ad and how it baited the African-American community among other things.\n\nKim Janey (senior project director at the Massachusetts Advocates for Children, and a part of the Boston School Reform Project), Glen Johnson returned, Prudence Carter (associate professor of education and sociology, Stanford University, and author of &quot;Stubborn Roots: Race, Culture, and Inequality in U.S. and South African Schools&quot;), and Jelani Cobb stayed to discuss forced busing in Boston and a better solution.\n","torrent":{"xt":"urn:btih:eb562ec237bd1fa7be4f9a7262b028215115ae0c","amp;dn":"Melissa+Harris-Perry+10-13-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb562ec237bd1fa7be4f9a7262b028215115ae0c","infoHashBuffer":{"type":"Buffer","data":[235,86,46,194,55,189,31,167,190,79,154,114,98,176,40,33,81,21,174,12]},"announce":[],"urlList":[]}}