{"title":"740 Magic and Mentalism E-Books and Videos","uid":7725985,"size":9752857106,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ebf15738a8efdd161f97f03c29e841c971ea0fc5&amp;dn=740+Magic+and+Mentalism+E-Books+and+Videos&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":27,"uploader":"thenmeunseen","files":741,"time":1350175032,"description":"If you are not a magician, or are not seriously interested in becoming a magician, please don't bother downloading this torrent. If you are only looking for the secrets to magic &quot;tricks&quot; out of curiosity, please remember that &quot;curiosity killed the cat.&quot; For you, these &quot;tricks&quot; will never be more than the deceptions you believe them to be, and in learning how they work, you will be severely disappointed.\n\nNow, for those who truly believe that magic is real; those who have performed miracles, as well as those who honestly want to attain this wondrous ability; this collection contains over 700 E-books and videos by many of the world's greatest magicians, revealing the secrets of thousands of amazing magic effects.\n\nI have always been drawn to mental magic, so there are a great number of mental magic effects in this collection. However, there are also plenty of effects for those interested in close-up magic, street magic, stage magic, spectacular magic, bizarre/occult magic, as well as lots of easy (or difficult) card and coin tricks.\n\nIf you are new to magic, I strongly recommend the Tarbell Course (included) as the best place to start learning the basic terminology magicians use, and the many important skills you will need to hone to perfection in order for you to become a &quot;real&quot; magician. If you are a professional, just dive right in and enjoy.\n\nThis is my first torrent upload.  If you find a problem, please let me know about it.  I'll do everything I can to correct it.  If you find this collection useful, please let everyone know, and I'd really appreciate it if you'd seed for at least 150%.  I have another 96GB of magic and mentalism videos and e-books to sort out, so if this collection is popular enough, I will try to upload more soon.","torrent":{"xt":"urn:btih:ebf15738a8efdd161f97f03c29e841c971ea0fc5","amp;dn":"740+Magic+and+Mentalism+E-Books+and+Videos","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebf15738a8efdd161f97f03c29e841c971ea0fc5","infoHashBuffer":{"type":"Buffer","data":[235,241,87,56,168,239,221,22,31,151,240,60,41,232,65,201,113,234,15,197]},"announce":[],"urlList":[]}}