{"title":"Attunement - music to upgrade your life","uid":7780381,"size":41667286,"categoryP":"applications","categoryS":"ios_(ipad_iphone)","magnet":"?xt=urn:btih:ed0eac03fabb82e33acfb4dc9a21c99863752ec7&amp;dn=Attunement+-+music+to+upgrade+your+life&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1351765207,"description":"&quot;I truly love the music in this app. I've sleeping better, relaxing better and have been feeling more at peace with myself in a very long time. I suffer with chronic pain and I truly feel that your app has helped me through some of my tougher moments. As a yoga teacher I would like my students to experience what I have.&quot; ---recent feedback\n\nSeven selections of exquisite Meditation OasisÂ® music to suit your mood and needs. Whether you want to meditate, practice yoga, relax deeply, get energized or heal, the Attunement App has music for the occasion. You can choose from 7 different selections, each of which creates its own special effects as you listen:\n\nRelaxing - wonderful for unwinding or sleep\nSurrender - facilitates letting go of stress\nPrimordial - experience deep levels of your inner being\nInner Peace - profoundly healing and calming effect\nGrounding - the perfect antidote for overstimulation\nHealing - restores balance to the body and the mind\nEnergizing - clears the emotions, recharges vitality\n\nWith this App, you can choose playing times from 5 to 30 minutes for each selection, or use a playlist option to create and play a sequence of music in any combination. The Playlist gives you the option of up to 60 minutes of playing time.\n\nAttunement has been created by Richard Maddux, composer of the music on the popular Meditation Oasis podcast and CDs. Here's what people say about Richard's music:\n\n&quot;It is the most beautiful music I have ever heard, it really speaks to me on such a deep deep level. I really do get a feeling of the essence of my being.&quot;\n\n&quot;The music is relaxing, calming, nurturing...&quot;\n\n&quot;The music is wonderful. I've been using it for my morning yoga session regularly.&quot;\n\n&quot;Richard's beautiful music helped in part to bring me back to life.&quot;\n\n&quot;Amazingly peaceful and healing. Wonderful music for relaxing and washing away stress. Takes one to a very comforting zone.&quot;\n\n------------------------------\n\nWith this App you get:\n\n- Music to suit your mood and needs\n- 7 selections of music perfect for relaxation, meditation, healing, yoga, or massage.\n- Option to play music for 5, 10, 15, 20, 30, or 60 minutes\n- Option to create a custom playlist of up to 60 min of music\n- Automatically saved volume levels\n- Read instructions to support and enhance your listening","torrent":{"xt":"urn:btih:ed0eac03fabb82e33acfb4dc9a21c99863752ec7","amp;dn":"Attunement+-+music+to+upgrade+your+life","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed0eac03fabb82e33acfb4dc9a21c99863752ec7","infoHashBuffer":{"type":"Buffer","data":[237,14,172,3,250,187,130,227,58,207,180,220,154,33,201,152,99,117,46,199]},"announce":[],"urlList":[]}}