{"title":"Saw (All 7 Movies) 720p","uid":7774999,"size":4456259452,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:edf84afc6d5f5e75c25e06b25db316e32914927b&amp;dn=Saw+%28All+7+Movies%29+720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jak8907","files":7,"time":1351630832,"description":"Saw (2004)\nWith a dead body laying between them, two men wake up in the secure lair of a serial killer who's been nicknamed &quot;Jigsaw&quot;. The men must follow various rules and objectives if they wish to survive and win the deadly game set for them.\n\n\nSaw II (2005)\nJigsaw locks a few unlucky people in a booby trapped shelter and they must find a way out before they inhale too much of a lethal nerve gas and die. But they must watch out, for the traps Jigsaw has set in the shelter lead to death also.\n\n\nSaw III (2006)\nJigsaw kidnaps a doctor to keep him alive while he watches his new apprentice put an unlucky citizen through a brutal test.\n\n\nSaw IV (2007)\nDuring the autopsy of John Kramer, the coroner finds a tape inside his stomach and calls Detective Hoffman. Meanwhile, the police find Detective Kerry dead and the SWAT Commander Rigg is absolutely traumatized with the tortured corpse of Kerry and obsessed to save Detective Eric Matthews that has been missing for six months; however Hoffman asks him to take vacations and leave the case. The FBI agents Strahm and Perez join Hoffman's team to investigate the legacy of Jigsaw. However, Rigg is abducted and forced to participate in another sick game to save Eric's life.\n\n\nSaw V (2008)\nFollowing Jigsaw's grisly demise, Mark Hoffman, the final apprentice to the serial killer is deigned a hero. Meanwhile, Agent Strahm continues to track Hoffman while another group of strangers are put through a series of gruesome traps.\n\n\nSaw VI (2009)\nAgent Strahm is dead and framed while Hoffman continues John's legacy while Jill carries out John's final request.\n\n\nSaw 3D: The Final Chapter (2010) (not in 3d)\nAs a deadly battle rages over Jigsaw's brutal legacy, a group of Jigsaw survivors gathers to seek the support of self-help guru and fellow survivor Bobby Dagen, a man whose own dark secrets unleash a new wave of terror.","torrent":{"xt":"urn:btih:edf84afc6d5f5e75c25e06b25db316e32914927b","amp;dn":"Saw+%28All+7+Movies%29+720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edf84afc6d5f5e75c25e06b25db316e32914927b","infoHashBuffer":{"type":"Buffer","data":[237,248,74,252,109,95,94,117,194,94,6,178,93,179,22,227,41,20,146,123]},"announce":[],"urlList":[]}}