{"title":"Tropical Stormfront - RTS v1.0.11 Final By bobiras2009","uid":7650996,"size":45925869,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:ef2bc49a0085e8691ffa224fec4aba044d8c6f8e&amp;dn=Tropical+Stormfront+-+RTS+v1.0.11+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1348022278,"description":"Follow my uploads here:                  &lt;a href=&quot;\nhttps://forum.suprbay.org/member.php?action=profile&amp;uid=311481&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/member.php?action=profile&amp;uid=311481&lt;/a&gt;    \n\nYou can make requests here:                   &lt;a href=&quot;\nhttps://forum.suprbay.org/forumdisplay.php?fid=4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/forumdisplay.php?fid=4&lt;/a&gt;\n                 \n\n                                By bobiras2009\t\t\n\n\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\nTropical Stormfront is Real-Time Strategy (RTS) game in a tropical setting. Take command and join the ultimate war of good versus evil. Defend your freedom against the forces of darkness. Fight real-time battles in the tropics and become the ultimate leader.\n\nThe game features a multitude of pre-defined missions such as survival mode, eliminate all the enemy forces, capture the flag, hold the flag, defend against incoming forces, capture the enemy general, sea battles, air battles as well as tank fights.\n\nTo complete the objectives you take command of the United Democratic Alliance (UDA) and fight against the evil forces of Order, Discipline and Obedience (ODO). Choose the right strategies for each of the battles and you will claim ultimate victory!\n\nIMPORTANT: Please note that the game requires a screen resolution of 800x480 pixels or higher. Although the game still runs on a lower resolution, not all GUI elements will be rendered properly. The game has been thoroughly tested and runs at about 30+ frames/seconds. It is possible though that the application is slow on some devices. Please try the LITE version before purchase to verify proper function. If you encounter any problems running the game, try (1) a device restart (i.e. turn off completely) as well as (2) a complete re-install.\n\nThe LITE version of the game includes 4 campaign mission to allow you to evaluate the game. There is no time limit and the game does not contain any spyware, malware or third party software of such kind. Again, please try the LITE version first to verify the application works on your device. If you are having any problems or are not happy with your purchase, feel free to contact us via email at any time. For a full refund please include your order# with your message.\n\nWhat's in this version : (Updated : Sep 14, 2012)\n\n    Bugfix for Crashes (Force Close)\n    Russian Added\n    Also, I removed the license check. Given the high piracy rate there is no point in &quot;punishing&quot; paying users with it at this point.\n\nRequired Android O/S : 2.0+\n\n\n                                By bobiras2009\t\t","torrent":{"xt":"urn:btih:ef2bc49a0085e8691ffa224fec4aba044d8c6f8e","amp;dn":"Tropical+Stormfront+-+RTS+v1.0.11+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef2bc49a0085e8691ffa224fec4aba044d8c6f8e","infoHashBuffer":{"type":"Buffer","data":[239,43,196,154,0,133,232,105,31,250,34,79,236,74,186,4,77,140,111,142]},"announce":[],"urlList":[]}}