{"title":"Revo Uninstaller Pro 3.0.8 ML+Patch(XENOCODER) - Cyclonoid","uid":9355788,"size":10800189,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ef9a1e235170a49d869bf27da490c07a81d2c4b5&amp;dn=Revo+Uninstaller+Pro+3.0.8+ML%2BPatch%28XENOCODER%29+-+Cyclonoid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cyclonoid","files":6,"time":1387213452,"description":"Revo Uninstaller helps you to uninstall software and remove unwanted programs installed on your computer even if you have problems uninstalling and cannot uninstall them from &quot;Windows Add or Remove Programs&quot; control panel applet.\n\nRevo Uninstaller is a much faster and more powerful alternative to &quot;Windows Add or Remove Programs&quot; applet! It has very powerful features to uninstall and remove programs:\n\nScanning for leftovers after uninstall - With its advanced and fast algorithm, Revo Uninstaller analyzes an application's data before uninstall and scans after you uninstall a program. After the program's regular uninstaller runs, you can remove additional unnecessary files, folders and registry keys that are usually left over on your computer.\n\nForced Uninstall - Uninstall even already uninstalled programs. This feature allows you to remove leftovers of programs that are already uninstalled, incomplete installations and uninstall remnants of programs!\n\nReal-Time Installation Monitor - Revo Uninstaller Pro has real-time program installation monitoring. It detects system changes during installation, so you can undone them later.\n\nMulti-Level Backup System - Revo Uninstaller Pro creates backups of removed registry keys, values, files and folders. It also creates full registry backup each time you uninstall a program.\n\nWith its unique &quot;Hunter mode&quot;, Revo Uninstaller offers you some simple, easy to use, but effective and powerful methods for uninstalling software. You can use it to manage your installed and/or running software programs.\n\nWhat's New in 3.0.8:\nAdded - Backup creation before Traced Uninstall\nFixed bugs\nAdded Norwegian language and updated language files\n\nHomepage:  &lt;a href=&quot;\nhttp://www.revouninstaller.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.revouninstaller.com&lt;/a&gt;\t\t\n\n\nInstall The APP, RUn the patch, Eat Doritos ;)","torrent":{"xt":"urn:btih:ef9a1e235170a49d869bf27da490c07a81d2c4b5","amp;dn":"Revo+Uninstaller+Pro+3.0.8+ML%2BPatch%28XENOCODER%29+-+Cyclonoid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef9a1e235170a49d869bf27da490c07a81d2c4b5","infoHashBuffer":{"type":"Buffer","data":[239,154,30,35,81,112,164,157,134,155,242,125,164,144,192,122,129,210,196,181]},"announce":[],"urlList":[]}}