{"title":"Windows Phone 7.5 Data Cookbook","uid":6822945,"size":15716940,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f07c93f272fb35d7c9f719ae8ba286dab18cf436&amp;dn=Windows+Phone+7.5+Data+Cookbook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"chami1988","files":-1,"time":1321464262,"description":"Windows Phone 7.5 Data Cookbook By Ramesh Thalli\nPublisher: Pa..ckt Publis..hing 2011 | 224 Pages | ISBN: 1849691223 | PDF \n\n\n\nOver 40 recipes for storing, managing, and manipulating data in Windows Phone 7.5 Mango applications.\nSimple data binding recipes to advanced recipes for building scalable applications \nTechniques for managing application data in Windows Phone mango apps \nOn-device data storage, cloud storage and API interaction \n\nIn Detail\nWindows Phone 7.5 Mango contains support for apps written in Silverlight or XNA. These apps can store data on the device, and also load and manipulate data from \\&quot;the cloud\\&quot; and other web services. \nThis Windows Phone 7.5 Data Cookbook has a range of recipes to help you apply data handling concepts. You will be able to apply the knowledge gained from these recipes to build your own apps effectively. \nThis Windows Phone 7.5 Data Cookbook starts with data binding concepts at the UI layer and then shows different ways of saving data locally and externally in databases. The book ends with a look at the popular MVVM software design pattern. The recipes contained in this book will make you an expert in the areas of data access and storage. \n\nWhat you will learn from this book\nCreate data binding to user interface elements with any data source \nCreate and save user settings to local isolated storage for later consumption \nExplore different on device database options such as commercial Perst, open source SQL CE and Microsoft\\'s SQL CE \nCreate and consume simple web services and understand LINQ features. \nUnderstand REST and call different social media services like Twitter and RSS Feeds. \nCreate and understand MVVM model.\n\nApproach\nThis book is for developers who want to build data-driven apps, or a line of business applications using the Windows Phone platform. It is also useful for developers on other mobile platforms looking to convert their apps to Windows Phone 7.5 Mango. Basic understanding of C#, XAML and Silverlight is required\n\nWho this book is written for\nThe book is written in a cookbook style, presenting examples in the style of recipes, allowing you to go directly to your topic of interest, or follow topics throughout a chapter to gain in-depth knowledge. \n","torrent":{"xt":"urn:btih:f07c93f272fb35d7c9f719ae8ba286dab18cf436","amp;dn":"Windows+Phone+7.5+Data+Cookbook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f07c93f272fb35d7c9f719ae8ba286dab18cf436","infoHashBuffer":{"type":"Buffer","data":[240,124,147,242,114,251,53,215,201,247,25,174,139,162,134,218,177,140,244,54]},"announce":[],"urlList":[]}}