{"title":"IMMORTALS RMVB GLOBE","uid":6827096,"size":179463906,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f21f0671cca69a54c0d767b1ce16a936234d59ea&amp;dn=IMMORTALS+RMVB+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1321574971,"description":"* RMVB CAM  * 01H41M54S  * Worked with the Dub plugins\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n\n* RECOMMENDED PLAYERS :\n\n\n- RMVB PLAYER or - MEDIACOPE \n\nor convert to your prefered video type for any other player\n\n\n\n* INTRO :\n\n\nImmortals is a 2011 3D fantasy action film directed by Tarsem Singh and starring Henry Cavill, Freida Pinto, and Mickey Rourke. The film also stars Luke Evans, Kellan Lutz, Joseph Morgan, Stephen Dorff, Alan Van Sprang, Isabel Lucas, and John Hurt. The film was previously named Dawn of War and War of the Gods before being officially named Immortals, and is loosely based on the Greek myths of Theseus and the Minotaur and the Titanomachy.\n\nIt was released in 2D and in 3-D (using the Real D 3D and Digital 3D formats)\n\n\n* Plot :\n\n\nThe Heraklion King of Crete, Hyperion (Mickey Rourke), declares war on Olympus after the Gods fail to answer his prayers to save his family from illness, and starts searching for the Epirus Bow, a powerful weapon created by the God of War Ares (Daniel Sharman), which he intends to use to release the Titans from Mount Tartarus and destroy the gods.\n\nHyperion attacks several holy places in search of the Epirus Bow, and after kidnapping a virgin oracle priestess called Phaedra (Freida Pinto) to help him, advances towards a nearby village, where the young Theseus (Henry Cavill) lives with his mother. Theseus\\' mother conceived him after being raped, and he is thus considered a bastard and prevented from evacuating the village with its other inhabitants by the soldier Lysander (Joseph Morgan). Theseus defeats him in combat, which he was taught by an old man (John Hurt), and Lysander is discharged by his commanding officer. Infuriated, he offers his services to Hyperion.\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n* GLOBE FILES 2011","torrent":{"xt":"urn:btih:f21f0671cca69a54c0d767b1ce16a936234d59ea","amp;dn":"IMMORTALS+RMVB+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f21f0671cca69a54c0d767b1ce16a936234d59ea","infoHashBuffer":{"type":"Buffer","data":[242,31,6,113,204,166,154,84,192,215,103,177,206,22,169,54,35,77,89,234]},"announce":[],"urlList":[]}}