{"title":"Resident Evil - Damnation 2012 PORSubDELUXE.mp4","uid":7743134,"size":703600816,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f494f75d89ae0bf21101e1b8b31319454cb1a6a4&amp;dn=Resident+Evil+-+Damnation+2012+PORSubDELUXE.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1350681503,"description":"* XVID CAM  * 01H40M02S    * + 1500 Bitrate    \n\n\n* Worked with the Dub plugins followed by mp4 conversion\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n- Portuguese art subtitles (DELUXE)\n\n\n\n* Plot :\n\n\nLeon S. Kennedy sneaks into the &quot;Eastern Slav Republic&quot; to verify rumors that Bio-Organic Weapons (BOWs) are being used in the country's civil war, which the United States and Russia are preparing to intervene in. After his arrival, Ingrid Hunnigan, Leon's mission support, informs him that the government has ordered an immediate retreat of U.S. forces. Determined to stop the BOWs, Leon ignores the order and enters the battlefield.[5]\n\nKennedy comes across his CIA contact, &quot;Scarecrow&quot;, who has been beaten to near-death. After struggling to get information about the BOWs from him, Scarecrow manages to murmur &quot;bee keeper&quot;, which invokes a flashback to a honey van that Leon saw earlier. Suddenly, a Licker attacks and kills Scarecrow. Leon is knocked out and is himself almost killed by the Licker until a shadowy figure, apparently able to control the creature, appears. When Leon comes to, he meets three rebel fighters: J.D.; Alexander Kozachenko; and the elderly Ivan Judanovich, who is the Ataman of the group. Leon quickly realizes that the rebels are using BOW's taken from the Lickers, and urges them to stop; Alexander refuses.\n\nMeanwhile, President Svetlana Belikova is met by Ada Wong, who is posing as a member of the United Nations. Ada provides information about BOW's to Svetlana and her generals, and reveals that there is a way to control BOW's with a master-slave relationship using the Plaga parasites. Elsewhere, Republic soldiers burst into the rebels' hideout and surround the fighters. Leon tries to warn them about the Plagas awakening in Ivan, but Sasha grabs his gun and shoots each of the soldiers. Later, in a conversation overheard by Leon, Ivan tells Alexander to leave him behind, fearing that his sickly state will get them killed before the planned attack on the Presidential Palace the next day. Reluctantly, Sasha shoots Ivan in a mercy killing.\n\nContinuing down the tunnels, Leon retrieves his flashlight and combats some Plaga hosts. He finds JD, only to be attacked by more Plaga hosts. JD is too frightened to shoot, and Leon is forced to save the both of them. JD begins to trust Leon and leads the way to the church. Leon and JD retreat up to the surface of the city square where they witness a soldier being surrounded by a horde of Ganados.\n\n\n\n\n* enjoy ...\n\n\n\n\n\n* GLOBE FILES 2012\n","torrent":{"xt":"urn:btih:f494f75d89ae0bf21101e1b8b31319454cb1a6a4","amp;dn":"Resident+Evil+-+Damnation+2012+PORSubDELUXE.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f494f75d89ae0bf21101e1b8b31319454cb1a6a4","infoHashBuffer":{"type":"Buffer","data":[244,148,247,93,137,174,11,242,17,1,225,184,179,19,25,69,76,177,166,164]},"announce":[],"urlList":[]}}