{"title":"Misfits (Seasons 1-3)","uid":7638860,"size":8948862820,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f56301d5c16b92b64aba4147e8915437516dcdac&amp;dn=Misfits+%28Seasons+1-3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"n17n3uq","files":21,"time":1347724912,"description":"Misfits is a British science fiction comedy-drama television show about a group of young offenders sentenced to work in a community service programme, where they obtain supernatural powers after a strange electrical storm. The first series started broadcasting on 12 November 2009 on E4, and was produced by Clerkenwell Films. The show aired in Australia in 2010 on ABC2, and in New Zealand, it screens on FOUR, where its third season is currently running. In June 2011, it was made available online in the United States via Hulu,[1] where it became one of the service's most-watched series.[2] Misfits can currently be viewed in the United States on the Logo channel.\n\nRecording for the second series began on 24 May 2010, next to Southmere Lake, Thamesmead, Bexley, Southeast London.[3] The second series aired from 11 November 2010 to 16 December 2010 on E4. A Christmas special, written by Howard Overman, featuring the whole main cast of the first series was broadcast on E4 in December 2010.[4][5] The first series won the 2010 BAFTA Television Award for Best Drama Series.[6] The third series began airing on 30 October 2011,[7] and ended on 18 December 2011. The show has since been renewed for a fourth series expected to premiere late 2012.\n\nRobert Sheehan, Iwan Rheon, Lauren Socha, Nathan Stewart-Jarrett and Antonia Thomas are introduced as Nathan Young, Simon Bellamy, Kelly Bailey, Curtis Donovan and Alisha Bailey respectively. Sheehan left the series after the second series, being replaced by Joe Gilgun as Rudy Wade. After the third series it was announced Rheon, Thomas and Socha had left their roles and would be replaced by new characters, including new series regular, and former recurring star, Matthew McNulty.","torrent":{"xt":"urn:btih:f56301d5c16b92b64aba4147e8915437516dcdac","amp;dn":"Misfits+%28Seasons+1-3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f56301d5c16b92b64aba4147e8915437516dcdac","infoHashBuffer":{"type":"Buffer","data":[245,99,1,213,193,107,146,182,74,186,65,71,232,145,84,55,81,109,205,172]},"announce":[],"urlList":[]}}