{"title":"Sexually Broken--Brutally Deep Throated  Amber Rayne  Matt Willi","uid":7753138,"size":966776423,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:f570854566de8c9670232bfb9be981b8c2d495b2&amp;dn=Sexually+Broken--Brutally+Deep+Throated++Amber+Rayne++Matt+Willi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":1,"time":1351016438,"description":"\nBrutally Deep Throated, Pussy Fucked, Finger Blasted, Made to Squirt! Elbow Suspension from HELL | Amber Rayne | Matt Williams\n\nOctober 22, 2012\n\n\nMP4 only.\n\n\nWelcome back the amazing Amber Rayne to Sexually Broken, the \nfastest growing sex and submission web site on the net! If \nevery person on planet had the sexual attitude of Amber, Men \nwouldn't have time to fight wars...\n\nThis was the Meet &amp; Greet with Amber, it is the first scene we \ndo for the day. It's where we create bondage while you watch. \nAll the tying is done on screen, as the scene flows, morphs. \nThese are the most realistic BDSM scenes on the 'net. The \nrigger/handler is bringing the cock. Nowhere else on the 'net \ndo you find that. All other sites have a director tie up the \ngirl and a porn star walks in to fuck her, in other words, \n100% staged and FAKE.\n\nWe start by binding Amber's elbows tightly together, then \nflogging her arms. We abuse her hard nipples, and strip her. \nWe make her take off her own shoes, she struggles and we \npunish her for slowness. Amber loves cock deep in her throat. \nNormally she controls that situation, not today. We roughly \ndeep throat that pretty face into subspace. The cock cuts off \nall air, she breathes when we want her to breathe. Amber \nstruggles, we are abusive with the cock. She is skull fucked \nlike she has never been skull fucked before. \n\nAmber is now pretty loopy from the severe breath play. We \nknock her down and bind a rod though her elbows and attach her \nknees to it, and her pretty feet are bound. We rock her on to \nher back and she finds herself completely vulnerable, legs \nspread wide, elbows remain tightly bound behind. We finger \nblast Amber's &quot;G&quot; spot, and within seconds she is a screaming, \nsquirting, cum bot! \n\nWe aren't done. We sit Amber up and attach a pulley system to \nthe rod, suspending Amber by her bound elbows and legs. The \nbondage is brutal, the model suffers. We pull out the vibrator \nand make Amber cum again and again. She is lost deep in \nsubspace, we let her float there, alone and in a Category 5 \nsuspension.\n\nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/10_22arayne/SexuallyBroken-Amber-Rayne-Matt-Williams-Brutally-Deep-Throated-Pussy-Fucked-Finger-Blasted-Made-to-Squirt-Elbow-Suspension-from-HELL.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/10_22arayne/SexuallyBroken-Amber-Rayne-Matt-Williams-Brutally-Deep-Throated-Pussy-Fucked-Finger-Blasted-Made-to-Squirt-Elbow-Suspension-from-HELL.php&lt;/a&gt;\n\n8000 uploads and counting, if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)   \n \nCheers  :-)  ","torrent":{"xt":"urn:btih:f570854566de8c9670232bfb9be981b8c2d495b2","amp;dn":"Sexually+Broken--Brutally+Deep+Throated++Amber+Rayne++Matt+Willi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f570854566de8c9670232bfb9be981b8c2d495b2","infoHashBuffer":{"type":"Buffer","data":[245,112,133,69,102,222,140,150,112,35,43,251,155,233,129,184,194,212,149,178]},"announce":[],"urlList":[]}}