{"title":"CrossFTP Professional v1.86.6","uid":7799427,"size":4321815,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f5b56de2cb1deff808b42d91a78aad8a3d9eae1f&amp;dn=CrossFTP+Professional+v1.86.6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"wallpwallpapers","files":-1,"time":1352241444,"description":"So you are interested in joining one of the most successful\ngroups of all time? Then you might want to continue reading\nNot only can we offer whatever your heart might desire, but\nbecoming part of the group will also be one of the more\nsignificant decisions you perhaps will take\n\nEver since our beginning in 1999 we ve strived to make a group\nthat not only is a group of knowledge, but a gathering of\npeople that wants friendship, devotion, respect and fun. Hard\nwork is what has brought us where we are today, and hard work\nis also what we would expect from you\n\nGiven the amount of hours we all put into this every day, we\nlike to see our self as a secondary family. We strive to take\ncare of each other and thus mutual respect is the essence of\nour group. We never pushed for being elite, as we do not believe\nthat any of us deserve the mark of the elitists. Every member\nof our group is taught to honor the next guy or gal with the\nsame respect as he or her demands for themselves. The same\nthought applies to how we look at other groups\n\nAre you ready to become part of a family? Do you think you have\nwhat it takes? Then now is the time to get up and contact us\nPerhaps you will find a new road to follow with us. Open\npositions are as follows, but if you do feel you have something\nto contribute with but feel that it doesn t match any of the\nopen positions, then do contact us and let us be the judge\nof that\n\nCRACKERS\nDo you have a thrill to find solutions to various protection\nschemes? May it be unpacking, patching, finding algorithms\nor emulating? We re always open for individuals that want to\nexpand their knowledge in reversing. You are required to have\nsome former knowledge in reversing as we do not tutor people\nfrom scratch. Former experience from other scene groups is\ngood, but not a necessity. Unsure if you qualify? Contact us\nand we ll decide based on your qualities. Be prepared that\nwe will demand examples of previous work\n\nInstall:\n\n- install setup\n- use the key generator to generate a valid serial\n- enjoy this release!","torrent":{"xt":"urn:btih:f5b56de2cb1deff808b42d91a78aad8a3d9eae1f","amp;dn":"CrossFTP+Professional+v1.86.6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5b56de2cb1deff808b42d91a78aad8a3d9eae1f","infoHashBuffer":{"type":"Buffer","data":[245,181,109,226,203,29,239,248,8,180,45,145,167,138,173,138,61,158,174,31]},"announce":[],"urlList":[]}}