{"title":"MineOS Crux x64 0.4.11","uid":7697981,"size":226975744,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:f5db94888476b96f1d083ab2fe2dd5d6cb505b51&amp;dn=MineOS+Crux+x64+0.4.11&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"societyblind","files":1,"time":1349418395,"description":"MineOS CRUX is a specialized distribution with a specific goal: To provide the ultimate server solution for Minecraft and to provide a robust and extendible platform for server mods and related value-added functionality\n\n\nGoals:\n\nMineOS CRUX is a entirely different project than MineOS with the same goals on a different platform. MineOS CRUX is a fully-featured and optimized server distribution that follows familiar Linux conventions to create a high-powered, intuitive, server configuration.\nWhat does MineOS CRUX offer over other Linux Distributions?\n\nMineOS has always aimed for a very niche audience--this aim has the downside a smaller community than general server solutions, such as Ubuntu Server. On the other hand, it has the upside of having a much more targetted and relevant set of applications and documentation to get it working the way it needs to be.\n\nI do not believe MineOS CRUX is the only server distro you should consider using to host Minecraft--quite the opposite: MineOS simply demonstrates what components make for a solid, stable server; it aims to include all the functionality a Minecraft admin should have while trimming out all the fat.\n\nTo provide a one-stop answer to Minecraft hosting, the following features are pre-configured, optimized, and/or available as tools at your disposal. For a full list, see the features page.\n\n    Web-based server admin page\n    -remotely manage your servers, backups, archives, mapping, and console from your browser\n    Improved, incremental world backups\n    -space-efficient and precise rdiff-backup method using the rsync algorithm\n    Single-click updating of the user-interface and server mods (such as vanilla, bukkit, canary)\n    c10t mapping at the touch of a button\n    Safer, more secure implementation/OS\n    -MineOS follows the close everything, then open what you need methodology.\n    Ramdisk setup for better responsiveness\n    And an incredibly small memory footprint, leaving your server with the most resources of any distro you'll ever use.  &lt;a href=&quot;\nhttp://minecraft.codeemo.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://minecraft.codeemo.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:f5db94888476b96f1d083ab2fe2dd5d6cb505b51","amp;dn":"MineOS+Crux+x64+0.4.11","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5db94888476b96f1d083ab2fe2dd5d6cb505b51","infoHashBuffer":{"type":"Buffer","data":[245,219,148,136,132,118,185,111,29,8,58,178,254,45,213,214,203,80,91,81]},"announce":[],"urlList":[]}}