{"title":"1337 SNES games on ROM (including 134 translations and 81 hacks!","uid":7617559,"size":1269600256,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:f721d856c4b733e9d35f6b72e3bd0d0c99e4f922&amp;dn=1337+SNES+games+on+ROM+%28including+134+translations+and+81+hacks%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pk123","files":-1,"time":1347243708,"description":"On top of the countless hours represented by the game developers who created\nthe Super Nintendo's original library and the ROM hackers who have made the\ndumps and various patches, this particular packaging of files took over a\nweek solid to piece together.  This is not due to the size of this package in\nitself; there are larger packages with more ROMs to be had, several of them\nboasting completeness.  It was, rather, due to what was left out:\n         \n     * If there is a valid ROM and a bad one, the bad one is left out.\n     * If there is a trainer ROM and a normal one, the trainer is left out.\n     * If there is a hack or an overdump, those are left out too.\n     * If there is a translation into anything but English, it's left out.\n     * If there is a E(uropean) version and a U(SA) version, E is left out.\n     * If there is more than one translation, all but one is left out.\n     * If there is a U/E release or translation, the Japanese is left out.\n     * In general, for any game in the package, only one ROM is left in.\n\nMeanwhile, there is no shortage of actual games to play.  In point of fact,\nthere are a total 1337 ROM files in the package.\n\n**** Mini &quot;Getting Started&quot; SNES Emulation FAQ ****\n\n1.  How do I play a game?\n\nYou should unzip either &quot;snes9x-1.51-win32.zip&quot; or &quot;zsnesw151.zip&quot; and\nlaunch the executable, then load your game of choice by clicking on its ZIP.\nNote that neither SNES9x nor ZSNES want to be &quot;installed&quot;; they just run.\n\n2.  How do I use the controls?\n\nIf you're unsatisfied with using a keyboard (and I don't blame you), there\nare a gamut of alternate input devices available to you, ranging from USB\ncorded controllers for the PC, to adapters for original Nintendo controllers,\nto the controllers for the PS3 and Xbox 360.  If it works in your operating\nsystem, it will work in SNES9x and ZSNES.\n\n3.  How do I use an ISO file?\n\nYou can mount it with something like &quot;Daemon tools&quot; or burn it to DVD.\nMounting lets you copy it to your hard drive without using a disc.\nThis torrent is a repack of the original containing all the files in\na single ISO file. (The Pirate Bay doesn't like its torrents to have over\n1000 files in general.)\n\n**** Enjoy and PLEASE SEED. My upload bandwidth is very limited. ****","torrent":{"xt":"urn:btih:f721d856c4b733e9d35f6b72e3bd0d0c99e4f922","amp;dn":"1337+SNES+games+on+ROM+%28including+134+translations+and+81+hacks%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f721d856c4b733e9d35f6b72e3bd0d0c99e4f922","infoHashBuffer":{"type":"Buffer","data":[247,33,216,86,196,183,51,233,211,95,107,114,227,189,13,12,153,228,249,34]},"announce":[],"urlList":[]}}