{"title":"Looper Discography [3 albums EAC+Log]","uid":7789328,"size":684525603,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f9f2dc396b58d558453dd487907b1a58868b5d99&amp;dn=Looper+Discography+%5B3+albums+EAC%2BLog%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sq3ak_","files":36,"time":1351975631,"description":"**This has nothing to do with the recent movie Looper.***\n\nWikipedia copypasta:\n\nLooper are a Scottish indie-pop band, fronted by Stuart David, former Belle and Sebastian bassist and his wife Karn who helped out at live shows. Later they added Ronnie Black on guitar and Scott Twynholm on the keyboard.\n\nThe band formed in 1998 for a show at the Glasgow School of Art and released their first single &quot;Impossible Things&quot; on the Subpop label a few months later.\n\nOriginally consisting of Stuart and his wife, Karn (who was mainly responsible for visual elements in the live shows, such as video projections, super 8 films, kinetic sculptures and photographic projections), they soon became a fully fledged band, adding Ronnie Black (guitarist) and Scott Twynholm (keyboards) to their lineup.\n\nTheir first album, Up a Tree, was released in 1999 on the Sub Pop label in the U.S. and by Jeepster Records in the rest of the world. It was followed in 2000 by The Geometrid on the same labels. After touring the U.S. for three months with The Flaming Lips in 2000 they signed to Mute Records for five albums. They recorded and released one, The Snare, and have now licenced their full back catalogue to Mute.\n\nSince then, Looper have been releasing their music free to the public at their Looperama website, funding this experiment by licensing the use of their songs in high-profile Hollywood films and ad campaigns, including the film Vanilla Sky and a Xerox advertising campaign. Other films their songs have appeared in include The Edukators, The Girl Next Door, Out Cold, and Dog Park.\n\nTheir most recognizable song is &quot;Mondo '77&quot; from their second album, The Geometrid. It has been featured in American television commercials for Xerox and Partnership for a Drug-Free America, in numerous films including Vanilla Sky and The Edukators, and on the American Dad episode &quot;All About Steve&quot;. Another track from that album, &quot;My Robot&quot;, is featured in the film The Girl Next Door. These two songs (&quot;Mondo '77&quot;, &quot;My Robot&quot;) are also featured in the Xbox video game Project Gotham Racing. The song &quot;Burning Flies&quot;, from the album Up a Tree, is part of the soundtrack to the Mission Hill Pilot episode.\n[edit]\nDiscography\nUp a Tree (1999)\nThe Geometrid (2000)\nThe Snare (2002)","torrent":{"xt":"urn:btih:f9f2dc396b58d558453dd487907b1a58868b5d99","amp;dn":"Looper+Discography+%5B3+albums+EAC%2BLog%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9f2dc396b58d558453dd487907b1a58868b5d99","infoHashBuffer":{"type":"Buffer","data":[249,242,220,57,107,88,213,88,69,61,212,135,144,123,26,88,134,139,93,153]},"announce":[],"urlList":[]}}