{"title":"PBS Bill Moyers The 11th of Septemberxvid mp3 dvd rip","uid":7613782,"size":732744227,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fafce10f4c1621deb5cee78a7b927617b6f9cf82&amp;dn=PBS+Bill+Moyers+The+11th+of+Septemberxvid+mp3+dvd+rip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"catflap","files":2,"time":1347143016,"description":"PBS Bill Moyers In Conversation - The 11th of September\n\nSize: 732,739,584 bytes\nPlay duration: 01:59:58\nXviD\nmp3\nDVD Rip\n\n**********\n**********\n\nIn a series of special 30-minute programs journalist Bill Moyers\nspeaks with guests from the humanities and faith communities to\nexplore the background and aftermath of the terrorist attacks on\nNew York City and Washington, D.C.\n\nIn the wake of the devastating national tragedy of September 11, 2001,\na stunned America was forever changed. Realizing the importance of\na national dialogue in understanding the cause for the terrorist attacks\nand planting the seeds that would begin the long and painful healing\nprocess, award-winning journalist Bill Moyers sat down with a diverse\ngroup of key experts to discuss the sensitive issue a mere 36 hours\nafter the fall of the World Trade Center. Through conversation with\nsuch guests as authors Robert Jay Lifton and Tamim Ansary, Moyers\ncaptures a nations grief and hope while simultaneously creating an\nunforgettable snapshot of a key moment in world history.\n\nTwo days after the September 11, 2001, terrorist attacks on the\nUnited States, Bill Moyers began interviewing people about the\nsignificance of what had happened. It may have seemed too soon for\nsuch reflection, yet one could make the case that thoughts expressed\nby Moyers's guests in the immediate aftermath entirely outclass the\ncountless hours of news and analysis shows that followed.\n\nThe interviews are vintage Moyers, who sits and quietly speaks one-on-one\nwith such people as author Robert J. Lifton, Harvard religion professor\nDiana Eck, theatrical director Julie Taymor, and Afghan-American\neditor and writer Tamim Ansary (whose passionate explanatory e-mail\nabout Afghanistan was widely circulated on the Internet soon after\nthe attacks).\n\nPeople talk of good and evil, religion and mythology, heroism and\nhumanity, all with a level of nuance never to be found on the cable\nnetwork shoutfests. No one raises his or her voice, yet much of what\nis said will resonate in one's thoughts after the TV tube has grown cold.\n\n**********\n**********\n\nTHIS IS MY OWN DVD RIP AND ENCODE.\n\nIF YOU WANT THE INFERIOR X264 VERSION, GO SOMEWHERE ELSE.\n\nDON'T COMPLAIN. DON'T WHINGE OR WHINE. IT'S FREE.\n\nAND I'M NOT INTERESTED.","torrent":{"xt":"urn:btih:fafce10f4c1621deb5cee78a7b927617b6f9cf82","amp;dn":"PBS+Bill+Moyers+The+11th+of+Septemberxvid+mp3+dvd+rip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fafce10f4c1621deb5cee78a7b927617b6f9cf82","infoHashBuffer":{"type":"Buffer","data":[250,252,225,15,76,22,33,222,181,206,231,138,123,146,118,23,182,249,207,130]},"announce":[],"urlList":[]}}