{"title":"Criminal Minds Seizoen 1 DVD 2 (Multis audio subs) TBS","uid":6798799,"size":4622681017,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fb1b565c13cabde4754b80167f9ab15b04b8d28f&amp;dn=Criminal+Minds+Seizoen+1+DVD+2+%28Multis+audio+subs%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Betty-Boop","files":-1,"time":1320579881,"description":"Criminal Minds Seizoen 1 DVD 2 \t\n\n SERIE\n\nFBI-agenten Jason Gideon (Mandy Patinkin) en Aaron \\&quot;Hotch\\&quot; Hotchner staan aan het hoofd van een Behavioral Analysis Unit van de FBI in Quantico, een team \\&quot;profilers\\&quot; dat gespecialiseerd is in het analyseren van de gedachtengang van criminelen. Teamgenoot Dr Spencer Reid (Matthew Gray Gubler) compenseert zijn gebrek aan sociale vaardigheden met een hoog IQ en uitstekend denkwerk. Derek Morgan (Shemar Moore) is een specialist in obsessionele misdaden en Elle Greenway (Lola Glaudini) heeft zich toegelegd op het onderzoek van seksuele misdrijven. Jennifer \\&quot;JJ\\&quot; Jareau (A.J. Cook) is de woordvoerster van het team terwijl Penelope Garcia (Kirsten Vangsness) altijd aan haar computers klaar zit om allerhande informatie op te snorren.\n\n1.5. Broken Mirror\nHet team wordt ingeschakeld wanneer de dochter van een openbare aanklager wordt ontvoerd. Wanneer de ontvoerder er op staat enkel met de tweelingszus van zijn slachtoffer te onderhandelen, is het duidelijk dat geld niet zijn motief is...\n\n1.6. L.D.S.K.\nDe FBI zit een sluipschutter achterna die zijn slachtoffers niet doodt, enkel verwondt. Geruchten doen de ronde dat de scherpschutter in werkelijkheid een politieman is.\n\n1.7. The Fox\nHele gezinnen, die net op het punt stonden om met vakantie te vertrekken, worden thuis gegijzeld en vervolgens vermoord. Steeds volgens dezelfde werkwijze...\n\n1.8. Natural Born Killer\nDe FBI achtervolgt een seriemoordenaar met een woelig maffia-verleden. Er begint een race tegen de klok om zijn meest recente slachtoffer, een federaal agent, te vinden.\n\nEnglish\n\nStoryline\n\nBased in Quantico, Virginia, the Behavioral Analysis Unit (BAU) is a subsection of the FBI. Called in by local police departments to assist in solving crimes of a serial and/or extremely violent nature where the perpetrator is unknown (referred to by the Unit as the unknown subject or unsub for short), the BAU use the controversial scientific art of profiling to track and apprehend the unsub. Profiling entails coming up with basic characteristics of the unsub and the victims (referred to as the victimology), using evidence from the case and matching that information to historic precedents and psychological analyses as a means to solve the case. Because of the nature of the work conducted by the BAU - the work being time consuming and psychologically demanding - its members are fiercely loyal to the Unit and to its other members. Also because of the work's overall demanding nature, not many members of the BAU have been able to maintain a happy or stable family life.\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0452046/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0452046/&lt;/a&gt;\n*****************************************************************************************\n\nSpotinfo\n\nSource : Retail\n\nFormaat : DVD5\n\nMenu : Retail\n\nAudio : Engels French Spanish DD5.1\n \nOndertiteling : English, French, Spanish, Dutch,Swedish, Norwegian, Danish, Icelandic\nCover : Multi DVD cover in deel 1\n\n@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\n\nKom ook eens kijken :\n     &lt;a href=&quot;\nhttp://black-sam.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://black-sam.org&lt;/a&gt;\n\nEnjoy\n\n\n@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\t","torrent":{"xt":"urn:btih:fb1b565c13cabde4754b80167f9ab15b04b8d28f","amp;dn":"Criminal+Minds+Seizoen+1+DVD+2+%28Multis+audio+subs%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb1b565c13cabde4754b80167f9ab15b04b8d28f","infoHashBuffer":{"type":"Buffer","data":[251,27,86,92,19,202,189,228,117,75,128,22,127,154,177,91,4,184,210,143]},"announce":[],"urlList":[]}}