{"title":"BlacksOnBlondes - Phoenix Askani HD 720","uid":7794529,"size":844601421,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:fbc654746ac557da2b183a7b16c86c2161e3dcfc&amp;dn=BlacksOnBlondes+-+Phoenix+Askani+HD+720&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"R0thschild","files":1,"time":1352108790,"description":"Gallery: \n &lt;a href=&quot;\nhttp://imagedomino.com/?g=115571&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imagedomino.com/?g=115571&lt;/a&gt;\n\nPhoenix Askani's head hasn't been in the right places lately Her boyfriend? He's packing as much as a mouse. And all she can think\nabout is big black cock. And it's not just any big black cock: it's her therapist's and she's walking on thin ice by revealing this dilemma to Dr.\nSteele. How can she add more fuel to her fire? It could only be that she wants to end their professional relationship on grounds that she feels the\ndistraction in his pants won't do anything for her mental health. Phoenix knows that the clock is running on her session with the good doctor and\nthings heat up when Phoenix starts sucking on that huge black cock. The twelve inches in Dr. Steele's pants is the only prescription that Phoenix\nneeds and she continues to suck down on his massive black dick. It's nice to know that Little Timmy is at home while his girlfriend is risking the\ndoctor's license as she continues to give him an ultimate blowjob. The client's wet pussy drenches every inch of that big black cock as it pistons\nin and out of that creamy pussy. Phoenix seems to forget that she's cheating on her boyfriend AND fucking the guy that knows her as well as anyone.\nNevertheless, Phoenix Askani takes that big black cock and moves it south towards her ass. The doctor rams his big black cock in her ass until her\nlungs nearly collapse from going into overtime.Dr. Lexington Steele drills her ass until his balls send that signal to his brain telling him to coat\nthat white girl's face with his jizz. Phoenix Askani gets what she wanted and a bill of $3000 can only mean that's she's going to keep visiting the\nhung black doctor-after hours, of course.","torrent":{"xt":"urn:btih:fbc654746ac557da2b183a7b16c86c2161e3dcfc","amp;dn":"BlacksOnBlondes+-+Phoenix+Askani+HD+720","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fbc654746ac557da2b183a7b16c86c2161e3dcfc","infoHashBuffer":{"type":"Buffer","data":[251,198,84,116,106,197,87,218,43,24,58,123,22,200,108,33,97,227,220,252]},"announce":[],"urlList":[]}}