{"title":"vlc-1.2.0-x64-pre1-20111107-0103-win32.exe","uid":6800525,"size":20798199,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fd03d1e24316f78737c17f1e0772f3a97428935c&amp;dn=vlc-1.2.0-x64-pre1-20111107-0103-win32.exe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Tyr3ll","files":-1,"time":1320674562,"description":"here it is another fresh new beta pre build1 of vlc media player 1.2.0-git\nfrom today : november 7\nnow called as 1.2.0-Pre build1 for new test anyway.\nNot official yet,still as beta stage and still under development anyway.\n\nfew details now on changelog between 1.1.11 and 1.2.0-pre1 :\n\nChanges between 1.1.x and 1.2.0-pre1:\n------------------------------------\n\nImportant notes:\n\n * Start/end titles/chapters are now specified with # rather than @ to fix\n   conflicts with some URLs and file names. For instance, this plays a DVD\n   from the 2nd chapter of the 1st title up to the 4th chapter of the 3rd\n   title:  vlc dvd://#1:2-3:4\n * The 40+ --*-caching options were simplified and dumbed down to 4 options:\n   - --file-caching specifies caching for local files,\n   - --network-caching specifies caching for network resources,\n   - --live-caching specifies caching for capture devices and\n   - --disc-caching specifies caching for local optical media.\n   All values are expressed in milliseconds as in previous versions.\n * HTTP server IP address, port, and TLS configuration is now centralized:\n   - The --http-host option sets the address, e.g. &quot;--http-host=2001:db8::1&quot;.\n     By default, both :: and 0.0.0.0 are used.\n   - The --http-port and --https-port options set the port numbers.\n     By default, 8080 is used for HTTP, and 8443 for HTTPS.\n   - The TLS credentials are configured with --http-cert (public certificate),\n     --http-key (private key), --http-ca (optional CA) and\n     --http-crl (optional CRL).\n * RTSP server IP address and port are updated similarly.\n   Use --rtsp-host and --rtsp-port respectively.\n * The --miface-addr option does not exist anymore. To select the multicast\n   output interface, use --miface instead, e.g. --miface=eth0.\n * The Windows version will only work with Windows XP SP2 or later.\n   Windows 2000 SP4, Windows XP &lt; SP2, Windows 2003 SP0 are now unsupported.\n\nImportant changes for packagers:\n\n * The default builds now assume that the operating system uses UTF-8 for\n   its file systems and files content (except the Windows port). If this is\n   not acceptable, pass --enable-non-utf8 to the configure script.\n   Non-UTF-8 file systems support will be removed in future versions.\n * The VLC plugins path can be overridden with the VLC_PLUGIN_PATH environment\n   variable. The --plugin-path command line option was removed.\n * The default tarballs are now compressed with XZ/LZMA: .tar.xz\n * OSS support is not compiled on Linux by default, pass --enable-oss to the\n   configure script if you use OSSv4 or really want to use OSS emulation.\n\n * The NPAPI webplugin has moved to git://git.videolan.org/npapi-vlc.git\n * The ActiveX webplugin has moved to git://git.videolan.org/activex-vlc.git\n\nCore:\n\n * Major Video Core and Outputs rework and rewrite:\n   Subtitles, subpictures and OSD can now be sized and blent inside video outputs\n   x11 (Unix), OpenGL (Unix) and Direct3D (Windows) are such video outputs.\n * Almost every video filter can now be transcoded\n * Playback rate doesn't get resetted to 1 between items anymore\n * Option --sub-filter was renamed --sub-source\n * Port to Android, iOS, OS/2 and Win64\n\nAccess:\n\n * Multiple files are now supported inside RAR files\n * BDA: experimental support for ClearQam devices\n * DVB-S scanning support on Unix\n * DVB-C scanning on Unix scans correct modulation/symbolrate if needed\n * DShow: support for freq and video standard selection\n * Support for VDR recordings (http://www.tvdr.de/) folders\n * Blu-Ray Discs integration using libbluray\n * HTTP Live Streaming (IETF draft) playback support\n * Blackmagic DeckLink SDI cards input support (Linux only currently)\n * Linear Systems (HD-)SDI cards input support (Linux)\n * PulseAudio audio input support\n * RTP: support for dynamic payload types by specifying the payload format\n   in an option (no autodetection): only Theora supported for now\n * Basic HTCPCP implementation for Coffee Pot control\n * QTCapture: added support for all QTKit-compatible video input devices\n * QTSound: added support for all QTKit-compatible audio input devices\n * X11 Screen: support for capturing partially hidden windows\n * MPEG DASH (Dynamic Adaptive Streaming over HTTP) support\n\nCodecs:\n\n * You can now use ffmpeg-mt in conjunction with vlc\n * Important fixes for RealVideo 3.0 and 4.0 playback, notably in MKV\n * Experimental Hardware decoding using Broadcom CrystalHD cards\n * New module for decoding EBU subtitles (.stl)\n * Support for 9bits and 10bits H.264/AVC decoding\n * Support for 20-bits PCM and DAT-12 (digital magnetic tapes) from RTP\n * New module for Dirac encoding, using the faster libschroedinger\n   The Schroedinger module should be prefered to the Dirac one\n * Support for WMV Images, aka WMVP and WVP2, as used by Photo Story\n * Support for Lagarith Lossless video codec\n * Support for ProRes 422 video codec in 10bits\n * EIA-608 closed captions improvements\n * Support for JPEG 2000 and Motion JPEG 2000 in the Windows and Mac binaries\n * Experimental support of IOMX for OpenMAX IL codecs on Android\n * One can use &quot;mp2 &quot; fourcc to encode in mpeg1/2 layer 2\n\nDemuxers:\n\n * New images demuxer supporting jpeg, png, targa, xcf, git, tiff, bmp, pcx, lbm\n * C64 SID file playback support of using sidplay2\n * Support for images/cover art in wma/wmv/asf files\n * Improvements in .ape files metadata reading and writing\n * New demuxer module for EBU subtitles (.stl)\n * Support for caf, mtv, awb, f4v, amr, vro (DVD-VR) files\n * Ogg, flv, mxf, amr seeking improvements\n * Major improvements in Matroska (mkv) chapters/segments handling and seeking\n * Support for duration and better seeking in Mpeg-TS files (.ts, .m2ts, .mts)\n * Mov improvements, notably for aspect-ratio handling and Audio DV tracks\n * Improved support of tracker files\n\nInterfaces:\n\n * Qt: effects dialogs rework\n * Qt: new CoverFlow-like view of the playlist\n * Qt: port to MacOS X platform\n * Qt: small look improvements\n * Skins2 / Qt: misc improvements and usability fixes\n * Skins2: fullscreen controller support, relative placement support\n   and important cleanups and optimisations\n * Mac OS X: re-written Main Window, which also includes the Video Windows\n * Mac OS X: new Audio Effects panel adding Compressor and Spatializer filters\n * Mac OS X: new Track Synchronization panel\n * Mac OS X: new Video Effects panel for color and geometry adjustments\n * Mac OS X: re-written Open Disc functionality with automatic media detection\n * Mac OS X: support for the native fullscreen mode on OS X Lion\n * Mac OS X: enhanced AppleScript support\n * The rc and telnet lua interfaces were merged into a new &quot;cli&quot; interface\n * ncurses: heavy refactor of the complete interface\n * dbus: Rewrite of the main loop to use a more efficient poll-based model\n * dbus: Upgrade to an mpris2 compliant interface, see http://www.mpris.org\n * webUI/http: Rewrite of the web interface, using jQuery\n * webUI/http: some requests are now supported in JSON in addition to XML\n * webUI/http: path values for input and output are deprecated in favour of uri\n * Qt/Win32: the update system now downloads the updates in the temp folder\n * Qt: preferences are now searchable\n\nVideo Output:\n\n * New video output based on Direct2D for Windows 7 and Vista (with Platform Update)\n * New video output for iOS platform\n * Experimental work in progress on a video output using EGL\n * Adaptation of the OpenGL layer for OpenGL ES 1.1\n * Various vmem improvements\n * OpenGL video output now accepts YUV as input and uses fragment programs for\n   chroma conversion\n * New video output for Android platform, based on Surface\n * Support for 9/10bits output in the OpenGL output\n * Updated OpenGL video output for Mac, requires a Quartz Extreme capable machine\n\nAudio Output and Filters:\n\n * New audio output based on AudioQueue API for iOS\n * New audio output in memory (amem)\n * Important simplification and improvements in the core audio output\n * New audio output based on OpenSL ES API for Android\n * New audio resampler using Speex (DSP)\n * New audio resampler using the Secret Rabbit Code (a.k.a. libsamplerate)\n * New Compressor filter, a dynamic range compressor\n * New simplistic Karaoke filter\n * New audio output based on kai API for OS/2\n\nVideo Filter:\n\n * New gradfun filter for debanding videos using dithering\n * Rewrite of the grain filter, faster and with better quality\n * New posterize filter for lowering the number of colors\n * Atmo ambilight: improve Fnordlicht up to 254 channels\n * New sepia filter for creating sepia effect in videos\n * New deinterlacer mode Phosphor, a framerate doubling CRT TV simulator\n * New deinterlacer mode IVTC, to do live inverse telecine for NTSC films\n * New subsdelay filter to change subtitles delay\n * New anti-flickering filter\n * New OpenMAX DL IPCS filter for color space conversion and resizing\n * Major improvements in the freetype text-rendering module, notably supporting\n   blackbox and customizable shadow.\n   NB: The freetype module is now used by default on the Mac OS X instead of\n   the quartztext module, which can still be enabled manually.\n   The Win32 font selection was improved too.\n\nStream output:\n\n * New livehttp-module for HTTP Live Streaming (IETF draft) output\n   example: vlc inputfile :sout=&quot;#transcode{vcodec=h264,acodec=mp3,\n    venc=x264{profile=baseline},width=320,vb=256,ab=96}:std{\n    access=livehttp{index=public_html/iphonestream.m3u8,\n    index-url=http://url-to-iphonestreamfile-###.ts},mux=ts{use-key-frames},\n    dst=public_html/iphonestreamfile-###.ts}&quot;\n * RTP: support for Vorbis and Theora\n * Major rework of VoD support\n * New delay module, to introduce delays of one ES, when streaming:\n       #delay{id=12,delay=500}:standard...\n * New setlang, setid modules to change lang or id of one ES, when streaming:\n       #setid{id=12,new-id=42}:std...\n * New langfromtelx module, to change lang of one ES, when streaming, based on\n   a telextex page: #langfromtelx{id=12,magazine=7,page=0x99,row=1}:std...\n * New select module, to replace an existing ES with another ES in the same track\n   #duplicate{dst=bridge-out{id=1},select=video,dst=bridge-out{id=0xa3},select=audio}\n   #transcode{...}:bridge-in{id-offset=0}:select{disable=0}:setid{id=0,newid=0xa3}:autodel:std{...}\n * New libavformat/avio access_output module for network streaming\n\nServices Discovery:\n\n * Search API to be able to query distant search APIs from the interfaces\n * Upnp module was ported to Win32\n\nlibVLC:\n\n * New capabilities for libVLC:\n  ** libvlc_media_player_navigate for DVD navigation\n  ** libvlc_audio_filter_list_get, libvlc_video_filter_list_get to get the\n     list of available audio and video filters\n  ** libvlc_audio_set_format, libvlc_audio_set_format_callbacks,\n     libvlc_audio_set_callbacks\n     allow grabbing audio data from a chosen memory location in real-time.\n\nRemoved modules:\n\n * asademux: use libass only\n * subsass: use libass\n * fake, invmem: use the new image demuxers\n * hal, v4l, gapi, omapfb, hd1000a, hd1000v: obsolete unmaintained modules\n * id3tag: use taglib\n * upnp: use upnp_intel\n * removal of old telnet interface in favor of the new lua CLI\n * removal of http interface in favor of luahttp\n * removal of the noise filter\n * removal of the SDL audio output, use the native outputs\n * growl_udp: use Growl for local notifications on the Mac. UDP support will be\n              removed in Growl's next release, too.\n * removal of the OSSO screensave module, use the MCE one\n\nuntouched and delivered such &quot;as is&quot; for personal testing purpose only.\nthis version is for windows x64 only !!!\n\nEnjoy\n\nhave a nice day\n\nbest regards","torrent":{"xt":"urn:btih:fd03d1e24316f78737c17f1e0772f3a97428935c","amp;dn":"vlc-1.2.0-x64-pre1-20111107-0103-win32.exe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd03d1e24316f78737c17f1e0772f3a97428935c","infoHashBuffer":{"type":"Buffer","data":[253,3,209,226,67,22,247,135,55,193,127,30,7,114,243,169,116,40,147,92]},"announce":[],"urlList":[]}}