{"title":"Lucy Dillon - Ensamma hjartan och hemlosa hundar - 2011 - DAISY","uid":6806877,"size":331341239,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:fd6074845c1bfbbfc911929aaab8c09463be390f&amp;dn=Lucy+Dillon+-+Ensamma+hjartan+och+hemlosa+hundar+-+2011+-+DAISY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":-1,"time":1320897095,"description":"Rachel Fielding har pa kort tid lyckats forsnilla ett glamorost jobb pa en pr-firma, en attraktiv pojkvan och en chic vaning i centrala London. Hon ar trettionio ar och framtiden ter sig tamligen osaker. Men en dag far hon ett ovantat besked. Moster Dot har latit Rachel arva hennes hus pa landet - samt mosterns bordercollie Gem och en hundgard full med herrelosa hundar.\n\nDet ar med viss bavan Rachel flyttar dit - omplacering av hundar ar inte ens i narheten av vad hon har tankt sig. Hon blir dock alltmer engagerad i sina fyrfota skyddslingar. Kanske beror det delvis pa George, traktens buttre men rysligt attraktive veterinar som Rachel allt oftare konsulterar .\n\nEnsamstaende tvabarnsmamman Zoe kommer till Rachel for att lamna en liten valp for omplacering. Besoket resulterar i nagot helt annat an hon tankt sig: valpen far en dagisplats mot att Zoe hjalper Rachel med hundarna pa helgerna. Zoe borjar ga hundpromenader och stoter allt oftare pa Bill, en omvittnat svarfangad ungkarl.\n\nNatalie lever i ett lyckligt men barnlost aktenskap med Johnny. Nar Natalie forlorar jobbet bestammer de sig for att tillfalligt ta hand om en av Rachels hundar, en glupsk och egensinnig basset vid namn Bertie. Detta visar sig medfora en minst sagt overraskande forandring i deras liv . \n\n\nUpplasare: Anna Godenius","torrent":{"xt":"urn:btih:fd6074845c1bfbbfc911929aaab8c09463be390f","amp;dn":"Lucy+Dillon+-+Ensamma+hjartan+och+hemlosa+hundar+-+2011+-+DAISY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd6074845c1bfbbfc911929aaab8c09463be390f","infoHashBuffer":{"type":"Buffer","data":[253,96,116,132,92,27,251,191,201,17,146,154,170,184,192,148,99,190,57,15]},"announce":[],"urlList":[]}}