{"title":"Real Warfare 2 Northern Crusades-SKIDROW","uid":6823206,"size":1063660513,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fe5f4ba34305e44a07716db76b118a341c8bb619&amp;dn=Real+Warfare+2+Northern+Crusades-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"HeroMaster","files":-1,"time":1321472615,"description":"S  K  I  D  R  O  W\n.the leading force.\n\nproudly presents\nReal Warfare 2: Northern Crusades (c) 1C Company\n\n16-11-2011........Release Date - Protection...........StarForce\nStrategy.............Game Type - Disk(s)..................1 DVD\n\nRELEASE NOTES\n\nReal Warfare 2: Northern Crusades is the next step in this series of\nrealistic real-time strategy games covering various periods in the\ndevelopment of the present day civilization - from the Middle Ages to\ntoday.\n\nThis new title helps players witness the key events in the history of\nthe Teutonic Order in 13th century, namely conquering the pagan\nPrussia. All battles form a single storyline campaign. The player will\nact as a Komtur of the Teutonic Order as they relive the battles of the\ncrusaders, regardless of the low manpower of the Order and the strong\nresistance of the heathens.\n\nThe project perfectly comprises two types of gameplay and owing to that\nthe objectives of the Komtur are not simply limited to participation in\nbattles.\n\nThe strategic map involves the gamer into a colorful and integral world\nand allows them to travel around the map in the real time. The mode\nfeatures full freedom of movement, dialogues with locals, RPG elements,\nquest system and much more. However, sooner or later, the players will\nhave no other choice other than engage their faithful warriors into a\nbattle. And this could be a combat with other armies, large-scale\nsieges of towns and castles, using various special assault weaponry and\ntools and fight right on top the walls and fortifications.\n\nFeatures:\n\nRPG system Troops gain experience throughout the campaign and carry it\nover from mission to mission.\n\nCombat system A unique combat system, dependent on up to 80 game\nfactors. Moral component of the combat system evaluates the battlefield\nsituation every second to bring the simulation of combat behavior for\nthe &quot;living&quot; warriors as close to reality as possible.\n\nUnprecedented scale Real Warfare 2: Northern Crusades features not only\nreally large-scale battles with more than 10,000 warriors engaged, but\nimpressive and unprecedentedly vast actions during the siege and\ndefense of towns and castles, using various special assault weaponry\nand tools and fight right on top the walls and fortifications.\n\nFreedom of actions Variable modifiers consider the environment a unit\nis battling in and make the game tactically versatile.\n\nTwo gameplay modes The game now features a strategic map, where the\nplayer can travel around the world and interact with various\ncharacters however the battles will be carried out in the well-known\ntactical mode.\n\nNetwork game Apart from the storyline campaign the game features\nseveral diverse multiplayer modes. From 2 up to 6 gamers can\nparticipate in a battle at a dedicated Internet server. The final\nresults will form online Hall of Fame.\n\nState-of-the-art graphics Graphics engine used in the game provide for\nthe highest level of details. Historically correct armor and weaponry,\nrealistic animation and battle scenes, which correspond to the specific\nperiod - Real Warfare 2: Northern Crusades depicts the 13th century in\ngreat details.\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy everything from the SKIDROW folder into the game installation\n5. Play the game\n6. Support the companies, which software you actually enjoy\n\nGREETINGS\n\nTo all friends of the family and honorable rival groups\n\nascii art by the\ngodlike &amp; terrific duo\nmalodix  irokos\ntitan artdivision\n\n\nSystem requirements:\n\n- Operating system: Microsoft Windows XP SP2 / Vista / 7\n- Processor: Intel Pentium 2,0 GHz/AMD 2000+\n- Memory: 512 MB\n- Hard disk space: 3 Gb free hard disk space\n- Video: GeForce 7300/Radeon 9200 or better\n- Sound: DirectX compatible\n- DirectX: DirectX 9.0c \n\n\nPoster:\n\n &lt;a href=&quot;\nhttp://i.imgur.com/To9k6.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/To9k6.jpg&lt;/a&gt;\n\n\nScreens:\n\n &lt;a href=&quot;\nhttp://i.imgur.com/CIClS.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/CIClS.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i.imgur.com/LDNVl.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/LDNVl.jpg&lt;/a&gt;\n\n\nENJOY!","torrent":{"xt":"urn:btih:fe5f4ba34305e44a07716db76b118a341c8bb619","amp;dn":"Real+Warfare+2+Northern+Crusades-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe5f4ba34305e44a07716db76b118a341c8bb619","infoHashBuffer":{"type":"Buffer","data":[254,95,75,163,67,5,228,74,7,113,109,183,107,17,138,52,28,139,182,25]},"announce":[],"urlList":[]}}