{"title":"Michael Moore unabridged audiobook Here Comes Trouble","uid":6799339,"size":737474703,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:fe9d6ecb37041111bd3de0772718f9848a260456&amp;dn=Michael+Moore+unabridged+audiobook+Here+Comes+Trouble&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":-1,"time":1320595960,"description":"Michael Moore-Oscar-winning filmmaker, bestselling author, the nation\\'s unofficial provocateur laureate-is back, this time taking on an entirely new role, that of his own meta-Forest Gump.\n\nBreaking the autobiographical mode, he presents twenty-four far-ranging, irreverent, and stranger-than-fiction vignettes from his own early life. One moment he\\'s an eleven-year-old boy lost in the Senate and found by Bobby Kennedy; and in the next, he\\'s inside the Bitburg cemetery with a dazed and confused Ronald Reagan. Fast-forwarding to 2003, he stuns the world by uttering the words \\&quot;We live in fictitious times . . . with a fictitious president\\&quot; in place of the expected \\&quot;I\\'d like to thank the Academy.\\&quot;\n\nAnd none of that even comes close to the night the friendly priest at the seminary decides to show him how to perform his own exorcism.\n\nCapturing the zeitgeist of the past fifty years, yet deeply personal and unflinchingly honest, HERE COMES TROUBLE takes readers on an unforgettable, take-no-prisoners ride through the life and times of Michael Moore. No one will come away from this book without a sense of surprise about the Michael Moore most of us didn\\'t know. Alternately funny, eye-opening, and moving, it\\'s a book he has been writing-and living-his entire life. \n\nRead by Michael Moore","torrent":{"xt":"urn:btih:fe9d6ecb37041111bd3de0772718f9848a260456","amp;dn":"Michael+Moore+unabridged+audiobook+Here+Comes+Trouble","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe9d6ecb37041111bd3de0772718f9848a260456","infoHashBuffer":{"type":"Buffer","data":[254,157,110,203,55,4,17,17,189,61,224,119,39,24,249,132,138,38,4,86]},"announce":[],"urlList":[]}}