{"title":"Sexually Broken--Squirt Couch Strikes Again!  Annie Cruz","uid":7664381,"size":567899105,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:ff7d75e527ee7b0db61f1183653a60145b99f0a5&amp;dn=Sexually+Broken--Squirt+Couch+Strikes+Again%21++Annie+Cruz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1348401186,"description":"Squirt Couch Strikes Again! Massive repeated discharge, brutal face and pussy fucking! | Annie Cruz\n\nSeptember 17, 2012\n\n\nMP4 only.\n\n\nWelcome back Annie Cruz to Sexually Broken. This sexy hot Asian girl squirts buckets when she cums, and we make her cum a lot!! \n\nAnnie finds herself completely helpless with her elbows touching behind her head, on her knees sucking cock while we take pictures to send to her mother. People should not leave their phones just sitting around without a passlock. \n\nThis blow job quickly turns into a brutal skull fucking. Breath play at it's finest and extreme. Once we have Annie all loopy from deep throating, we toss her up on the couch, before she even knows whats going on, she is being fucked and is cumming. Annie get sexually destroyed in a fierce sexual skirmish. \n\nFrom brutal pussy fucking to deep throat fucking to making her squirt gallons, Annie is destroyed over and over, back and forth, she can't even catch her breath! Once she massively squirts in a screaming brutal orgasm, she is quickly flipped over and throat fucked. It is a non-stop, never let up assault that causes Annie to cum and squirt over and over and over. \n\nIn the end Annie is left lying in a gallon of her own squirt, wondering what the fuck just happened. Her brain is locked deep into subspace, and nothing make sense to her, at all!\n\nSexually Broken is most authentic bondage and sex site on the net. This is the source, this is where the competition comes to get ideas. No other site brings you so many updates and different girls in a month! Join today, and see why Sexually broken is the fastest growing sex and bondage site in the world!\n\nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/09_17annie2/SexuallyBroken-Annie-Cruz-Matt-Williams-Squirt-Couch-Strikes-Again-Massive-repeated-discharge-brutal-face-and-pussy-fucking.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/09_17annie2/SexuallyBroken-Annie-Cruz-Matt-Williams-Squirt-Couch-Strikes-Again-Massive-repeated-discharge-brutal-face-and-pussy-fucking.php&lt;/a&gt;\n\n8000 uploads and counting, if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)   \n \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:ff7d75e527ee7b0db61f1183653a60145b99f0a5","amp;dn":"Sexually+Broken--Squirt+Couch+Strikes+Again%21++Annie+Cruz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff7d75e527ee7b0db61f1183653a60145b99f0a5","infoHashBuffer":{"type":"Buffer","data":[255,125,117,229,39,238,123,13,182,31,17,131,101,58,96,20,91,153,240,165]},"announce":[],"urlList":[]}}